mod ctypes {
                    pub type c_void = core::ffi::c_void;
                    pub type c_char = u8;
                    pub type c_int = i32;
                    pub type c_long = i64;
                    pub type c_longlong = i64;
                    pub type c_schar = i8;
                    pub type c_short = i16;
                    pub type c_uchar = u8;
                    pub type c_uint = u32;
                    pub type c_ulong = u64;
                    pub type c_ulonglong = u64;
                    pub type c_ushort = u16;
                    pub type size_t = u64;
                    pub type ssize_t = i64;
                    pub type c_float = f32;
                    pub type c_double = f64;
                }/* automatically generated by rust-bindgen */

pub const __LINUX__ : i32 = 1 ; pub const SIZEOF_VOIDP : i32 = 8 ; pub const HAVE_GCC_ATOMICS : i32 = 1 ; pub const HAVE_LIBC : i32 = 1 ; pub const STDC_HEADERS : i32 = 1 ; pub const HAVE_ALLOCA_H : i32 = 1 ; pub const HAVE_CTYPE_H : i32 = 1 ; pub const HAVE_FLOAT_H : i32 = 1 ; pub const HAVE_ICONV_H : i32 = 1 ; pub const HAVE_INTTYPES_H : i32 = 1 ; pub const HAVE_LIMITS_H : i32 = 1 ; pub const HAVE_MALLOC_H : i32 = 1 ; pub const HAVE_MATH_H : i32 = 1 ; pub const HAVE_MEMORY_H : i32 = 1 ; pub const HAVE_SIGNAL_H : i32 = 1 ; pub const HAVE_STDARG_H : i32 = 1 ; pub const HAVE_STDINT_H : i32 = 1 ; pub const HAVE_STDIO_H : i32 = 1 ; pub const HAVE_STDLIB_H : i32 = 1 ; pub const HAVE_STRINGS_H : i32 = 1 ; pub const HAVE_STRING_H : i32 = 1 ; pub const HAVE_SYS_TYPES_H : i32 = 1 ; pub const HAVE_WCHAR_H : i32 = 1 ; pub const HAVE_MALLOC : i32 = 1 ; pub const HAVE_CALLOC : i32 = 1 ; pub const HAVE_REALLOC : i32 = 1 ; pub const HAVE_FREE : i32 = 1 ; pub const HAVE_ALLOCA : i32 = 1 ; pub const HAVE_GETENV : i32 = 1 ; pub const HAVE_SETENV : i32 = 1 ; pub const HAVE_PUTENV : i32 = 1 ; pub const HAVE_UNSETENV : i32 = 1 ; pub const HAVE_QSORT : i32 = 1 ; pub const HAVE_ABS : i32 = 1 ; pub const HAVE_BCOPY : i32 = 1 ; pub const HAVE_MEMSET : i32 = 1 ; pub const HAVE_MEMCPY : i32 = 1 ; pub const HAVE_MEMMOVE : i32 = 1 ; pub const HAVE_WCSLEN : i32 = 1 ; pub const HAVE_WCSCMP : i32 = 1 ; pub const HAVE_STRLEN : i32 = 1 ; pub const HAVE_STRLCPY : i32 = 1 ; pub const HAVE_STRLCAT : i32 = 1 ; pub const HAVE_STRCHR : i32 = 1 ; pub const HAVE_STRRCHR : i32 = 1 ; pub const HAVE_STRSTR : i32 = 1 ; pub const HAVE_ITOA : i32 = 1 ; pub const HAVE_STRTOL : i32 = 1 ; pub const HAVE_STRTOUL : i32 = 1 ; pub const HAVE_STRTOLL : i32 = 1 ; pub const HAVE_STRTOULL : i32 = 1 ; pub const HAVE_ATOI : i32 = 1 ; pub const HAVE_ATOF : i32 = 1 ; pub const HAVE_STRCMP : i32 = 1 ; pub const HAVE_STRNCMP : i32 = 1 ; pub const HAVE_STRCASECMP : i32 = 1 ; pub const HAVE_STRNCASECMP : i32 = 1 ; pub const HAVE_VSSCANF : i32 = 1 ; pub const HAVE_VSNPRINTF : i32 = 1 ; pub const HAVE_ACOS : i32 = 1 ; pub const HAVE_ACOSF : i32 = 1 ; pub const HAVE_ASIN : i32 = 1 ; pub const HAVE_ASINF : i32 = 1 ; pub const HAVE_ATAN : i32 = 1 ; pub const HAVE_ATANF : i32 = 1 ; pub const HAVE_ATAN2 : i32 = 1 ; pub const HAVE_ATAN2F : i32 = 1 ; pub const HAVE_CEIL : i32 = 1 ; pub const HAVE_CEILF : i32 = 1 ; pub const HAVE_COPYSIGN : i32 = 1 ; pub const HAVE_COPYSIGNF : i32 = 1 ; pub const HAVE_COS : i32 = 1 ; pub const HAVE_COSF : i32 = 1 ; pub const HAVE_FABS : i32 = 1 ; pub const HAVE_FABSF : i32 = 1 ; pub const HAVE_FLOOR : i32 = 1 ; pub const HAVE_FLOORF : i32 = 1 ; pub const HAVE_FMOD : i32 = 1 ; pub const HAVE_FMODF : i32 = 1 ; pub const HAVE_LOG : i32 = 1 ; pub const HAVE_LOGF : i32 = 1 ; pub const HAVE_LOG10 : i32 = 1 ; pub const HAVE_LOG10F : i32 = 1 ; pub const HAVE_POWF : i32 = 1 ; pub const HAVE_SCALBN : i32 = 1 ; pub const HAVE_SCALBNF : i32 = 1 ; pub const HAVE_SIN : i32 = 1 ; pub const HAVE_SINF : i32 = 1 ; pub const HAVE_SQRT : i32 = 1 ; pub const HAVE_SQRTF : i32 = 1 ; pub const HAVE_TAN : i32 = 1 ; pub const HAVE_TANF : i32 = 1 ; pub const HAVE_FSEEKO : i32 = 1 ; pub const HAVE_SETJMP : i32 = 1 ; pub const HAVE_NANOSLEEP : i32 = 1 ; pub const HAVE_SYSCTLBYNAME : i32 = 1 ; pub const HAVE_POLL : i32 = 1 ; pub const SDL_CPUINFO_DISABLED : i32 = 1 ; pub const SDL_HAPTIC_DISABLED : i32 = 1 ; pub const SDL_LOADSO_DISABLED : i32 = 1 ; pub const SDL_POWER_DISABLED : i32 = 1 ; pub const SDL_FILESYSTEM_DISABLED : i32 = 1 ; pub const SDL_AUDIO_DRIVER_SWITCH : i32 = 1 ; pub const SDL_JOYSTICK_SWITCH : i32 = 1 ; pub const SDL_THREAD_SWITCH : i32 = 1 ; pub const SDL_TIMER_SWITCH : i32 = 1 ; pub const SDL_VIDEO_DRIVER_SWITCH : i32 = 1 ; pub const SDL_VIDEO_RENDER_OGL_ES2 : i32 = 1 ; pub const SDL_VIDEO_OPENGL : i32 = 1 ; pub const SDL_VIDEO_OPENGL_ES2 : i32 = 1 ; pub const SDL_VIDEO_OPENGL_EGL : i32 = 1 ; pub const SDL_ASSEMBLY_ROUTINES : i32 = 1 ; pub const __NEWLIB_H__ : i32 = 1 ; pub const _NEWLIB_VERSION_H__ : i32 = 1 ; pub const _NEWLIB_VERSION : & 'static [ u8 ; 6usize ] = b"3.1.0\0" ; pub const __NEWLIB__ : i32 = 3 ; pub const __NEWLIB_MINOR__ : i32 = 1 ; pub const __NEWLIB_PATCHLEVEL__ : i32 = 0 ; pub const _WANT_IO_C99_FORMATS : i32 = 1 ; pub const _WANT_IO_LONG_LONG : i32 = 1 ; pub const _WANT_IO_POS_ARGS : i32 = 1 ; pub const _MB_CAPABLE : i32 = 1 ; pub const _MB_LEN_MAX : i32 = 8 ; pub const HAVE_INITFINI_ARRAY : i32 = 1 ; pub const _ATEXIT_DYNAMIC_ALLOC : i32 = 1 ; pub const _HAVE_LONG_DOUBLE : i32 = 1 ; pub const _HAVE_CC_INHIBIT_LOOP_TO_LIBCALL : i32 = 1 ; pub const _FVWRITE_IN_STREAMIO : i32 = 1 ; pub const _FSEEK_OPTIMIZATION : i32 = 1 ; pub const _UNBUF_STREAM_OPT : i32 = 1 ; pub const __OBSOLETE_MATH_DEFAULT : i32 = 1 ; pub const __OBSOLETE_MATH : i32 = 1 ; pub const _DEFAULT_SOURCE : i32 = 1 ; pub const _POSIX_SOURCE : i32 = 1 ; pub const _POSIX_C_SOURCE : i32 = 200809 ; pub const _ATFILE_SOURCE : i32 = 1 ; pub const __ATFILE_VISIBLE : i32 = 1 ; pub const __BSD_VISIBLE : i32 = 1 ; pub const __GNU_VISIBLE : i32 = 0 ; pub const __ISO_C_VISIBLE : i32 = 2011 ; pub const __LARGEFILE_VISIBLE : i32 = 0 ; pub const __MISC_VISIBLE : i32 = 1 ; pub const __POSIX_VISIBLE : i32 = 200809 ; pub const __SVID_VISIBLE : i32 = 1 ; pub const __XSI_VISIBLE : i32 = 0 ; pub const __SSP_FORTIFY_LEVEL : i32 = 0 ; pub const __RAND_MAX : u32 = 2147483647 ; pub const __have_longlong64 : i32 = 1 ; pub const __have_long64 : i32 = 1 ; pub const ___int8_t_defined : i32 = 1 ; pub const ___int16_t_defined : i32 = 1 ; pub const ___int32_t_defined : i32 = 1 ; pub const ___int64_t_defined : i32 = 1 ; pub const ___int_least8_t_defined : i32 = 1 ; pub const ___int_least16_t_defined : i32 = 1 ; pub const ___int_least32_t_defined : i32 = 1 ; pub const ___int_least64_t_defined : i32 = 1 ; pub const __GNUCLIKE_ASM : i32 = 3 ; pub const __GNUCLIKE___TYPEOF : i32 = 1 ; pub const __GNUCLIKE___OFFSETOF : i32 = 1 ; pub const __GNUCLIKE___SECTION : i32 = 1 ; pub const __GNUCLIKE_CTOR_SECTION_HANDLING : i32 = 1 ; pub const __GNUCLIKE_BUILTIN_CONSTANT_P : i32 = 1 ; pub const __GNUCLIKE_BUILTIN_VARARGS : i32 = 1 ; pub const __GNUCLIKE_BUILTIN_STDARG : i32 = 1 ; pub const __GNUCLIKE_BUILTIN_VAALIST : i32 = 1 ; pub const __GNUC_VA_LIST_COMPATIBILITY : i32 = 1 ; pub const __GNUCLIKE_BUILTIN_NEXT_ARG : i32 = 1 ; pub const __GNUCLIKE_BUILTIN_MEMCPY : i32 = 1 ; pub const __CC_SUPPORTS_INLINE : i32 = 1 ; pub const __CC_SUPPORTS___INLINE : i32 = 1 ; pub const __CC_SUPPORTS___INLINE__ : i32 = 1 ; pub const __CC_SUPPORTS___FUNC__ : i32 = 1 ; pub const __CC_SUPPORTS_WARNING : i32 = 1 ; pub const __CC_SUPPORTS_VARADIC_XXX : i32 = 1 ; pub const __CC_SUPPORTS_DYNAMIC_ARRAY_INIT : i32 = 1 ; pub const __BIT_TYPES_DEFINED__ : i32 = 1 ; pub const __int20 : i32 = 2 ; pub const __INT8 : & 'static [ u8 ; 3usize ] = b"hh\0" ; pub const __INT16 : & 'static [ u8 ; 2usize ] = b"h\0" ; pub const __INT64 : & 'static [ u8 ; 2usize ] = b"l\0" ; pub const __FAST8 : & 'static [ u8 ; 3usize ] = b"hh\0" ; pub const __FAST16 : & 'static [ u8 ; 2usize ] = b"h\0" ; pub const __FAST64 : & 'static [ u8 ; 2usize ] = b"l\0" ; pub const __LEAST8 : & 'static [ u8 ; 3usize ] = b"hh\0" ; pub const __LEAST16 : & 'static [ u8 ; 2usize ] = b"h\0" ; pub const __LEAST64 : & 'static [ u8 ; 2usize ] = b"l\0" ; pub const __int8_t_defined : i32 = 1 ; pub const __int16_t_defined : i32 = 1 ; pub const __int32_t_defined : i32 = 1 ; pub const __int64_t_defined : i32 = 1 ; pub const __int_least8_t_defined : i32 = 1 ; pub const __int_least16_t_defined : i32 = 1 ; pub const __int_least32_t_defined : i32 = 1 ; pub const __int_least64_t_defined : i32 = 1 ; pub const __int_fast8_t_defined : i32 = 1 ; pub const __int_fast16_t_defined : i32 = 1 ; pub const __int_fast32_t_defined : i32 = 1 ; pub const __int_fast64_t_defined : i32 = 1 ; pub const WINT_MIN : i32 = 0 ; pub const _LITTLE_ENDIAN : i32 = 1234 ; pub const _BIG_ENDIAN : i32 = 4321 ; pub const _PDP_ENDIAN : i32 = 3412 ; pub const _BYTE_ORDER : i32 = 1234 ; pub const _QUAD_HIGHWORD : i32 = 1 ; pub const _QUAD_LOWWORD : i32 = 0 ; pub const LITTLE_ENDIAN : i32 = 1234 ; pub const BIG_ENDIAN : i32 = 4321 ; pub const PDP_ENDIAN : i32 = 3412 ; pub const BYTE_ORDER : i32 = 1234 ; pub const FD_SETSIZE : i32 = 64 ; pub const SCHED_OTHER : i32 = 0 ; pub const SCHED_FIFO : i32 = 1 ; pub const SCHED_RR : i32 = 2 ; pub const PTHREAD_SCOPE_PROCESS : i32 = 0 ; pub const PTHREAD_SCOPE_SYSTEM : i32 = 1 ; pub const PTHREAD_INHERIT_SCHED : i32 = 1 ; pub const PTHREAD_EXPLICIT_SCHED : i32 = 2 ; pub const PTHREAD_CREATE_DETACHED : i32 = 0 ; pub const PTHREAD_CREATE_JOINABLE : i32 = 1 ; pub const _NULL : i32 = 0 ; pub const _ATEXIT_SIZE : i32 = 32 ; pub const _RAND48_SEED_0 : i32 = 13070 ; pub const _RAND48_SEED_1 : i32 = 43981 ; pub const _RAND48_SEED_2 : i32 = 4660 ; pub const _RAND48_MULT_0 : i32 = 58989 ; pub const _RAND48_MULT_1 : i32 = 57068 ; pub const _RAND48_MULT_2 : i32 = 5 ; pub const _RAND48_ADD : i32 = 11 ; pub const _REENT_EMERGENCY_SIZE : i32 = 25 ; pub const _REENT_ASCTIME_SIZE : i32 = 26 ; pub const _REENT_SIGNAL_SIZE : i32 = 24 ; pub const _N_LISTS : i32 = 30 ; pub const __SLBF : i32 = 1 ; pub const __SNBF : i32 = 2 ; pub const __SRD : i32 = 4 ; pub const __SWR : i32 = 8 ; pub const __SRW : i32 = 16 ; pub const __SEOF : i32 = 32 ; pub const __SERR : i32 = 64 ; pub const __SMBF : i32 = 128 ; pub const __SAPP : i32 = 256 ; pub const __SSTR : i32 = 512 ; pub const __SOPT : i32 = 1024 ; pub const __SNPT : i32 = 2048 ; pub const __SOFF : i32 = 4096 ; pub const __SORD : i32 = 8192 ; pub const __SL64 : i32 = 32768 ; pub const __SNLK : i32 = 1 ; pub const __SWID : i32 = 8192 ; pub const _IOFBF : i32 = 0 ; pub const _IOLBF : i32 = 1 ; pub const _IONBF : i32 = 2 ; pub const EOF : i32 = -1 ; pub const BUFSIZ : i32 = 1024 ; pub const FOPEN_MAX : i32 = 20 ; pub const FILENAME_MAX : i32 = 1024 ; pub const L_tmpnam : i32 = 1024 ; pub const P_tmpdir : & 'static [ u8 ; 5usize ] = b"/tmp\0" ; pub const SEEK_SET : i32 = 0 ; pub const SEEK_CUR : i32 = 1 ; pub const SEEK_END : i32 = 2 ; pub const TMP_MAX : i32 = 26 ; pub const L_ctermid : i32 = 16 ; pub const EXIT_FAILURE : i32 = 1 ; pub const EXIT_SUCCESS : i32 = 0 ; pub const RAND_MAX : u32 = 2147483647 ; pub const _U : i32 = 1 ; pub const _L : i32 = 2 ; pub const _N : i32 = 4 ; pub const _S : i32 = 8 ; pub const _P : i32 = 16 ; pub const _C : i32 = 32 ; pub const _X : i32 = 64 ; pub const _B : i32 = 128 ; pub const _M_LN2 : f64 = 0.6931471805599453 ; pub const FP_NAN : i32 = 0 ; pub const FP_INFINITE : i32 = 1 ; pub const FP_ZERO : i32 = 2 ; pub const FP_SUBNORMAL : i32 = 3 ; pub const FP_NORMAL : i32 = 4 ; pub const MATH_ERRNO : i32 = 1 ; pub const MATH_ERREXCEPT : i32 = 2 ; pub const math_errhandling : i32 = 1 ; pub const DOMAIN : i32 = 1 ; pub const SING : i32 = 2 ; pub const OVERFLOW : i32 = 3 ; pub const UNDERFLOW : i32 = 4 ; pub const TLOSS : i32 = 5 ; pub const PLOSS : i32 = 6 ; pub const M_E : f64 = 2.718281828459045 ; pub const M_LOG2E : f64 = 1.4426950408889634 ; pub const M_LOG10E : f64 = 0.4342944819032518 ; pub const M_LN2 : f64 = 0.6931471805599453 ; pub const M_LN10 : f64 = 2.302585092994046 ; pub const M_PI : f64 = 3.141592653589793 ; pub const M_PI_2 : f64 = 1.5707963267948966 ; pub const M_PI_4 : f64 = 0.7853981633974483 ; pub const M_1_PI : f64 = 0.3183098861837907 ; pub const M_2_PI : f64 = 0.6366197723675814 ; pub const M_2_SQRTPI : f64 = 1.1283791670955126 ; pub const M_SQRT2 : f64 = 1.4142135623730951 ; pub const M_SQRT1_2 : f64 = 0.7071067811865476 ; pub const M_TWOPI : f64 = 6.283185307179586 ; pub const M_SQRTPI : f64 = 1.772453850905516 ; pub const M_SQRT3 : f64 = 1.7320508075688772 ; pub const M_IVLN10 : f64 = 0.4342944819032518 ; pub const M_LOG2_E : f64 = 0.6931471805599453 ; pub const FLT_ROUNDS : i32 = 1 ; pub const SDL_PRIs64 : & 'static [ u8 ; 3usize ] = b"ld\0" ; pub const SDL_ASSERT_LEVEL : i32 = 2 ; pub const SDL_NULL_WHILE_LOOP_CONDITION : i32 = 0 ; pub const SDL_LIL_ENDIAN : i32 = 1234 ; pub const SDL_BIG_ENDIAN : i32 = 4321 ; pub const SDL_BYTEORDER : i32 = 1234 ; pub const SDL_MUTEX_TIMEDOUT : i32 = 1 ; pub const SDL_RWOPS_UNKNOWN : i32 = 0 ; pub const SDL_RWOPS_WINFILE : i32 = 1 ; pub const SDL_RWOPS_STDFILE : i32 = 2 ; pub const SDL_RWOPS_JNIFILE : i32 = 3 ; pub const SDL_RWOPS_MEMORY : i32 = 4 ; pub const SDL_RWOPS_MEMORY_RO : i32 = 5 ; pub const RW_SEEK_SET : i32 = 0 ; pub const RW_SEEK_CUR : i32 = 1 ; pub const RW_SEEK_END : i32 = 2 ; pub const SDL_AUDIO_MASK_BITSIZE : i32 = 255 ; pub const SDL_AUDIO_MASK_DATATYPE : i32 = 256 ; pub const SDL_AUDIO_MASK_ENDIAN : i32 = 4096 ; pub const SDL_AUDIO_MASK_SIGNED : i32 = 32768 ; pub const AUDIO_U8 : i32 = 8 ; pub const AUDIO_S8 : i32 = 32776 ; pub const AUDIO_U16LSB : i32 = 16 ; pub const AUDIO_S16LSB : i32 = 32784 ; pub const AUDIO_U16MSB : i32 = 4112 ; pub const AUDIO_S16MSB : i32 = 36880 ; pub const AUDIO_U16 : i32 = 16 ; pub const AUDIO_S16 : i32 = 32784 ; pub const AUDIO_S32LSB : i32 = 32800 ; pub const AUDIO_S32MSB : i32 = 36896 ; pub const AUDIO_S32 : i32 = 32800 ; pub const AUDIO_F32LSB : i32 = 33056 ; pub const AUDIO_F32MSB : i32 = 37152 ; pub const AUDIO_F32 : i32 = 33056 ; pub const AUDIO_U16SYS : i32 = 16 ; pub const AUDIO_S16SYS : i32 = 32784 ; pub const AUDIO_S32SYS : i32 = 32800 ; pub const AUDIO_F32SYS : i32 = 33056 ; pub const SDL_AUDIO_ALLOW_FREQUENCY_CHANGE : i32 = 1 ; pub const SDL_AUDIO_ALLOW_FORMAT_CHANGE : i32 = 2 ; pub const SDL_AUDIO_ALLOW_CHANNELS_CHANGE : i32 = 4 ; pub const SDL_AUDIO_ALLOW_ANY_CHANGE : i32 = 7 ; pub const SDL_AUDIOCVT_MAX_FILTERS : i32 = 9 ; pub const SDL_MIX_MAXVOLUME : i32 = 128 ; pub const _MM_HINT_T0 : i32 = 3 ; pub const _MM_HINT_T1 : i32 = 2 ; pub const _MM_HINT_T2 : i32 = 1 ; pub const _MM_HINT_NTA : i32 = 0 ; pub const _MM_EXCEPT_INVALID : i32 = 1 ; pub const _MM_EXCEPT_DENORM : i32 = 2 ; pub const _MM_EXCEPT_DIV_ZERO : i32 = 4 ; pub const _MM_EXCEPT_OVERFLOW : i32 = 8 ; pub const _MM_EXCEPT_UNDERFLOW : i32 = 16 ; pub const _MM_EXCEPT_INEXACT : i32 = 32 ; pub const _MM_EXCEPT_MASK : i32 = 63 ; pub const _MM_MASK_INVALID : i32 = 128 ; pub const _MM_MASK_DENORM : i32 = 256 ; pub const _MM_MASK_DIV_ZERO : i32 = 512 ; pub const _MM_MASK_OVERFLOW : i32 = 1024 ; pub const _MM_MASK_UNDERFLOW : i32 = 2048 ; pub const _MM_MASK_INEXACT : i32 = 4096 ; pub const _MM_MASK_MASK : i32 = 8064 ; pub const _MM_ROUND_NEAREST : i32 = 0 ; pub const _MM_ROUND_DOWN : i32 = 8192 ; pub const _MM_ROUND_UP : i32 = 16384 ; pub const _MM_ROUND_TOWARD_ZERO : i32 = 24576 ; pub const _MM_ROUND_MASK : i32 = 24576 ; pub const _MM_FLUSH_ZERO_MASK : i32 = 32768 ; pub const _MM_FLUSH_ZERO_ON : i32 = 32768 ; pub const _MM_FLUSH_ZERO_OFF : i32 = 0 ; pub const _MM_DENORMALS_ZERO_ON : i32 = 64 ; pub const _MM_DENORMALS_ZERO_OFF : i32 = 0 ; pub const _MM_DENORMALS_ZERO_MASK : i32 = 64 ; pub const SDL_CACHELINE_SIZE : i32 = 128 ; pub const SDL_ALPHA_OPAQUE : i32 = 255 ; pub const SDL_ALPHA_TRANSPARENT : i32 = 0 ; pub const SDL_SWSURFACE : i32 = 0 ; pub const SDL_PREALLOC : i32 = 1 ; pub const SDL_RLEACCEL : i32 = 2 ; pub const SDL_DONTFREE : i32 = 4 ; pub const SDL_WINDOWPOS_UNDEFINED_MASK : i32 = 536805376 ; pub const SDL_WINDOWPOS_CENTERED_MASK : i32 = 805240832 ; pub const SDLK_SCANCODE_MASK : i32 = 1073741824 ; pub const SDL_BUTTON_LEFT : i32 = 1 ; pub const SDL_BUTTON_MIDDLE : i32 = 2 ; pub const SDL_BUTTON_RIGHT : i32 = 3 ; pub const SDL_BUTTON_X1 : i32 = 4 ; pub const SDL_BUTTON_X2 : i32 = 5 ; pub const SDL_JOYSTICK_AXIS_MAX : i32 = 32767 ; pub const SDL_JOYSTICK_AXIS_MIN : i32 = -32768 ; pub const SDL_HAT_CENTERED : i32 = 0 ; pub const SDL_HAT_UP : i32 = 1 ; pub const SDL_HAT_RIGHT : i32 = 2 ; pub const SDL_HAT_DOWN : i32 = 4 ; pub const SDL_HAT_LEFT : i32 = 8 ; pub const SDL_HAT_RIGHTUP : i32 = 3 ; pub const SDL_HAT_RIGHTDOWN : i32 = 6 ; pub const SDL_HAT_LEFTUP : i32 = 9 ; pub const SDL_HAT_LEFTDOWN : i32 = 12 ; pub const SDL_RELEASED : i32 = 0 ; pub const SDL_PRESSED : i32 = 1 ; pub const SDL_TEXTEDITINGEVENT_TEXT_SIZE : i32 = 32 ; pub const SDL_TEXTINPUTEVENT_TEXT_SIZE : i32 = 32 ; pub const SDL_QUERY : i32 = -1 ; pub const SDL_IGNORE : i32 = 0 ; pub const SDL_DISABLE : i32 = 0 ; pub const SDL_ENABLE : i32 = 1 ; pub const SDL_HAPTIC_CONSTANT : i32 = 1 ; pub const SDL_HAPTIC_SINE : i32 = 2 ; pub const SDL_HAPTIC_LEFTRIGHT : i32 = 4 ; pub const SDL_HAPTIC_TRIANGLE : i32 = 8 ; pub const SDL_HAPTIC_SAWTOOTHUP : i32 = 16 ; pub const SDL_HAPTIC_SAWTOOTHDOWN : i32 = 32 ; pub const SDL_HAPTIC_RAMP : i32 = 64 ; pub const SDL_HAPTIC_SPRING : i32 = 128 ; pub const SDL_HAPTIC_DAMPER : i32 = 256 ; pub const SDL_HAPTIC_INERTIA : i32 = 512 ; pub const SDL_HAPTIC_FRICTION : i32 = 1024 ; pub const SDL_HAPTIC_CUSTOM : i32 = 2048 ; pub const SDL_HAPTIC_GAIN : i32 = 4096 ; pub const SDL_HAPTIC_AUTOCENTER : i32 = 8192 ; pub const SDL_HAPTIC_STATUS : i32 = 16384 ; pub const SDL_HAPTIC_PAUSE : i32 = 32768 ; pub const SDL_HAPTIC_POLAR : i32 = 0 ; pub const SDL_HAPTIC_CARTESIAN : i32 = 1 ; pub const SDL_HAPTIC_SPHERICAL : i32 = 2 ; pub const SDL_HAPTIC_INFINITY : u32 = 4294967295 ; pub const SDL_HINT_FRAMEBUFFER_ACCELERATION : & 'static [ u8 ; 29usize ] = b"SDL_FRAMEBUFFER_ACCELERATION\0" ; pub const SDL_HINT_RENDER_DRIVER : & 'static [ u8 ; 18usize ] = b"SDL_RENDER_DRIVER\0" ; pub const SDL_HINT_RENDER_OPENGL_SHADERS : & 'static [ u8 ; 26usize ] = b"SDL_RENDER_OPENGL_SHADERS\0" ; pub const SDL_HINT_RENDER_DIRECT3D_THREADSAFE : & 'static [ u8 ; 31usize ] = b"SDL_RENDER_DIRECT3D_THREADSAFE\0" ; pub const SDL_HINT_RENDER_DIRECT3D11_DEBUG : & 'static [ u8 ; 28usize ] = b"SDL_RENDER_DIRECT3D11_DEBUG\0" ; pub const SDL_HINT_RENDER_LOGICAL_SIZE_MODE : & 'static [ u8 ; 29usize ] = b"SDL_RENDER_LOGICAL_SIZE_MODE\0" ; pub const SDL_HINT_RENDER_SCALE_QUALITY : & 'static [ u8 ; 25usize ] = b"SDL_RENDER_SCALE_QUALITY\0" ; pub const SDL_HINT_RENDER_VSYNC : & 'static [ u8 ; 17usize ] = b"SDL_RENDER_VSYNC\0" ; pub const SDL_HINT_VIDEO_ALLOW_SCREENSAVER : & 'static [ u8 ; 28usize ] = b"SDL_VIDEO_ALLOW_SCREENSAVER\0" ; pub const SDL_HINT_VIDEO_X11_XVIDMODE : & 'static [ u8 ; 23usize ] = b"SDL_VIDEO_X11_XVIDMODE\0" ; pub const SDL_HINT_VIDEO_X11_XINERAMA : & 'static [ u8 ; 23usize ] = b"SDL_VIDEO_X11_XINERAMA\0" ; pub const SDL_HINT_VIDEO_X11_XRANDR : & 'static [ u8 ; 21usize ] = b"SDL_VIDEO_X11_XRANDR\0" ; pub const SDL_HINT_VIDEO_X11_NET_WM_PING : & 'static [ u8 ; 26usize ] = b"SDL_VIDEO_X11_NET_WM_PING\0" ; pub const SDL_HINT_VIDEO_X11_NET_WM_BYPASS_COMPOSITOR : & 'static [ u8 ; 39usize ] = b"SDL_VIDEO_X11_NET_WM_BYPASS_COMPOSITOR\0" ; pub const SDL_HINT_WINDOW_FRAME_USABLE_WHILE_CURSOR_HIDDEN : & 'static [ u8 ; 44usize ] = b"SDL_WINDOW_FRAME_USABLE_WHILE_CURSOR_HIDDEN\0" ; pub const SDL_HINT_WINDOWS_INTRESOURCE_ICON : & 'static [ u8 ; 29usize ] = b"SDL_WINDOWS_INTRESOURCE_ICON\0" ; pub const SDL_HINT_WINDOWS_INTRESOURCE_ICON_SMALL : & 'static [ u8 ; 35usize ] = b"SDL_WINDOWS_INTRESOURCE_ICON_SMALL\0" ; pub const SDL_HINT_WINDOWS_ENABLE_MESSAGELOOP : & 'static [ u8 ; 31usize ] = b"SDL_WINDOWS_ENABLE_MESSAGELOOP\0" ; pub const SDL_HINT_GRAB_KEYBOARD : & 'static [ u8 ; 18usize ] = b"SDL_GRAB_KEYBOARD\0" ; pub const SDL_HINT_MOUSE_NORMAL_SPEED_SCALE : & 'static [ u8 ; 29usize ] = b"SDL_MOUSE_NORMAL_SPEED_SCALE\0" ; pub const SDL_HINT_MOUSE_RELATIVE_SPEED_SCALE : & 'static [ u8 ; 31usize ] = b"SDL_MOUSE_RELATIVE_SPEED_SCALE\0" ; pub const SDL_HINT_MOUSE_RELATIVE_MODE_WARP : & 'static [ u8 ; 29usize ] = b"SDL_MOUSE_RELATIVE_MODE_WARP\0" ; pub const SDL_HINT_MOUSE_FOCUS_CLICKTHROUGH : & 'static [ u8 ; 29usize ] = b"SDL_MOUSE_FOCUS_CLICKTHROUGH\0" ; pub const SDL_HINT_TOUCH_MOUSE_EVENTS : & 'static [ u8 ; 23usize ] = b"SDL_TOUCH_MOUSE_EVENTS\0" ; pub const SDL_HINT_VIDEO_MINIMIZE_ON_FOCUS_LOSS : & 'static [ u8 ; 33usize ] = b"SDL_VIDEO_MINIMIZE_ON_FOCUS_LOSS\0" ; pub const SDL_HINT_IDLE_TIMER_DISABLED : & 'static [ u8 ; 28usize ] = b"SDL_IOS_IDLE_TIMER_DISABLED\0" ; pub const SDL_HINT_ORIENTATIONS : & 'static [ u8 ; 21usize ] = b"SDL_IOS_ORIENTATIONS\0" ; pub const SDL_HINT_APPLE_TV_CONTROLLER_UI_EVENTS : & 'static [ u8 ; 34usize ] = b"SDL_APPLE_TV_CONTROLLER_UI_EVENTS\0" ; pub const SDL_HINT_APPLE_TV_REMOTE_ALLOW_ROTATION : & 'static [ u8 ; 35usize ] = b"SDL_APPLE_TV_REMOTE_ALLOW_ROTATION\0" ; pub const SDL_HINT_IOS_HIDE_HOME_INDICATOR : & 'static [ u8 ; 28usize ] = b"SDL_IOS_HIDE_HOME_INDICATOR\0" ; pub const SDL_HINT_ACCELEROMETER_AS_JOYSTICK : & 'static [ u8 ; 30usize ] = b"SDL_ACCELEROMETER_AS_JOYSTICK\0" ; pub const SDL_HINT_TV_REMOTE_AS_JOYSTICK : & 'static [ u8 ; 26usize ] = b"SDL_TV_REMOTE_AS_JOYSTICK\0" ; pub const SDL_HINT_XINPUT_ENABLED : & 'static [ u8 ; 19usize ] = b"SDL_XINPUT_ENABLED\0" ; pub const SDL_HINT_XINPUT_USE_OLD_JOYSTICK_MAPPING : & 'static [ u8 ; 36usize ] = b"SDL_XINPUT_USE_OLD_JOYSTICK_MAPPING\0" ; pub const SDL_HINT_GAMECONTROLLERCONFIG : & 'static [ u8 ; 25usize ] = b"SDL_GAMECONTROLLERCONFIG\0" ; pub const SDL_HINT_GAMECONTROLLER_IGNORE_DEVICES : & 'static [ u8 ; 34usize ] = b"SDL_GAMECONTROLLER_IGNORE_DEVICES\0" ; pub const SDL_HINT_GAMECONTROLLER_IGNORE_DEVICES_EXCEPT : & 'static [ u8 ; 41usize ] = b"SDL_GAMECONTROLLER_IGNORE_DEVICES_EXCEPT\0" ; pub const SDL_HINT_JOYSTICK_ALLOW_BACKGROUND_EVENTS : & 'static [ u8 ; 37usize ] = b"SDL_JOYSTICK_ALLOW_BACKGROUND_EVENTS\0" ; pub const SDL_HINT_ALLOW_TOPMOST : & 'static [ u8 ; 18usize ] = b"SDL_ALLOW_TOPMOST\0" ; pub const SDL_HINT_TIMER_RESOLUTION : & 'static [ u8 ; 21usize ] = b"SDL_TIMER_RESOLUTION\0" ; pub const SDL_HINT_QTWAYLAND_CONTENT_ORIENTATION : & 'static [ u8 ; 34usize ] = b"SDL_QTWAYLAND_CONTENT_ORIENTATION\0" ; pub const SDL_HINT_QTWAYLAND_WINDOW_FLAGS : & 'static [ u8 ; 27usize ] = b"SDL_QTWAYLAND_WINDOW_FLAGS\0" ; pub const SDL_HINT_THREAD_STACK_SIZE : & 'static [ u8 ; 22usize ] = b"SDL_THREAD_STACK_SIZE\0" ; pub const SDL_HINT_VIDEO_HIGHDPI_DISABLED : & 'static [ u8 ; 27usize ] = b"SDL_VIDEO_HIGHDPI_DISABLED\0" ; pub const SDL_HINT_MAC_CTRL_CLICK_EMULATE_RIGHT_CLICK : & 'static [ u8 ; 39usize ] = b"SDL_MAC_CTRL_CLICK_EMULATE_RIGHT_CLICK\0" ; pub const SDL_HINT_VIDEO_WIN_D3DCOMPILER : & 'static [ u8 ; 26usize ] = b"SDL_VIDEO_WIN_D3DCOMPILER\0" ; pub const SDL_HINT_VIDEO_WINDOW_SHARE_PIXEL_FORMAT : & 'static [ u8 ; 36usize ] = b"SDL_VIDEO_WINDOW_SHARE_PIXEL_FORMAT\0" ; pub const SDL_HINT_WINRT_PRIVACY_POLICY_URL : & 'static [ u8 ; 29usize ] = b"SDL_WINRT_PRIVACY_POLICY_URL\0" ; pub const SDL_HINT_WINRT_PRIVACY_POLICY_LABEL : & 'static [ u8 ; 31usize ] = b"SDL_WINRT_PRIVACY_POLICY_LABEL\0" ; pub const SDL_HINT_WINRT_HANDLE_BACK_BUTTON : & 'static [ u8 ; 29usize ] = b"SDL_WINRT_HANDLE_BACK_BUTTON\0" ; pub const SDL_HINT_VIDEO_MAC_FULLSCREEN_SPACES : & 'static [ u8 ; 32usize ] = b"SDL_VIDEO_MAC_FULLSCREEN_SPACES\0" ; pub const SDL_HINT_MAC_BACKGROUND_APP : & 'static [ u8 ; 23usize ] = b"SDL_MAC_BACKGROUND_APP\0" ; pub const SDL_HINT_ANDROID_APK_EXPANSION_MAIN_FILE_VERSION : & 'static [ u8 ; 44usize ] = b"SDL_ANDROID_APK_EXPANSION_MAIN_FILE_VERSION\0" ; pub const SDL_HINT_ANDROID_APK_EXPANSION_PATCH_FILE_VERSION : & 'static [ u8 ; 45usize ] = b"SDL_ANDROID_APK_EXPANSION_PATCH_FILE_VERSION\0" ; pub const SDL_HINT_IME_INTERNAL_EDITING : & 'static [ u8 ; 25usize ] = b"SDL_IME_INTERNAL_EDITING\0" ; pub const SDL_HINT_ANDROID_SEPARATE_MOUSE_AND_TOUCH : & 'static [ u8 ; 37usize ] = b"SDL_ANDROID_SEPARATE_MOUSE_AND_TOUCH\0" ; pub const SDL_HINT_RETURN_KEY_HIDES_IME : & 'static [ u8 ; 25usize ] = b"SDL_RETURN_KEY_HIDES_IME\0" ; pub const SDL_HINT_EMSCRIPTEN_KEYBOARD_ELEMENT : & 'static [ u8 ; 32usize ] = b"SDL_EMSCRIPTEN_KEYBOARD_ELEMENT\0" ; pub const SDL_HINT_NO_SIGNAL_HANDLERS : & 'static [ u8 ; 23usize ] = b"SDL_NO_SIGNAL_HANDLERS\0" ; pub const SDL_HINT_WINDOWS_NO_CLOSE_ON_ALT_F4 : & 'static [ u8 ; 31usize ] = b"SDL_WINDOWS_NO_CLOSE_ON_ALT_F4\0" ; pub const SDL_HINT_BMP_SAVE_LEGACY_FORMAT : & 'static [ u8 ; 27usize ] = b"SDL_BMP_SAVE_LEGACY_FORMAT\0" ; pub const SDL_HINT_WINDOWS_DISABLE_THREAD_NAMING : & 'static [ u8 ; 34usize ] = b"SDL_WINDOWS_DISABLE_THREAD_NAMING\0" ; pub const SDL_HINT_RPI_VIDEO_LAYER : & 'static [ u8 ; 20usize ] = b"SDL_RPI_VIDEO_LAYER\0" ; pub const SDL_HINT_VIDEO_DOUBLE_BUFFER : & 'static [ u8 ; 24usize ] = b"SDL_VIDEO_DOUBLE_BUFFER\0" ; pub const SDL_HINT_OPENGL_ES_DRIVER : & 'static [ u8 ; 21usize ] = b"SDL_OPENGL_ES_DRIVER\0" ; pub const SDL_HINT_AUDIO_RESAMPLING_MODE : & 'static [ u8 ; 26usize ] = b"SDL_AUDIO_RESAMPLING_MODE\0" ; pub const SDL_HINT_AUDIO_CATEGORY : & 'static [ u8 ; 19usize ] = b"SDL_AUDIO_CATEGORY\0" ; pub const SDL_MAX_LOG_MESSAGE : i32 = 4096 ; pub const SDL_NONSHAPEABLE_WINDOW : i32 = -1 ; pub const SDL_INVALID_SHAPE_ARGUMENT : i32 = -2 ; pub const SDL_WINDOW_LACKS_SHAPE : i32 = -3 ; pub const SDL_MAJOR_VERSION : i32 = 2 ; pub const SDL_MINOR_VERSION : i32 = 0 ; pub const SDL_PATCHLEVEL : i32 = 8 ; pub const SDL_INIT_TIMER : i32 = 1 ; pub const SDL_INIT_AUDIO : i32 = 16 ; pub const SDL_INIT_VIDEO : i32 = 32 ; pub const SDL_INIT_JOYSTICK : i32 = 512 ; pub const SDL_INIT_HAPTIC : i32 = 4096 ; pub const SDL_INIT_GAMECONTROLLER : i32 = 8192 ; pub const SDL_INIT_EVENTS : i32 = 16384 ; pub const SDL_INIT_NOPARACHUTE : i32 = 1048576 ; pub const SDL_INIT_EVERYTHING : i32 = 29233 ; extern "C" { 
 /// \brief Gets the name of the platform. 
 pub fn SDL_GetPlatform ( ) -> * const ctypes :: c_char ; } pub type __int8_t = ctypes :: c_schar ; pub type __uint8_t = ctypes :: c_uchar ; pub type __int16_t = ctypes :: c_short ; pub type __uint16_t = ctypes :: c_ushort ; pub type __int32_t = ctypes :: c_int ; pub type __uint32_t = ctypes :: c_uint ; pub type __int64_t = ctypes :: c_long ; pub type __uint64_t = ctypes :: c_ulong ; pub type __int_least8_t = ctypes :: c_schar ; pub type __uint_least8_t = ctypes :: c_uchar ; pub type __int_least16_t = ctypes :: c_short ; pub type __uint_least16_t = ctypes :: c_ushort ; pub type __int_least32_t = ctypes :: c_int ; pub type __uint_least32_t = ctypes :: c_uint ; pub type __int_least64_t = ctypes :: c_long ; pub type __uint_least64_t = ctypes :: c_ulong ; pub type __intmax_t = ctypes :: c_long ; pub type __uintmax_t = ctypes :: c_ulong ; pub type __intptr_t = ctypes :: c_long ; pub type __uintptr_t = ctypes :: c_ulong ; pub type wchar_t = ctypes :: c_int ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct max_align_t { pub __max_align_ll : ctypes :: c_longlong , pub __bindgen_padding_0 : u64 , pub __max_align_ld : f64 , } # [ test ] fn bindgen_test_layout_max_align_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < max_align_t > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( max_align_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < max_align_t > ( ) , 16usize , concat ! ( "Alignment of " , stringify ! ( max_align_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < max_align_t > ( ) ) ) . __max_align_ll as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( max_align_t ) , "::" , stringify ! ( __max_align_ll ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < max_align_t > ( ) ) ) . __max_align_ld as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( max_align_t ) , "::" , stringify ! ( __max_align_ld ) ) ) ; } pub type _ssize_t = ctypes :: c_long ; pub type u_int8_t = __uint8_t ; pub type u_int16_t = __uint16_t ; pub type u_int32_t = __uint32_t ; pub type u_int64_t = __uint64_t ; pub type register_t = ctypes :: c_int ; pub type intmax_t = __intmax_t ; pub type uintmax_t = __uintmax_t ; pub type int_least8_t = __int_least8_t ; pub type uint_least8_t = __uint_least8_t ; pub type int_least16_t = __int_least16_t ; pub type uint_least16_t = __uint_least16_t ; pub type int_least32_t = __int_least32_t ; pub type uint_least32_t = __uint_least32_t ; pub type int_least64_t = __int_least64_t ; pub type uint_least64_t = __uint_least64_t ; pub type int_fast8_t = ctypes :: c_schar ; pub type uint_fast8_t = ctypes :: c_uchar ; pub type int_fast16_t = ctypes :: c_short ; pub type uint_fast16_t = ctypes :: c_ushort ; pub type int_fast32_t = ctypes :: c_int ; pub type uint_fast32_t = ctypes :: c_uint ; pub type int_fast64_t = ctypes :: c_long ; pub type uint_fast64_t = ctypes :: c_ulong ; pub type _LOCK_T = i32 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __lock_t { pub lock : _LOCK_T , pub thread_tag : u32 , pub counter : u32 , } # [ test ] fn bindgen_test_layout___lock_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < __lock_t > ( ) , 12usize , concat ! ( "Size of: " , stringify ! ( __lock_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < __lock_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __lock_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __lock_t > ( ) ) ) . lock as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( __lock_t ) , "::" , stringify ! ( lock ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __lock_t > ( ) ) ) . thread_tag as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( __lock_t ) , "::" , stringify ! ( thread_tag ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __lock_t > ( ) ) ) . counter as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( __lock_t ) , "::" , stringify ! ( counter ) ) ) ; } pub type _LOCK_RECURSIVE_T = __lock_t ; pub type _COND_T = u32 ; extern "C" { pub fn __libc_lock_init ( lock : * mut _LOCK_T ) ; } extern "C" { pub fn __libc_lock_init_recursive ( lock : * mut _LOCK_RECURSIVE_T ) ; } extern "C" { pub fn __libc_lock_close ( lock : * mut _LOCK_T ) ; } extern "C" { pub fn __libc_lock_close_recursive ( lock : * mut _LOCK_RECURSIVE_T ) ; } extern "C" { pub fn __libc_lock_acquire ( lock : * mut _LOCK_T ) ; } extern "C" { pub fn __libc_lock_acquire_recursive ( lock : * mut _LOCK_RECURSIVE_T ) ; } extern "C" { pub fn __libc_lock_release ( lock : * mut _LOCK_T ) ; } extern "C" { pub fn __libc_lock_release_recursive ( lock : * mut _LOCK_RECURSIVE_T ) ; } extern "C" { pub fn __libc_lock_try_acquire ( lock : * mut _LOCK_T ) -> ctypes :: c_int ; } extern "C" { pub fn __libc_lock_try_acquire_recursive ( lock : * mut _LOCK_RECURSIVE_T ) -> ctypes :: c_int ; } extern "C" { pub fn __libc_cond_init ( cond : * mut _COND_T ) -> ctypes :: c_int ; } extern "C" { pub fn __libc_cond_signal ( cond : * mut _COND_T ) -> ctypes :: c_int ; } extern "C" { pub fn __libc_cond_broadcast ( cond : * mut _COND_T ) -> ctypes :: c_int ; } extern "C" { pub fn __libc_cond_wait ( cond : * mut _COND_T , lock : * mut _LOCK_T , timeout_ns : u64 ) -> ctypes :: c_int ; } extern "C" { pub fn __libc_cond_wait_recursive ( cond : * mut _COND_T , lock : * mut _LOCK_RECURSIVE_T , timeout_ns : u64 ) -> ctypes :: c_int ; } pub type __blkcnt_t = ctypes :: c_long ; pub type __blksize_t = ctypes :: c_long ; pub type __fsblkcnt_t = __uint64_t ; pub type __fsfilcnt_t = __uint32_t ; pub type _off_t = ctypes :: c_long ; pub type __pid_t = ctypes :: c_int ; pub type __dev_t = ctypes :: c_short ; pub type __uid_t = ctypes :: c_ushort ; pub type __gid_t = ctypes :: c_ushort ; pub type __id_t = __uint32_t ; pub type __ino_t = ctypes :: c_ushort ; pub type __mode_t = __uint32_t ; pub type _off64_t = ctypes :: c_longlong ; pub type __off_t = _off_t ; pub type __loff_t = _off64_t ; pub type __key_t = ctypes :: c_long ; pub type _fpos_t = ctypes :: c_long ; pub type __size_t = ctypes :: c_ulong ; pub type __ssize_t = _ssize_t ; pub type wint_t = ctypes :: c_uint ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _mbstate_t { pub __count : ctypes :: c_int , pub __value : _mbstate_t__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union _mbstate_t__bindgen_ty_1 { pub __wch : wint_t , pub __wchb : [ ctypes :: c_uchar ; 4usize ] , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout__mbstate_t__bindgen_ty_1 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _mbstate_t__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( _mbstate_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _mbstate_t__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( _mbstate_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _mbstate_t__bindgen_ty_1 > ( ) ) ) . __wch as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wch ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _mbstate_t__bindgen_ty_1 > ( ) ) ) . __wchb as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wchb ) ) ) ; } # [ test ] fn bindgen_test_layout__mbstate_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _mbstate_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( _mbstate_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _mbstate_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( _mbstate_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _mbstate_t > ( ) ) ) . __count as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _mbstate_t ) , "::" , stringify ! ( __count ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _mbstate_t > ( ) ) ) . __value as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( _mbstate_t ) , "::" , stringify ! ( __value ) ) ) ; } pub type _flock_t = _LOCK_RECURSIVE_T ; pub type _iconv_t = * mut ctypes :: c_void ; pub type __clock_t = ctypes :: c_ulong ; pub type __time_t = ctypes :: c_long ; pub type __clockid_t = ctypes :: c_ulong ; pub type __timer_t = ctypes :: c_ulong ; pub type __sa_family_t = __uint8_t ; pub type __socklen_t = __uint32_t ; pub type __nl_item = ctypes :: c_int ; pub type __nlink_t = ctypes :: c_ushort ; pub type __suseconds_t = ctypes :: c_long ; pub type __useconds_t = ctypes :: c_ulong ; pub type __va_list = __builtin_va_list ; pub type __sigset_t = ctypes :: c_ulong ; pub type suseconds_t = __suseconds_t ; pub type time_t = ctypes :: c_long ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct timeval { pub tv_sec : time_t , pub tv_usec : suseconds_t , } # [ test ] fn bindgen_test_layout_timeval ( ) { assert_eq ! ( :: core :: mem :: size_of :: < timeval > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( timeval ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < timeval > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( timeval ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < timeval > ( ) ) ) . tv_sec as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( timeval ) , "::" , stringify ! ( tv_sec ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < timeval > ( ) ) ) . tv_usec as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( timeval ) , "::" , stringify ! ( tv_usec ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct timespec { pub tv_sec : time_t , pub tv_nsec : ctypes :: c_long , } # [ test ] fn bindgen_test_layout_timespec ( ) { assert_eq ! ( :: core :: mem :: size_of :: < timespec > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( timespec ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < timespec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( timespec ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < timespec > ( ) ) ) . tv_sec as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( timespec ) , "::" , stringify ! ( tv_sec ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < timespec > ( ) ) ) . tv_nsec as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( timespec ) , "::" , stringify ! ( tv_nsec ) ) ) ; } extern "C" { pub fn timespec2nsec ( ts : * const timespec ) -> __uint64_t ; } extern "C" { pub fn abstimespec2nsec ( clock_id : __clockid_t , ts : * const timespec ) -> __uint64_t ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct itimerspec { pub it_interval : timespec , pub it_value : timespec , } # [ test ] fn bindgen_test_layout_itimerspec ( ) { assert_eq ! ( :: core :: mem :: size_of :: < itimerspec > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( itimerspec ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < itimerspec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( itimerspec ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < itimerspec > ( ) ) ) . it_interval as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( itimerspec ) , "::" , stringify ! ( it_interval ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < itimerspec > ( ) ) ) . it_value as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( itimerspec ) , "::" , stringify ! ( it_value ) ) ) ; } pub type sigset_t = __sigset_t ; pub type fd_mask = ctypes :: c_ulong ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _types_fd_set { pub fds_bits : [ fd_mask ; 1usize ] , } # [ test ] fn bindgen_test_layout__types_fd_set ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _types_fd_set > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( _types_fd_set ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _types_fd_set > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _types_fd_set ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _types_fd_set > ( ) ) ) . fds_bits as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _types_fd_set ) , "::" , stringify ! ( fds_bits ) ) ) ; } extern "C" { pub fn select ( __n : ctypes :: c_int , __readfds : * mut _types_fd_set , __writefds : * mut _types_fd_set , __exceptfds : * mut _types_fd_set , __timeout : * mut timeval ) -> ctypes :: c_int ; } extern "C" { pub fn pselect ( __n : ctypes :: c_int , __readfds : * mut _types_fd_set , __writefds : * mut _types_fd_set , __exceptfds : * mut _types_fd_set , __timeout : * const timespec , __set : * const sigset_t ) -> ctypes :: c_int ; } pub type in_addr_t = __uint32_t ; pub type in_port_t = __uint16_t ; pub type u_char = ctypes :: c_uchar ; pub type u_short = ctypes :: c_ushort ; pub type u_int = ctypes :: c_uint ; pub type u_long = ctypes :: c_ulong ; pub type ushort = ctypes :: c_ushort ; pub type uint = ctypes :: c_uint ; pub type ulong = ctypes :: c_ulong ; pub type blkcnt_t = __blkcnt_t ; pub type blksize_t = __blksize_t ; pub type clock_t = ctypes :: c_ulong ; pub type daddr_t = ctypes :: c_long ; pub type caddr_t = * mut ctypes :: c_char ; pub type fsblkcnt_t = __fsblkcnt_t ; pub type fsfilcnt_t = __fsfilcnt_t ; pub type id_t = __id_t ; pub type ino_t = __ino_t ; pub type off_t = __off_t ; pub type dev_t = __dev_t ; pub type uid_t = __uid_t ; pub type gid_t = __gid_t ; pub type pid_t = __pid_t ; pub type key_t = __key_t ; pub type mode_t = __mode_t ; pub type nlink_t = __nlink_t ; pub type clockid_t = __clockid_t ; pub type timer_t = __timer_t ; pub type useconds_t = __useconds_t ; pub type sbintime_t = __int64_t ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct sched_param { pub sched_priority : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_sched_param ( ) { assert_eq ! ( :: core :: mem :: size_of :: < sched_param > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( sched_param ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < sched_param > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( sched_param ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < sched_param > ( ) ) ) . sched_priority as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( sched_param ) , "::" , stringify ! ( sched_priority ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_t { _unused : [ u8 ; 0 ] , } pub type pthread_t = * mut __pthread_t ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct pthread_attr_t { pub stackaddr : * mut ctypes :: c_void , pub stacksize : ctypes :: c_int , pub schedparam : sched_param , pub detachstate : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_pthread_attr_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < pthread_attr_t > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( pthread_attr_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < pthread_attr_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_attr_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_attr_t > ( ) ) ) . stackaddr as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( pthread_attr_t ) , "::" , stringify ! ( stackaddr ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_attr_t > ( ) ) ) . stacksize as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( pthread_attr_t ) , "::" , stringify ! ( stacksize ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_attr_t > ( ) ) ) . schedparam as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( pthread_attr_t ) , "::" , stringify ! ( schedparam ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_attr_t > ( ) ) ) . detachstate as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( pthread_attr_t ) , "::" , stringify ! ( detachstate ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct pthread_mutex_t { pub type_ : ctypes :: c_int , pub __bindgen_anon_1 : pthread_mutex_t__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_mutex_t__bindgen_ty_1 { pub normal : _LOCK_T , pub recursive : _LOCK_RECURSIVE_T , _bindgen_union_align : [ u32 ; 3usize ] , } # [ test ] fn bindgen_test_layout_pthread_mutex_t__bindgen_ty_1 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < pthread_mutex_t__bindgen_ty_1 > ( ) , 12usize , concat ! ( "Size of: " , stringify ! ( pthread_mutex_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < pthread_mutex_t__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_mutex_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_mutex_t__bindgen_ty_1 > ( ) ) ) . normal as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( pthread_mutex_t__bindgen_ty_1 ) , "::" , stringify ! ( normal ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_mutex_t__bindgen_ty_1 > ( ) ) ) . recursive as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( pthread_mutex_t__bindgen_ty_1 ) , "::" , stringify ! ( recursive ) ) ) ; } # [ test ] fn bindgen_test_layout_pthread_mutex_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < pthread_mutex_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( pthread_mutex_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < pthread_mutex_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_mutex_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_mutex_t > ( ) ) ) . type_ as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( pthread_mutex_t ) , "::" , stringify ! ( type_ ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct pthread_mutexattr_t { } # [ test ] fn bindgen_test_layout_pthread_mutexattr_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < pthread_mutexattr_t > ( ) , 0usize , concat ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < pthread_mutexattr_t > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( pthread_mutexattr_t ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct pthread_cond_t { pub clock_id : clockid_t , pub cond : _COND_T , } # [ test ] fn bindgen_test_layout_pthread_cond_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < pthread_cond_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( pthread_cond_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < pthread_cond_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_cond_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_cond_t > ( ) ) ) . clock_id as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( pthread_cond_t ) , "::" , stringify ! ( clock_id ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_cond_t > ( ) ) ) . cond as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( pthread_cond_t ) , "::" , stringify ! ( cond ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct pthread_condattr_t { pub clock_id : clockid_t , } # [ test ] fn bindgen_test_layout_pthread_condattr_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < pthread_condattr_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( pthread_condattr_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < pthread_condattr_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_condattr_t > ( ) ) ) . clock_id as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( pthread_condattr_t ) , "::" , stringify ! ( clock_id ) ) ) ; } pub type pthread_key_t = __uint32_t ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct pthread_once_t { pub status : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_pthread_once_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < pthread_once_t > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( pthread_once_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < pthread_once_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_once_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < pthread_once_t > ( ) ) ) . status as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( pthread_once_t ) , "::" , stringify ! ( status ) ) ) ; } pub type __gnuc_va_list = __builtin_va_list ; pub type va_list = __gnuc_va_list ; pub type __ULong = ctypes :: c_uint ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __locale_t { _unused : [ u8 ; 0 ] , } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _Bigint { pub _next : * mut _Bigint , pub _k : ctypes :: c_int , pub _maxwds : ctypes :: c_int , pub _sign : ctypes :: c_int , pub _wds : ctypes :: c_int , pub _x : [ __ULong ; 1usize ] , } # [ test ] fn bindgen_test_layout__Bigint ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _Bigint > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( _Bigint ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _Bigint > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _Bigint ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _Bigint > ( ) ) ) . _next as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _Bigint ) , "::" , stringify ! ( _next ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _Bigint > ( ) ) ) . _k as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( _Bigint ) , "::" , stringify ! ( _k ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _Bigint > ( ) ) ) . _maxwds as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( _Bigint ) , "::" , stringify ! ( _maxwds ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _Bigint > ( ) ) ) . _sign as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( _Bigint ) , "::" , stringify ! ( _sign ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _Bigint > ( ) ) ) . _wds as * const _ as usize } , 20usize , concat ! ( "Offset of field: " , stringify ! ( _Bigint ) , "::" , stringify ! ( _wds ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _Bigint > ( ) ) ) . _x as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( _Bigint ) , "::" , stringify ! ( _x ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __tm { pub __tm_sec : ctypes :: c_int , pub __tm_min : ctypes :: c_int , pub __tm_hour : ctypes :: c_int , pub __tm_mday : ctypes :: c_int , pub __tm_mon : ctypes :: c_int , pub __tm_year : ctypes :: c_int , pub __tm_wday : ctypes :: c_int , pub __tm_yday : ctypes :: c_int , pub __tm_isdst : ctypes :: c_int , } # [ test ] fn bindgen_test_layout___tm ( ) { assert_eq ! ( :: core :: mem :: size_of :: < __tm > ( ) , 36usize , concat ! ( "Size of: " , stringify ! ( __tm ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < __tm > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __tm ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_sec as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_sec ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_min as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_min ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_hour as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_hour ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_mday as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_mday ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_mon as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_mon ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_year as * const _ as usize } , 20usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_year ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_wday as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_wday ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_yday as * const _ as usize } , 28usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_yday ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __tm > ( ) ) ) . __tm_isdst as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( __tm ) , "::" , stringify ! ( __tm_isdst ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _on_exit_args { pub _fnargs : [ * mut ctypes :: c_void ; 32usize ] , pub _dso_handle : [ * mut ctypes :: c_void ; 32usize ] , pub _fntypes : __ULong , pub _is_cxa : __ULong , } # [ test ] fn bindgen_test_layout__on_exit_args ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _on_exit_args > ( ) , 520usize , concat ! ( "Size of: " , stringify ! ( _on_exit_args ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _on_exit_args > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _on_exit_args ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _on_exit_args > ( ) ) ) . _fnargs as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _on_exit_args ) , "::" , stringify ! ( _fnargs ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _on_exit_args > ( ) ) ) . _dso_handle as * const _ as usize } , 256usize , concat ! ( "Offset of field: " , stringify ! ( _on_exit_args ) , "::" , stringify ! ( _dso_handle ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _on_exit_args > ( ) ) ) . _fntypes as * const _ as usize } , 512usize , concat ! ( "Offset of field: " , stringify ! ( _on_exit_args ) , "::" , stringify ! ( _fntypes ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _on_exit_args > ( ) ) ) . _is_cxa as * const _ as usize } , 516usize , concat ! ( "Offset of field: " , stringify ! ( _on_exit_args ) , "::" , stringify ! ( _is_cxa ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _atexit { pub _next : * mut _atexit , pub _ind : ctypes :: c_int , pub _fns : [ :: core :: option :: Option < unsafe extern "C" fn ( ) > ; 32usize ] , pub _on_exit_args : _on_exit_args , } # [ test ] fn bindgen_test_layout__atexit ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _atexit > ( ) , 792usize , concat ! ( "Size of: " , stringify ! ( _atexit ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _atexit > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _atexit ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _atexit > ( ) ) ) . _next as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _atexit ) , "::" , stringify ! ( _next ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _atexit > ( ) ) ) . _ind as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( _atexit ) , "::" , stringify ! ( _ind ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _atexit > ( ) ) ) . _fns as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( _atexit ) , "::" , stringify ! ( _fns ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _atexit > ( ) ) ) . _on_exit_args as * const _ as usize } , 272usize , concat ! ( "Offset of field: " , stringify ! ( _atexit ) , "::" , stringify ! ( _on_exit_args ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __sbuf { pub _base : * mut ctypes :: c_uchar , pub _size : ctypes :: c_int , } # [ test ] fn bindgen_test_layout___sbuf ( ) { assert_eq ! ( :: core :: mem :: size_of :: < __sbuf > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( __sbuf ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < __sbuf > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __sbuf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sbuf > ( ) ) ) . _base as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( __sbuf ) , "::" , stringify ! ( _base ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sbuf > ( ) ) ) . _size as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( __sbuf ) , "::" , stringify ! ( _size ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct __sFILE { pub _p : * mut ctypes :: c_uchar , pub _r : ctypes :: c_int , pub _w : ctypes :: c_int , pub _flags : ctypes :: c_short , pub _file : ctypes :: c_short , pub _bf : __sbuf , pub _lbfsize : ctypes :: c_int , pub _cookie : * mut ctypes :: c_void , pub _read : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void , arg3 : * mut ctypes :: c_char , arg4 : ctypes :: c_int ) -> ctypes :: c_int > , pub _write : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void , arg3 : * const ctypes :: c_char , arg4 : ctypes :: c_int ) -> ctypes :: c_int > , pub _seek : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void , arg3 : _fpos_t , arg4 : ctypes :: c_int ) -> _fpos_t > , pub _close : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void ) -> ctypes :: c_int > , pub _ub : __sbuf , pub _up : * mut ctypes :: c_uchar , pub _ur : ctypes :: c_int , pub _ubuf : [ ctypes :: c_uchar ; 3usize ] , pub _nbuf : [ ctypes :: c_uchar ; 1usize ] , pub _lb : __sbuf , pub _blksize : ctypes :: c_int , pub _offset : _off_t , pub _data : * mut _reent , pub _lock : _flock_t , pub _mbstate : _mbstate_t , pub _flags2 : ctypes :: c_int , } # [ test ] fn bindgen_test_layout___sFILE ( ) { assert_eq ! ( :: core :: mem :: size_of :: < __sFILE > ( ) , 184usize , concat ! ( "Size of: " , stringify ! ( __sFILE ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < __sFILE > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __sFILE ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _p as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _p ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _r as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _r ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _w as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _w ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _flags as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _flags ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _file as * const _ as usize } , 18usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _file ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _bf as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _bf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _lbfsize as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _lbfsize ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _cookie as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _cookie ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _read as * const _ as usize } , 56usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _read ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _write as * const _ as usize } , 64usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _write ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _seek as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _seek ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _close as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _close ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _ub as * const _ as usize } , 88usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _ub ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _up as * const _ as usize } , 104usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _up ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _ur as * const _ as usize } , 112usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _ur ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _ubuf as * const _ as usize } , 116usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _ubuf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _nbuf as * const _ as usize } , 119usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _nbuf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _lb as * const _ as usize } , 120usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _lb ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _blksize as * const _ as usize } , 136usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _blksize ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _offset as * const _ as usize } , 144usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _offset ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _data as * const _ as usize } , 152usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _data ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _lock as * const _ as usize } , 160usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _lock ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _mbstate as * const _ as usize } , 172usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _mbstate ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < __sFILE > ( ) ) ) . _flags2 as * const _ as usize } , 180usize , concat ! ( "Offset of field: " , stringify ! ( __sFILE ) , "::" , stringify ! ( _flags2 ) ) ) ; } pub type __FILE = __sFILE ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _glue { pub _next : * mut _glue , pub _niobs : ctypes :: c_int , pub _iobs : * mut __FILE , } # [ test ] fn bindgen_test_layout__glue ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _glue > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( _glue ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _glue > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _glue ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _glue > ( ) ) ) . _next as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _glue ) , "::" , stringify ! ( _next ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _glue > ( ) ) ) . _niobs as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( _glue ) , "::" , stringify ! ( _niobs ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _glue > ( ) ) ) . _iobs as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( _glue ) , "::" , stringify ! ( _iobs ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _rand48 { pub _seed : [ ctypes :: c_ushort ; 3usize ] , pub _mult : [ ctypes :: c_ushort ; 3usize ] , pub _add : ctypes :: c_ushort , } # [ test ] fn bindgen_test_layout__rand48 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _rand48 > ( ) , 14usize , concat ! ( "Size of: " , stringify ! ( _rand48 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _rand48 > ( ) , 2usize , concat ! ( "Alignment of " , stringify ! ( _rand48 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _rand48 > ( ) ) ) . _seed as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _rand48 ) , "::" , stringify ! ( _seed ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _rand48 > ( ) ) ) . _mult as * const _ as usize } , 6usize , concat ! ( "Offset of field: " , stringify ! ( _rand48 ) , "::" , stringify ! ( _mult ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _rand48 > ( ) ) ) . _add as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( _rand48 ) , "::" , stringify ! ( _add ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _reent { pub _errno : ctypes :: c_int , pub _stdin : * mut __FILE , pub _stdout : * mut __FILE , pub _stderr : * mut __FILE , pub _inc : ctypes :: c_int , pub _emergency : [ ctypes :: c_char ; 25usize ] , pub _unspecified_locale_info : ctypes :: c_int , pub _locale : * mut __locale_t , pub __sdidinit : ctypes :: c_int , pub __cleanup : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * mut _reent ) > , pub _result : * mut _Bigint , pub _result_k : ctypes :: c_int , pub _p5s : * mut _Bigint , pub _freelist : * mut * mut _Bigint , pub _cvtlen : ctypes :: c_int , pub _cvtbuf : * mut ctypes :: c_char , pub _new : _reent__bindgen_ty_1 , pub _atexit : * mut _atexit , pub _atexit0 : _atexit , pub _sig_func : * mut :: core :: option :: Option < unsafe extern "C" fn ( arg1 : ctypes :: c_int ) > , pub __sglue : _glue , pub __sf : [ __FILE ; 3usize ] , pub deviceData : * mut ctypes :: c_void , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union _reent__bindgen_ty_1 { pub _reent : _reent__bindgen_ty_1__bindgen_ty_1 , pub _unused : _reent__bindgen_ty_1__bindgen_ty_2 , _bindgen_union_align : [ u64 ; 45usize ] , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _reent__bindgen_ty_1__bindgen_ty_1 { pub _unused_rand : ctypes :: c_uint , pub _strtok_last : * mut ctypes :: c_char , pub _asctime_buf : [ ctypes :: c_char ; 26usize ] , pub _localtime_buf : __tm , pub _gamma_signgam : ctypes :: c_int , pub _rand_next : ctypes :: c_ulonglong , pub _r48 : _rand48 , pub _mblen_state : _mbstate_t , pub _mbtowc_state : _mbstate_t , pub _wctomb_state : _mbstate_t , pub _l64a_buf : [ ctypes :: c_char ; 8usize ] , pub _signal_buf : [ ctypes :: c_char ; 24usize ] , pub _getdate_err : ctypes :: c_int , pub _mbrlen_state : _mbstate_t , pub _mbrtowc_state : _mbstate_t , pub _mbsrtowcs_state : _mbstate_t , pub _wcrtomb_state : _mbstate_t , pub _wcsrtombs_state : _mbstate_t , pub _h_errno : ctypes :: c_int , } # [ test ] fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_1 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) , 216usize , concat ! ( "Size of: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _unused_rand as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _unused_rand ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _strtok_last as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _strtok_last ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _asctime_buf as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _asctime_buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _localtime_buf as * const _ as usize } , 44usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _localtime_buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _gamma_signgam as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _gamma_signgam ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _rand_next as * const _ as usize } , 88usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _rand_next ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _r48 as * const _ as usize } , 96usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _r48 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _mblen_state as * const _ as usize } , 112usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _mblen_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _mbtowc_state as * const _ as usize } , 120usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _mbtowc_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _wctomb_state as * const _ as usize } , 128usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _wctomb_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _l64a_buf as * const _ as usize } , 136usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _l64a_buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _signal_buf as * const _ as usize } , 144usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _signal_buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _getdate_err as * const _ as usize } , 168usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _getdate_err ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _mbrlen_state as * const _ as usize } , 172usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _mbrlen_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _mbrtowc_state as * const _ as usize } , 180usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _mbrtowc_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _mbsrtowcs_state as * const _ as usize } , 188usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _mbsrtowcs_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _wcrtomb_state as * const _ as usize } , 196usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _wcrtomb_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _wcsrtombs_state as * const _ as usize } , 204usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _wcsrtombs_state ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . _h_errno as * const _ as usize } , 212usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( _h_errno ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _reent__bindgen_ty_1__bindgen_ty_2 { pub _nextf : [ * mut ctypes :: c_uchar ; 30usize ] , pub _nmalloc : [ ctypes :: c_uint ; 30usize ] , } # [ test ] fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_2 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _reent__bindgen_ty_1__bindgen_ty_2 > ( ) , 360usize , concat ! ( "Size of: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_2 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _reent__bindgen_ty_1__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_2 > ( ) ) ) . _nextf as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! ( _nextf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1__bindgen_ty_2 > ( ) ) ) . _nmalloc as * const _ as usize } , 240usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! ( _nmalloc ) ) ) ; } # [ test ] fn bindgen_test_layout__reent__bindgen_ty_1 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _reent__bindgen_ty_1 > ( ) , 360usize , concat ! ( "Size of: " , stringify ! ( _reent__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _reent__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _reent__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1 > ( ) ) ) . _reent as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1 ) , "::" , stringify ! ( _reent ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent__bindgen_ty_1 > ( ) ) ) . _unused as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _reent__bindgen_ty_1 ) , "::" , stringify ! ( _unused ) ) ) ; } # [ test ] fn bindgen_test_layout__reent ( ) { assert_eq ! ( :: core :: mem :: size_of :: < _reent > ( ) , 1896usize , concat ! ( "Size of: " , stringify ! ( _reent ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < _reent > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _reent ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _errno as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _errno ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _stdin as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _stdin ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _stdout as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _stdout ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _stderr as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _stderr ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _inc as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _inc ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _emergency as * const _ as usize } , 36usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _emergency ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _unspecified_locale_info as * const _ as usize } , 64usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _unspecified_locale_info ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _locale as * const _ as usize } , 72usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _locale ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . __sdidinit as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( __sdidinit ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . __cleanup as * const _ as usize } , 88usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( __cleanup ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _result as * const _ as usize } , 96usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _result ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _result_k as * const _ as usize } , 104usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _result_k ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _p5s as * const _ as usize } , 112usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _p5s ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _freelist as * const _ as usize } , 120usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _freelist ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _cvtlen as * const _ as usize } , 128usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _cvtlen ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _cvtbuf as * const _ as usize } , 136usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _cvtbuf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _new as * const _ as usize } , 144usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _new ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _atexit as * const _ as usize } , 504usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _atexit ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _atexit0 as * const _ as usize } , 512usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _atexit0 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . _sig_func as * const _ as usize } , 1304usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( _sig_func ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . __sglue as * const _ as usize } , 1312usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( __sglue ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . __sf as * const _ as usize } , 1336usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( __sf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < _reent > ( ) ) ) . deviceData as * const _ as usize } , 1888usize , concat ! ( "Offset of field: " , stringify ! ( _reent ) , "::" , stringify ! ( deviceData ) ) ) ; } extern "C" { pub static mut _impure_ptr : * mut _reent ; } extern "C" { pub static mut _global_impure_ptr : * mut _reent ; } extern "C" { pub fn _reclaim_reent ( arg1 : * mut _reent ) ; } extern "C" { pub fn __getreent ( ) -> * mut _reent ; } pub type FILE = __FILE ; pub type fpos_t = _fpos_t ; extern "C" { pub fn ctermid ( arg1 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn tmpfile ( ) -> * mut FILE ; } extern "C" { pub fn tmpnam ( arg1 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn tempnam ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn fclose ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fflush ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn freopen ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : * mut FILE ) -> * mut FILE ; } extern "C" { pub fn setbuf ( arg1 : * mut FILE , arg2 : * mut ctypes :: c_char ) ; } extern "C" { pub fn setvbuf ( arg1 : * mut FILE , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int , arg4 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn fprintf ( arg1 : * mut FILE , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn fscanf ( arg1 : * mut FILE , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn printf ( arg1 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn scanf ( arg1 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn sscanf ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn vfprintf ( arg1 : * mut FILE , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vprintf ( arg1 : * const ctypes :: c_char , arg2 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vsprintf ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn fgetc ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fgets ( arg1 : * mut ctypes :: c_char , arg2 : ctypes :: c_int , arg3 : * mut FILE ) -> * mut ctypes :: c_char ; } extern "C" { pub fn fputc ( arg1 : ctypes :: c_int , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fputs ( arg1 : * const ctypes :: c_char , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn getc ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn getchar ( ) -> ctypes :: c_int ; } extern "C" { pub fn gets ( arg1 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn putc ( arg1 : ctypes :: c_int , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn putchar ( arg1 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn puts ( arg1 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn ungetc ( arg1 : ctypes :: c_int , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fread ( arg1 : * mut ctypes :: c_void , _size : usize , _n : usize , arg2 : * mut FILE ) -> usize ; } extern "C" { pub fn fwrite ( arg1 : * const ctypes :: c_void , _size : usize , _n : usize , arg2 : * mut FILE ) -> usize ; } extern "C" { pub fn fgetpos ( arg1 : * mut FILE , arg2 : * mut fpos_t ) -> ctypes :: c_int ; } extern "C" { pub fn fseek ( arg1 : * mut FILE , arg2 : ctypes :: c_long , arg3 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn fsetpos ( arg1 : * mut FILE , arg2 : * const fpos_t ) -> ctypes :: c_int ; } extern "C" { pub fn ftell ( arg1 : * mut FILE ) -> ctypes :: c_long ; } extern "C" { pub fn rewind ( arg1 : * mut FILE ) ; } extern "C" { pub fn clearerr ( arg1 : * mut FILE ) ; } extern "C" { pub fn feof ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn ferror ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn perror ( arg1 : * const ctypes :: c_char ) ; } extern "C" { pub fn fopen ( _name : * const ctypes :: c_char , _type : * const ctypes :: c_char ) -> * mut FILE ; } extern "C" { pub fn sprintf ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn remove ( arg1 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn rename ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn fseeko ( arg1 : * mut FILE , arg2 : off_t , arg3 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn ftello ( arg1 : * mut FILE ) -> off_t ; } extern "C" { pub fn snprintf ( arg1 : * mut ctypes :: c_char , arg2 : usize , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn vsnprintf ( arg1 : * mut ctypes :: c_char , arg2 : usize , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vfscanf ( arg1 : * mut FILE , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vscanf ( arg1 : * const ctypes :: c_char , arg2 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vsscanf ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn asiprintf ( arg1 : * mut * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn asniprintf ( arg1 : * mut ctypes :: c_char , arg2 : * mut usize , arg3 : * const ctypes :: c_char , ... ) -> * mut ctypes :: c_char ; } extern "C" { pub fn asnprintf ( arg1 : * mut ctypes :: c_char , arg2 : * mut usize , arg3 : * const ctypes :: c_char , ... ) -> * mut ctypes :: c_char ; } extern "C" { pub fn diprintf ( arg1 : ctypes :: c_int , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn fiprintf ( arg1 : * mut FILE , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn fiscanf ( arg1 : * mut FILE , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn iprintf ( arg1 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn iscanf ( arg1 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn siprintf ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn siscanf ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn sniprintf ( arg1 : * mut ctypes :: c_char , arg2 : usize , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn vasiprintf ( arg1 : * mut * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vasniprintf ( arg1 : * mut ctypes :: c_char , arg2 : * mut usize , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> * mut ctypes :: c_char ; } extern "C" { pub fn vasnprintf ( arg1 : * mut ctypes :: c_char , arg2 : * mut usize , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> * mut ctypes :: c_char ; } extern "C" { pub fn vdiprintf ( arg1 : ctypes :: c_int , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vfiprintf ( arg1 : * mut FILE , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vfiscanf ( arg1 : * mut FILE , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn viprintf ( arg1 : * const ctypes :: c_char , arg2 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn viscanf ( arg1 : * const ctypes :: c_char , arg2 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vsiprintf ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vsiscanf ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vsniprintf ( arg1 : * mut ctypes :: c_char , arg2 : usize , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn fdopen ( arg1 : ctypes :: c_int , arg2 : * const ctypes :: c_char ) -> * mut FILE ; } extern "C" { pub fn fileno ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn pclose ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn popen ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut FILE ; } extern "C" { pub fn setbuffer ( arg1 : * mut FILE , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int ) ; } extern "C" { pub fn setlinebuf ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn getw ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn putw ( arg1 : ctypes :: c_int , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn getc_unlocked ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn getchar_unlocked ( ) -> ctypes :: c_int ; } extern "C" { pub fn flockfile ( arg1 : * mut FILE ) ; } extern "C" { pub fn ftrylockfile ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn funlockfile ( arg1 : * mut FILE ) ; } extern "C" { pub fn putc_unlocked ( arg1 : ctypes :: c_int , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn putchar_unlocked ( arg1 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn dprintf ( arg1 : ctypes :: c_int , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn fmemopen ( arg1 : * mut ctypes :: c_void , arg2 : usize , arg3 : * const ctypes :: c_char ) -> * mut FILE ; } extern "C" { pub fn open_memstream ( arg1 : * mut * mut ctypes :: c_char , arg2 : * mut usize ) -> * mut FILE ; } extern "C" { pub fn vdprintf ( arg1 : ctypes :: c_int , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn renameat ( arg1 : ctypes :: c_int , arg2 : * const ctypes :: c_char , arg3 : ctypes :: c_int , arg4 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _asiprintf_r ( arg1 : * mut _reent , arg2 : * mut * mut ctypes :: c_char , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _asniprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * mut usize , arg4 : * const ctypes :: c_char , ... ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _asnprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * mut usize , arg4 : * const ctypes :: c_char , ... ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _asprintf_r ( arg1 : * mut _reent , arg2 : * mut * mut ctypes :: c_char , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _diprintf_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _dprintf_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _fclose_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fcloseall_r ( arg1 : * mut _reent ) -> ctypes :: c_int ; } extern "C" { pub fn _fdopen_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * const ctypes :: c_char ) -> * mut FILE ; } extern "C" { pub fn _fflush_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fgetc_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fgetc_unlocked_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fgets_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int , arg4 : * mut FILE ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _fgets_unlocked_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int , arg4 : * mut FILE ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _fgetpos_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * mut fpos_t ) -> ctypes :: c_int ; } extern "C" { pub fn _fsetpos_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const fpos_t ) -> ctypes :: c_int ; } extern "C" { pub fn _fiprintf_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _fiscanf_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _fmemopen_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void , arg3 : usize , arg4 : * const ctypes :: c_char ) -> * mut FILE ; } extern "C" { pub fn _fopen_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * const ctypes :: c_char ) -> * mut FILE ; } extern "C" { pub fn _freopen_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * const ctypes :: c_char , arg4 : * mut FILE ) -> * mut FILE ; } extern "C" { pub fn _fprintf_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _fpurge_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fputc_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fputc_unlocked_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fputs_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fputs_unlocked_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fread_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void , _size : usize , _n : usize , arg3 : * mut FILE ) -> usize ; } extern "C" { pub fn _fread_unlocked_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void , _size : usize , _n : usize , arg3 : * mut FILE ) -> usize ; } extern "C" { pub fn _fscanf_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _fseek_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : ctypes :: c_long , arg4 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _fseeko_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : _off_t , arg4 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _ftell_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_long ; } extern "C" { pub fn _ftello_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> _off_t ; } extern "C" { pub fn _rewind_r ( arg1 : * mut _reent , arg2 : * mut FILE ) ; } extern "C" { pub fn _fwrite_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_void , _size : usize , _n : usize , arg3 : * mut FILE ) -> usize ; } extern "C" { pub fn _fwrite_unlocked_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_void , _size : usize , _n : usize , arg3 : * mut FILE ) -> usize ; } extern "C" { pub fn _getc_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _getc_unlocked_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _getchar_r ( arg1 : * mut _reent ) -> ctypes :: c_int ; } extern "C" { pub fn _getchar_unlocked_r ( arg1 : * mut _reent ) -> ctypes :: c_int ; } extern "C" { pub fn _gets_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _iprintf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _iscanf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _open_memstream_r ( arg1 : * mut _reent , arg2 : * mut * mut ctypes :: c_char , arg3 : * mut usize ) -> * mut FILE ; } extern "C" { pub fn _perror_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char ) ; } extern "C" { pub fn _printf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _putc_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _putc_unlocked_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _putchar_unlocked_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _putchar_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _puts_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _remove_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _rename_r ( arg1 : * mut _reent , _old : * const ctypes :: c_char , _new : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _scanf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _siprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _siscanf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _sniprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : usize , arg4 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _snprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : usize , arg4 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _sprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _sscanf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _tempnam_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _tmpfile_r ( arg1 : * mut _reent ) -> * mut FILE ; } extern "C" { pub fn _tmpnam_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _ungetc_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _vasiprintf_r ( arg1 : * mut _reent , arg2 : * mut * mut ctypes :: c_char , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vasniprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * mut usize , arg4 : * const ctypes :: c_char , arg5 : * mut __va_list_tag ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _vasnprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * mut usize , arg4 : * const ctypes :: c_char , arg5 : * mut __va_list_tag ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _vasprintf_r ( arg1 : * mut _reent , arg2 : * mut * mut ctypes :: c_char , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vdiprintf_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vdprintf_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vfiprintf_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vfiscanf_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vfprintf_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vfscanf_r ( arg1 : * mut _reent , arg2 : * mut FILE , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _viprintf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _viscanf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vprintf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vscanf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vsiprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vsiscanf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vsniprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : usize , arg4 : * const ctypes :: c_char , arg5 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vsnprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : usize , arg4 : * const ctypes :: c_char , arg5 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vsprintf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vsscanf_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * const ctypes :: c_char , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn fpurge ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn __getdelim ( arg1 : * mut * mut ctypes :: c_char , arg2 : * mut usize , arg3 : ctypes :: c_int , arg4 : * mut FILE ) -> isize ; } extern "C" { pub fn __getline ( arg1 : * mut * mut ctypes :: c_char , arg2 : * mut usize , arg3 : * mut FILE ) -> isize ; } extern "C" { pub fn clearerr_unlocked ( arg1 : * mut FILE ) ; } extern "C" { pub fn feof_unlocked ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn ferror_unlocked ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fileno_unlocked ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fflush_unlocked ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fgetc_unlocked ( arg1 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fputc_unlocked ( arg1 : ctypes :: c_int , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fread_unlocked ( arg1 : * mut ctypes :: c_void , _size : usize , _n : usize , arg2 : * mut FILE ) -> usize ; } extern "C" { pub fn fwrite_unlocked ( arg1 : * const ctypes :: c_void , _size : usize , _n : usize , arg2 : * mut FILE ) -> usize ; } extern "C" { pub fn __srget_r ( arg1 : * mut _reent , arg2 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn __swbuf_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : * mut FILE ) -> ctypes :: c_int ; } extern "C" { pub fn funopen ( __cookie : * const ctypes :: c_void , __readfn : :: core :: option :: Option < unsafe extern "C" fn ( __cookie : * mut ctypes :: c_void , __buf : * mut ctypes :: c_char , __n : ctypes :: c_int ) -> ctypes :: c_int > , __writefn : :: core :: option :: Option < unsafe extern "C" fn ( __cookie : * mut ctypes :: c_void , __buf : * const ctypes :: c_char , __n : ctypes :: c_int ) -> ctypes :: c_int > , __seekfn : :: core :: option :: Option < unsafe extern "C" fn ( __cookie : * mut ctypes :: c_void , __off : fpos_t , __whence : ctypes :: c_int ) -> fpos_t > , __closefn : :: core :: option :: Option < unsafe extern "C" fn ( __cookie : * mut ctypes :: c_void ) -> ctypes :: c_int > ) -> * mut FILE ; } extern "C" { pub fn _funopen_r ( arg1 : * mut _reent , __cookie : * const ctypes :: c_void , __readfn : :: core :: option :: Option < unsafe extern "C" fn ( __cookie : * mut ctypes :: c_void , __buf : * mut ctypes :: c_char , __n : ctypes :: c_int ) -> ctypes :: c_int > , __writefn : :: core :: option :: Option < unsafe extern "C" fn ( __cookie : * mut ctypes :: c_void , __buf : * const ctypes :: c_char , __n : ctypes :: c_int ) -> ctypes :: c_int > , __seekfn : :: core :: option :: Option < unsafe extern "C" fn ( __cookie : * mut ctypes :: c_void , __off : fpos_t , __whence : ctypes :: c_int ) -> fpos_t > , __closefn : :: core :: option :: Option < unsafe extern "C" fn ( __cookie : * mut ctypes :: c_void ) -> ctypes :: c_int > ) -> * mut FILE ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct div_t { pub quot : ctypes :: c_int , pub rem : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_div_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < div_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( div_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < div_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( div_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < div_t > ( ) ) ) . quot as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( div_t ) , "::" , stringify ! ( quot ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < div_t > ( ) ) ) . rem as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( div_t ) , "::" , stringify ! ( rem ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct ldiv_t { pub quot : ctypes :: c_long , pub rem : ctypes :: c_long , } # [ test ] fn bindgen_test_layout_ldiv_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < ldiv_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( ldiv_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < ldiv_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ldiv_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < ldiv_t > ( ) ) ) . quot as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( ldiv_t ) , "::" , stringify ! ( quot ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < ldiv_t > ( ) ) ) . rem as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( ldiv_t ) , "::" , stringify ! ( rem ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct lldiv_t { pub quot : ctypes :: c_longlong , pub rem : ctypes :: c_longlong , } # [ test ] fn bindgen_test_layout_lldiv_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < lldiv_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( lldiv_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < lldiv_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( lldiv_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < lldiv_t > ( ) ) ) . quot as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( lldiv_t ) , "::" , stringify ! ( quot ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < lldiv_t > ( ) ) ) . rem as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( lldiv_t ) , "::" , stringify ! ( rem ) ) ) ; } pub type __compar_fn_t = :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * const ctypes :: c_void , arg2 : * const ctypes :: c_void ) -> ctypes :: c_int > ; extern "C" { pub fn __locale_mb_cur_max ( ) -> ctypes :: c_int ; } extern "C" { pub fn abort ( ) ; } extern "C" { pub fn abs ( arg1 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn arc4random ( ) -> __uint32_t ; } extern "C" { pub fn arc4random_uniform ( arg1 : __uint32_t ) -> __uint32_t ; } extern "C" { pub fn arc4random_buf ( arg1 : * mut ctypes :: c_void , arg2 : usize ) ; } extern "C" { pub fn atexit ( __func : :: core :: option :: Option < unsafe extern "C" fn ( ) > ) -> ctypes :: c_int ; } extern "C" { pub fn atof ( __nptr : * const ctypes :: c_char ) -> f64 ; } extern "C" { pub fn atoff ( __nptr : * const ctypes :: c_char ) -> f32 ; } extern "C" { pub fn atoi ( __nptr : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _atoi_r ( arg1 : * mut _reent , __nptr : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn atol ( __nptr : * const ctypes :: c_char ) -> ctypes :: c_long ; } extern "C" { pub fn _atol_r ( arg1 : * mut _reent , __nptr : * const ctypes :: c_char ) -> ctypes :: c_long ; } extern "C" { pub fn bsearch ( __key : * const ctypes :: c_void , __base : * const ctypes :: c_void , __nmemb : usize , __size : usize , _compar : __compar_fn_t ) -> * mut ctypes :: c_void ; } extern "C" { pub fn calloc ( arg1 : usize , arg2 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn div ( __numer : ctypes :: c_int , __denom : ctypes :: c_int ) -> div_t ; } extern "C" { pub fn exit ( __status : ctypes :: c_int ) ; } extern "C" { pub fn free ( arg1 : * mut ctypes :: c_void ) ; } extern "C" { pub fn getenv ( __string : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _getenv_r ( arg1 : * mut _reent , __string : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _findenv ( arg1 : * const ctypes :: c_char , arg2 : * mut ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _findenv_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub static mut suboptarg : * mut ctypes :: c_char ; } extern "C" { pub fn getsubopt ( arg1 : * mut * mut ctypes :: c_char , arg2 : * const * mut ctypes :: c_char , arg3 : * mut * mut ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn labs ( arg1 : ctypes :: c_long ) -> ctypes :: c_long ; } extern "C" { pub fn ldiv ( __numer : ctypes :: c_long , __denom : ctypes :: c_long ) -> ldiv_t ; } extern "C" { pub fn malloc ( arg1 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn mblen ( arg1 : * const ctypes :: c_char , arg2 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn _mblen_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : usize , arg4 : * mut _mbstate_t ) -> ctypes :: c_int ; } extern "C" { pub fn mbtowc ( arg1 : * mut wchar_t , arg2 : * const ctypes :: c_char , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn _mbtowc_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : * const ctypes :: c_char , arg4 : usize , arg5 : * mut _mbstate_t ) -> ctypes :: c_int ; } extern "C" { pub fn wctomb ( arg1 : * mut ctypes :: c_char , arg2 : wchar_t ) -> ctypes :: c_int ; } extern "C" { pub fn _wctomb_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : wchar_t , arg4 : * mut _mbstate_t ) -> ctypes :: c_int ; } extern "C" { pub fn mbstowcs ( arg1 : * mut wchar_t , arg2 : * const ctypes :: c_char , arg3 : usize ) -> usize ; } extern "C" { pub fn _mbstowcs_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : * const ctypes :: c_char , arg4 : usize , arg5 : * mut _mbstate_t ) -> usize ; } extern "C" { pub fn wcstombs ( arg1 : * mut ctypes :: c_char , arg2 : * const wchar_t , arg3 : usize ) -> usize ; } extern "C" { pub fn _wcstombs_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * const wchar_t , arg4 : usize , arg5 : * mut _mbstate_t ) -> usize ; } extern "C" { pub fn mkdtemp ( arg1 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn mkstemp ( arg1 : * mut ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn mkstemps ( arg1 : * mut ctypes :: c_char , arg2 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn mktemp ( arg1 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _mkdtemp_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _mkostemp_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _mkostemps_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int , arg4 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _mkstemp_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _mkstemps_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _mktemp_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn qsort ( __base : * mut ctypes :: c_void , __nmemb : usize , __size : usize , _compar : __compar_fn_t ) ; } extern "C" { pub fn rand ( ) -> ctypes :: c_int ; } extern "C" { pub fn realloc ( arg1 : * mut ctypes :: c_void , arg2 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn reallocarray ( arg1 : * mut ctypes :: c_void , arg2 : usize , arg3 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn reallocf ( arg1 : * mut ctypes :: c_void , arg2 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn realpath ( path : * const ctypes :: c_char , resolved_path : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn rpmatch ( response : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn srand ( __seed : ctypes :: c_uint ) ; } extern "C" { pub fn strtod ( __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char ) -> f64 ; } extern "C" { pub fn _strtod_r ( arg1 : * mut _reent , __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char ) -> f64 ; } extern "C" { pub fn strtof ( __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char ) -> f32 ; } extern "C" { pub fn strtol ( __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char , __base : ctypes :: c_int ) -> ctypes :: c_long ; } extern "C" { pub fn _strtol_r ( arg1 : * mut _reent , __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char , __base : ctypes :: c_int ) -> ctypes :: c_long ; } extern "C" { pub fn strtoul ( __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char , __base : ctypes :: c_int ) -> ctypes :: c_ulong ; } extern "C" { pub fn _strtoul_r ( arg1 : * mut _reent , __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char , __base : ctypes :: c_int ) -> ctypes :: c_ulong ; } extern "C" { pub fn system ( __string : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn a64l ( __input : * const ctypes :: c_char ) -> ctypes :: c_long ; } extern "C" { pub fn l64a ( __input : ctypes :: c_long ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _l64a_r ( arg1 : * mut _reent , __input : ctypes :: c_long ) -> * mut ctypes :: c_char ; } extern "C" { pub fn on_exit ( __func : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : ctypes :: c_int , arg2 : * mut ctypes :: c_void ) > , __arg : * mut ctypes :: c_void ) -> ctypes :: c_int ; } extern "C" { pub fn _Exit ( __status : ctypes :: c_int ) ; } extern "C" { pub fn putenv ( __string : * mut ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _putenv_r ( arg1 : * mut _reent , __string : * mut ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _reallocf_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void , arg3 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn setenv ( __string : * const ctypes :: c_char , __value : * const ctypes :: c_char , __overwrite : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _setenv_r ( arg1 : * mut _reent , __string : * const ctypes :: c_char , __value : * const ctypes :: c_char , __overwrite : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn __itoa ( arg1 : ctypes :: c_int , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn __utoa ( arg1 : ctypes :: c_uint , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn itoa ( arg1 : ctypes :: c_int , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn utoa ( arg1 : ctypes :: c_uint , arg2 : * mut ctypes :: c_char , arg3 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn rand_r ( __seed : * mut ctypes :: c_uint ) -> ctypes :: c_int ; } extern "C" { pub fn drand48 ( ) -> f64 ; } extern "C" { pub fn _drand48_r ( arg1 : * mut _reent ) -> f64 ; } extern "C" { pub fn erand48 ( arg1 : * mut ctypes :: c_ushort ) -> f64 ; } extern "C" { pub fn _erand48_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_ushort ) -> f64 ; } extern "C" { pub fn jrand48 ( arg1 : * mut ctypes :: c_ushort ) -> ctypes :: c_long ; } extern "C" { pub fn _jrand48_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_ushort ) -> ctypes :: c_long ; } extern "C" { pub fn lcong48 ( arg1 : * mut ctypes :: c_ushort ) ; } extern "C" { pub fn _lcong48_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_ushort ) ; } extern "C" { pub fn lrand48 ( ) -> ctypes :: c_long ; } extern "C" { pub fn _lrand48_r ( arg1 : * mut _reent ) -> ctypes :: c_long ; } extern "C" { pub fn mrand48 ( ) -> ctypes :: c_long ; } extern "C" { pub fn _mrand48_r ( arg1 : * mut _reent ) -> ctypes :: c_long ; } extern "C" { pub fn nrand48 ( arg1 : * mut ctypes :: c_ushort ) -> ctypes :: c_long ; } extern "C" { pub fn _nrand48_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_ushort ) -> ctypes :: c_long ; } extern "C" { pub fn seed48 ( arg1 : * mut ctypes :: c_ushort ) -> * mut ctypes :: c_ushort ; } extern "C" { pub fn _seed48_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_ushort ) -> * mut ctypes :: c_ushort ; } extern "C" { pub fn srand48 ( arg1 : ctypes :: c_long ) ; } extern "C" { pub fn _srand48_r ( arg1 : * mut _reent , arg2 : ctypes :: c_long ) ; } extern "C" { pub fn initstate ( arg1 : ctypes :: c_uint , arg2 : * mut ctypes :: c_char , arg3 : usize ) -> * mut ctypes :: c_char ; } extern "C" { pub fn random ( ) -> ctypes :: c_long ; } extern "C" { pub fn setstate ( arg1 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn srandom ( arg1 : ctypes :: c_uint ) ; } extern "C" { pub fn atoll ( __nptr : * const ctypes :: c_char ) -> ctypes :: c_longlong ; } extern "C" { pub fn _atoll_r ( arg1 : * mut _reent , __nptr : * const ctypes :: c_char ) -> ctypes :: c_longlong ; } extern "C" { pub fn llabs ( arg1 : ctypes :: c_longlong ) -> ctypes :: c_longlong ; } extern "C" { pub fn lldiv ( __numer : ctypes :: c_longlong , __denom : ctypes :: c_longlong ) -> lldiv_t ; } extern "C" { pub fn strtoll ( __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char , __base : ctypes :: c_int ) -> ctypes :: c_longlong ; } extern "C" { pub fn _strtoll_r ( arg1 : * mut _reent , __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char , __base : ctypes :: c_int ) -> ctypes :: c_longlong ; } extern "C" { pub fn strtoull ( __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char , __base : ctypes :: c_int ) -> ctypes :: c_ulonglong ; } extern "C" { pub fn _strtoull_r ( arg1 : * mut _reent , __n : * const ctypes :: c_char , __end_PTR : * mut * mut ctypes :: c_char , __base : ctypes :: c_int ) -> ctypes :: c_ulonglong ; } extern "C" { pub fn cfree ( arg1 : * mut ctypes :: c_void ) ; } extern "C" { pub fn unsetenv ( __string : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn _unsetenv_r ( arg1 : * mut _reent , __string : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn posix_memalign ( arg1 : * mut * mut ctypes :: c_void , arg2 : usize , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn _dtoa_r ( arg1 : * mut _reent , arg2 : f64 , arg3 : ctypes :: c_int , arg4 : ctypes :: c_int , arg5 : * mut ctypes :: c_int , arg6 : * mut ctypes :: c_int , arg7 : * mut * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _malloc_r ( arg1 : * mut _reent , arg2 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn _calloc_r ( arg1 : * mut _reent , arg2 : usize , arg3 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn _free_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void ) ; } extern "C" { pub fn _realloc_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_void , arg3 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn _mstats_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char ) ; } extern "C" { pub fn _system_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn __eprintf ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : ctypes :: c_uint , arg4 : * const ctypes :: c_char ) ; } extern "C" { pub fn qsort_r ( __base : * mut ctypes :: c_void , __nmemb : usize , __size : usize , __thunk : * mut ctypes :: c_void , _compar : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * mut ctypes :: c_void , arg2 : * const ctypes :: c_void , arg3 : * const ctypes :: c_void ) -> ctypes :: c_int > ) ; } extern "C" { pub fn _strtold_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut * mut ctypes :: c_char ) -> f64 ; } extern "C" { pub fn strtold ( arg1 : * const ctypes :: c_char , arg2 : * mut * mut ctypes :: c_char ) -> f64 ; } extern "C" { pub fn aligned_alloc ( arg1 : usize , arg2 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn at_quick_exit ( arg1 : :: core :: option :: Option < unsafe extern "C" fn ( ) > ) -> ctypes :: c_int ; } extern "C" { pub fn quick_exit ( arg1 : ctypes :: c_int ) ; } pub type locale_t = * mut __locale_t ; extern "C" { pub fn bcmp ( arg1 : * const ctypes :: c_void , arg2 : * const ctypes :: c_void , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn bcopy ( arg1 : * const ctypes :: c_void , arg2 : * mut ctypes :: c_void , arg3 : usize ) ; } extern "C" { pub fn bzero ( arg1 : * mut ctypes :: c_void , arg2 : usize ) ; } extern "C" { pub fn explicit_bzero ( arg1 : * mut ctypes :: c_void , arg2 : usize ) ; } extern "C" { pub fn ffs ( arg1 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn ffsl ( arg1 : ctypes :: c_long ) -> ctypes :: c_int ; } extern "C" { pub fn ffsll ( arg1 : ctypes :: c_longlong ) -> ctypes :: c_int ; } extern "C" { pub fn fls ( arg1 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn flsl ( arg1 : ctypes :: c_long ) -> ctypes :: c_int ; } extern "C" { pub fn flsll ( arg1 : ctypes :: c_longlong ) -> ctypes :: c_int ; } extern "C" { pub fn index ( arg1 : * const ctypes :: c_char , arg2 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn rindex ( arg1 : * const ctypes :: c_char , arg2 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strcasecmp ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn strncasecmp ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn strcasecmp_l ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn strncasecmp_l ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize , arg4 : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn memchr ( arg1 : * const ctypes :: c_void , arg2 : ctypes :: c_int , arg3 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn memcmp ( arg1 : * const ctypes :: c_void , arg2 : * const ctypes :: c_void , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn memcpy ( arg1 : * mut ctypes :: c_void , arg2 : * const ctypes :: c_void , arg3 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn memmove ( arg1 : * mut ctypes :: c_void , arg2 : * const ctypes :: c_void , arg3 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn memset ( arg1 : * mut ctypes :: c_void , arg2 : ctypes :: c_int , arg3 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn strcat ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strchr ( arg1 : * const ctypes :: c_char , arg2 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strcmp ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn strcoll ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn strcpy ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strcspn ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> ctypes :: c_ulong ; } extern "C" { pub fn strerror ( arg1 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strlen ( arg1 : * const ctypes :: c_char ) -> ctypes :: c_ulong ; } extern "C" { pub fn strncat ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strncmp ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn strncpy ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strpbrk ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strrchr ( arg1 : * const ctypes :: c_char , arg2 : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strspn ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> ctypes :: c_ulong ; } extern "C" { pub fn strstr ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strtok ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strxfrm ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> ctypes :: c_ulong ; } extern "C" { pub fn strcoll_l ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn strerror_l ( arg1 : ctypes :: c_int , arg2 : locale_t ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strxfrm_l ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize , arg4 : locale_t ) -> usize ; } extern "C" { pub fn strtok_r ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : * mut * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn timingsafe_bcmp ( arg1 : * const ctypes :: c_void , arg2 : * const ctypes :: c_void , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn timingsafe_memcmp ( arg1 : * const ctypes :: c_void , arg2 : * const ctypes :: c_void , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn memccpy ( arg1 : * mut ctypes :: c_void , arg2 : * const ctypes :: c_void , arg3 : ctypes :: c_int , arg4 : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn stpcpy ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn stpncpy ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strdup ( arg1 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _strdup_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strndup ( arg1 : * const ctypes :: c_char , arg2 : usize ) -> * mut ctypes :: c_char ; } extern "C" { pub fn _strndup_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : usize ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strerror_r ( arg1 : ctypes :: c_int , arg2 : * mut ctypes :: c_char , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn _strerror_r ( arg1 : * mut _reent , arg2 : ctypes :: c_int , arg3 : ctypes :: c_int , arg4 : * mut ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strlcat ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> usize ; } extern "C" { pub fn strlcpy ( arg1 : * mut ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> usize ; } extern "C" { pub fn strnlen ( arg1 : * const ctypes :: c_char , arg2 : usize ) -> usize ; } extern "C" { pub fn strsep ( arg1 : * mut * mut ctypes :: c_char , arg2 : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strnstr ( arg1 : * const ctypes :: c_char , arg2 : * const ctypes :: c_char , arg3 : usize ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strlwr ( arg1 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strupr ( arg1 : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn strsignal ( __signo : ctypes :: c_int ) -> * mut ctypes :: c_char ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct tm { _unused : [ u8 ; 0 ] , } pub type mbstate_t = _mbstate_t ; extern "C" { pub fn btowc ( arg1 : ctypes :: c_int ) -> wint_t ; } extern "C" { pub fn wctob ( arg1 : wint_t ) -> ctypes :: c_int ; } extern "C" { pub fn mbrlen ( arg1 : * const ctypes :: c_char , arg2 : usize , arg3 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn mbrtowc ( arg1 : * mut wchar_t , arg2 : * const ctypes :: c_char , arg3 : usize , arg4 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn _mbrtowc_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : * const ctypes :: c_char , arg4 : usize , arg5 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn mbsinit ( arg1 : * const mbstate_t ) -> ctypes :: c_int ; } extern "C" { pub fn mbsnrtowcs ( arg1 : * mut wchar_t , arg2 : * mut * const ctypes :: c_char , arg3 : usize , arg4 : usize , arg5 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn _mbsnrtowcs_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : * mut * const ctypes :: c_char , arg4 : usize , arg5 : usize , arg6 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn mbsrtowcs ( arg1 : * mut wchar_t , arg2 : * mut * const ctypes :: c_char , arg3 : usize , arg4 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn _mbsrtowcs_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : * mut * const ctypes :: c_char , arg4 : usize , arg5 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn wcrtomb ( arg1 : * mut ctypes :: c_char , arg2 : wchar_t , arg3 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn _wcrtomb_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : wchar_t , arg4 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn wcsnrtombs ( arg1 : * mut ctypes :: c_char , arg2 : * mut * const wchar_t , arg3 : usize , arg4 : usize , arg5 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn _wcsnrtombs_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * mut * const wchar_t , arg4 : usize , arg5 : usize , arg6 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn wcsrtombs ( arg1 : * mut ctypes :: c_char , arg2 : * mut * const wchar_t , arg3 : usize , arg4 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn _wcsrtombs_r ( arg1 : * mut _reent , arg2 : * mut ctypes :: c_char , arg3 : * mut * const wchar_t , arg4 : usize , arg5 : * mut mbstate_t ) -> usize ; } extern "C" { pub fn wcscasecmp ( arg1 : * const wchar_t , arg2 : * const wchar_t ) -> ctypes :: c_int ; } extern "C" { pub fn wcscat ( arg1 : * mut wchar_t , arg2 : * const wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn wcschr ( arg1 : * const wchar_t , arg2 : wchar_t ) -> * mut ctypes :: c_int ; } extern "C" { pub fn wcscmp ( arg1 : * const wchar_t , arg2 : * const wchar_t ) -> ctypes :: c_int ; } extern "C" { pub fn wcscoll ( arg1 : * const wchar_t , arg2 : * const wchar_t ) -> ctypes :: c_int ; } extern "C" { pub fn wcscpy ( arg1 : * mut wchar_t , arg2 : * const wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn wcpcpy ( arg1 : * mut wchar_t , arg2 : * const wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn wcsdup ( arg1 : * const wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn _wcsdup_r ( arg1 : * mut _reent , arg2 : * const wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn wcscspn ( arg1 : * const wchar_t , arg2 : * const wchar_t ) -> usize ; } extern "C" { pub fn wcsftime ( arg1 : * mut wchar_t , arg2 : usize , arg3 : * const wchar_t , arg4 : * const tm ) -> usize ; } extern "C" { pub fn wcslcat ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> usize ; } extern "C" { pub fn wcslcpy ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> usize ; } extern "C" { pub fn wcslen ( arg1 : * const wchar_t ) -> ctypes :: c_ulong ; } extern "C" { pub fn wcsncasecmp ( arg1 : * const wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn wcsncat ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> * mut wchar_t ; } extern "C" { pub fn wcsncmp ( arg1 : * const wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn wcsncpy ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> * mut wchar_t ; } extern "C" { pub fn wcpncpy ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> * mut wchar_t ; } extern "C" { pub fn wcsnlen ( arg1 : * const wchar_t , arg2 : usize ) -> usize ; } extern "C" { pub fn wcspbrk ( arg1 : * const wchar_t , arg2 : * const wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn wcsrchr ( arg1 : * const wchar_t , arg2 : wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn wcsspn ( arg1 : * const wchar_t , arg2 : * const wchar_t ) -> usize ; } extern "C" { pub fn wcsstr ( arg1 : * const wchar_t , arg2 : * const wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn wcstok ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t ) -> * mut wchar_t ; } extern "C" { pub fn wcstod ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t ) -> f64 ; } extern "C" { pub fn _wcstod_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t ) -> f64 ; } extern "C" { pub fn wcstof ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t ) -> f32 ; } extern "C" { pub fn _wcstof_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t ) -> f32 ; } extern "C" { pub fn wcsxfrm ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> usize ; } extern "C" { pub fn wcscasecmp_l ( arg1 : * const wchar_t , arg2 : * const wchar_t , arg3 : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn wcsncasecmp_l ( arg1 : * const wchar_t , arg2 : * const wchar_t , arg3 : usize , arg4 : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn wcscoll_l ( arg1 : * const wchar_t , arg2 : * const wchar_t , arg3 : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn wcsxfrm_l ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize , arg4 : locale_t ) -> usize ; } extern "C" { pub fn wmemchr ( arg1 : * const wchar_t , arg2 : wchar_t , arg3 : usize ) -> * mut ctypes :: c_int ; } extern "C" { pub fn wmemcmp ( arg1 : * const wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> ctypes :: c_int ; } extern "C" { pub fn wmemcpy ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> * mut wchar_t ; } extern "C" { pub fn wmemmove ( arg1 : * mut wchar_t , arg2 : * const wchar_t , arg3 : usize ) -> * mut wchar_t ; } extern "C" { pub fn wmemset ( arg1 : * mut wchar_t , arg2 : wchar_t , arg3 : usize ) -> * mut wchar_t ; } extern "C" { pub fn wcstol ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t , arg3 : ctypes :: c_int ) -> ctypes :: c_long ; } extern "C" { pub fn wcstoll ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t , arg3 : ctypes :: c_int ) -> ctypes :: c_longlong ; } extern "C" { pub fn wcstoul ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t , arg3 : ctypes :: c_int ) -> ctypes :: c_ulong ; } extern "C" { pub fn wcstoull ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t , arg3 : ctypes :: c_int ) -> ctypes :: c_ulonglong ; } extern "C" { pub fn _wcstol_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t , arg4 : ctypes :: c_int ) -> ctypes :: c_long ; } extern "C" { pub fn _wcstoll_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t , arg4 : ctypes :: c_int ) -> ctypes :: c_longlong ; } extern "C" { pub fn _wcstoul_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t , arg4 : ctypes :: c_int ) -> ctypes :: c_ulong ; } extern "C" { pub fn _wcstoull_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t , arg4 : ctypes :: c_int ) -> ctypes :: c_ulonglong ; } extern "C" { pub fn wcstold ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t ) -> f64 ; } extern "C" { pub fn fgetwc ( arg1 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn fgetws ( arg1 : * mut wchar_t , arg2 : ctypes :: c_int , arg3 : * mut __FILE ) -> * mut wchar_t ; } extern "C" { pub fn fputwc ( arg1 : wchar_t , arg2 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn fputws ( arg1 : * const wchar_t , arg2 : * mut __FILE ) -> ctypes :: c_int ; } extern "C" { pub fn fwide ( arg1 : * mut __FILE , arg2 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn getwc ( arg1 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn getwchar ( ) -> wint_t ; } extern "C" { pub fn putwc ( arg1 : wchar_t , arg2 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn putwchar ( arg1 : wchar_t ) -> wint_t ; } extern "C" { pub fn ungetwc ( wc : wint_t , arg1 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _fgetwc_r ( arg1 : * mut _reent , arg2 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _fgetwc_unlocked_r ( arg1 : * mut _reent , arg2 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _fgetws_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : ctypes :: c_int , arg4 : * mut __FILE ) -> * mut wchar_t ; } extern "C" { pub fn _fgetws_unlocked_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : ctypes :: c_int , arg4 : * mut __FILE ) -> * mut wchar_t ; } extern "C" { pub fn _fputwc_r ( arg1 : * mut _reent , arg2 : wchar_t , arg3 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _fputwc_unlocked_r ( arg1 : * mut _reent , arg2 : wchar_t , arg3 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _fputws_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut __FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fputws_unlocked_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut __FILE ) -> ctypes :: c_int ; } extern "C" { pub fn _fwide_r ( arg1 : * mut _reent , arg2 : * mut __FILE , arg3 : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn _getwc_r ( arg1 : * mut _reent , arg2 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _getwc_unlocked_r ( arg1 : * mut _reent , arg2 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _getwchar_r ( ptr : * mut _reent ) -> wint_t ; } extern "C" { pub fn _getwchar_unlocked_r ( ptr : * mut _reent ) -> wint_t ; } extern "C" { pub fn _putwc_r ( arg1 : * mut _reent , arg2 : wchar_t , arg3 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _putwc_unlocked_r ( arg1 : * mut _reent , arg2 : wchar_t , arg3 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn _putwchar_r ( arg1 : * mut _reent , arg2 : wchar_t ) -> wint_t ; } extern "C" { pub fn _putwchar_unlocked_r ( arg1 : * mut _reent , arg2 : wchar_t ) -> wint_t ; } extern "C" { pub fn _ungetwc_r ( arg1 : * mut _reent , wc : wint_t , arg2 : * mut __FILE ) -> wint_t ; } extern "C" { pub fn open_wmemstream ( arg1 : * mut * mut wchar_t , arg2 : * mut usize ) -> * mut __FILE ; } extern "C" { pub fn _open_wmemstream_r ( arg1 : * mut _reent , arg2 : * mut * mut wchar_t , arg3 : * mut usize ) -> * mut __FILE ; } extern "C" { pub fn fwprintf ( arg1 : * mut __FILE , arg2 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn swprintf ( arg1 : * mut wchar_t , arg2 : usize , arg3 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn vfwprintf ( arg1 : * mut __FILE , arg2 : * const wchar_t , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vswprintf ( arg1 : * mut wchar_t , arg2 : usize , arg3 : * const wchar_t , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vwprintf ( arg1 : * const wchar_t , arg2 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn wprintf ( arg1 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _fwprintf_r ( arg1 : * mut _reent , arg2 : * mut __FILE , arg3 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _swprintf_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : usize , arg4 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _vfwprintf_r ( arg1 : * mut _reent , arg2 : * mut __FILE , arg3 : * const wchar_t , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vswprintf_r ( arg1 : * mut _reent , arg2 : * mut wchar_t , arg3 : usize , arg4 : * const wchar_t , arg5 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vwprintf_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _wprintf_r ( arg1 : * mut _reent , arg2 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn fwscanf ( arg1 : * mut __FILE , arg2 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn swscanf ( arg1 : * const wchar_t , arg2 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn vfwscanf ( arg1 : * mut __FILE , arg2 : * const wchar_t , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vswscanf ( arg1 : * const wchar_t , arg2 : * const wchar_t , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn vwscanf ( arg1 : * const wchar_t , arg2 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn wscanf ( arg1 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _fwscanf_r ( arg1 : * mut _reent , arg2 : * mut __FILE , arg3 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _swscanf_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * const wchar_t , ... ) -> ctypes :: c_int ; } extern "C" { pub fn _vfwscanf_r ( arg1 : * mut _reent , arg2 : * mut __FILE , arg3 : * const wchar_t , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vswscanf_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * const wchar_t , arg4 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _vwscanf_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn _wscanf_r ( arg1 : * mut _reent , arg2 : * const wchar_t , ... ) -> ctypes :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct imaxdiv_t { pub quot : intmax_t , pub rem : intmax_t , } # [ test ] fn bindgen_test_layout_imaxdiv_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < imaxdiv_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( imaxdiv_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < imaxdiv_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( imaxdiv_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < imaxdiv_t > ( ) ) ) . quot as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( imaxdiv_t ) , "::" , stringify ! ( quot ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < imaxdiv_t > ( ) ) ) . rem as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( imaxdiv_t ) , "::" , stringify ! ( rem ) ) ) ; } extern "C" { pub fn imaxabs ( j : intmax_t ) -> intmax_t ; } extern "C" { pub fn imaxdiv ( numer : intmax_t , denomer : intmax_t ) -> imaxdiv_t ; } extern "C" { pub fn strtoimax ( arg1 : * const ctypes :: c_char , arg2 : * mut * mut ctypes :: c_char , arg3 : ctypes :: c_int ) -> intmax_t ; } extern "C" { pub fn _strtoimax_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut * mut ctypes :: c_char , arg4 : ctypes :: c_int ) -> intmax_t ; } extern "C" { pub fn strtoumax ( arg1 : * const ctypes :: c_char , arg2 : * mut * mut ctypes :: c_char , arg3 : ctypes :: c_int ) -> uintmax_t ; } extern "C" { pub fn _strtoumax_r ( arg1 : * mut _reent , arg2 : * const ctypes :: c_char , arg3 : * mut * mut ctypes :: c_char , arg4 : ctypes :: c_int ) -> uintmax_t ; } extern "C" { pub fn wcstoimax ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t , arg3 : ctypes :: c_int ) -> intmax_t ; } extern "C" { pub fn _wcstoimax_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t , arg4 : ctypes :: c_int ) -> intmax_t ; } extern "C" { pub fn wcstoumax ( arg1 : * const wchar_t , arg2 : * mut * mut wchar_t , arg3 : ctypes :: c_int ) -> uintmax_t ; } extern "C" { pub fn _wcstoumax_r ( arg1 : * mut _reent , arg2 : * const wchar_t , arg3 : * mut * mut wchar_t , arg4 : ctypes :: c_int ) -> uintmax_t ; } extern "C" { pub fn strtoimax_l ( arg1 : * const ctypes :: c_char , _restrict : * mut * mut ctypes :: c_char , arg2 : ctypes :: c_int , arg3 : locale_t ) -> intmax_t ; } extern "C" { pub fn strtoumax_l ( arg1 : * const ctypes :: c_char , _restrict : * mut * mut ctypes :: c_char , arg2 : ctypes :: c_int , arg3 : locale_t ) -> uintmax_t ; } extern "C" { pub fn wcstoimax_l ( arg1 : * const wchar_t , _restrict : * mut * mut wchar_t , arg2 : ctypes :: c_int , arg3 : locale_t ) -> intmax_t ; } extern "C" { pub fn wcstoumax_l ( arg1 : * const wchar_t , _restrict : * mut * mut wchar_t , arg2 : ctypes :: c_int , arg3 : locale_t ) -> uintmax_t ; } extern "C" { pub fn isalnum ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isalpha ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn iscntrl ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isdigit ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isgraph ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn islower ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isprint ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn ispunct ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isspace ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isupper ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isxdigit ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn tolower ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn toupper ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isblank ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isascii ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn toascii ( __c : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn isalnum_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isalpha_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isblank_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn iscntrl_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isdigit_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isgraph_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn islower_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isprint_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn ispunct_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isspace_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isupper_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isxdigit_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn tolower_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn toupper_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn isascii_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub fn toascii_l ( __c : ctypes :: c_int , __l : locale_t ) -> ctypes :: c_int ; } extern "C" { pub static mut _ctype_ : [ ctypes :: c_char ; 0usize ] ; } extern "C" { pub fn atan ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn cos ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn sin ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn tan ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn tanh ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn frexp ( arg1 : f64 , arg2 : * mut ctypes :: c_int ) -> f64 ; } extern "C" { pub fn modf ( arg1 : f64 , arg2 : * mut f64 ) -> f64 ; } extern "C" { pub fn ceil ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn fabs ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn floor ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn acos ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn asin ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn atan2 ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn cosh ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn sinh ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn exp ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn ldexp ( arg1 : f64 , arg2 : ctypes :: c_int ) -> f64 ; } extern "C" { pub fn log ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn log10 ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn pow ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn sqrt ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn fmod ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn finite ( arg1 : f64 ) -> ctypes :: c_int ; } extern "C" { pub fn finitef ( arg1 : f32 ) -> ctypes :: c_int ; } extern "C" { pub fn finitel ( arg1 : f64 ) -> ctypes :: c_int ; } extern "C" { pub fn isinff ( arg1 : f32 ) -> ctypes :: c_int ; } extern "C" { pub fn isnanf ( arg1 : f32 ) -> ctypes :: c_int ; } extern "C" { pub fn isinf ( arg1 : f64 ) -> ctypes :: c_int ; } extern "C" { pub fn isnan ( arg1 : f64 ) -> ctypes :: c_int ; } pub type float_t = f32 ; pub type double_t = f64 ; extern "C" { pub fn __isinff ( x : f32 ) -> ctypes :: c_int ; } extern "C" { pub fn __isinfd ( x : f64 ) -> ctypes :: c_int ; } extern "C" { pub fn __isnanf ( x : f32 ) -> ctypes :: c_int ; } extern "C" { pub fn __isnand ( x : f64 ) -> ctypes :: c_int ; } extern "C" { pub fn __fpclassifyf ( x : f32 ) -> ctypes :: c_int ; } extern "C" { pub fn __fpclassifyd ( x : f64 ) -> ctypes :: c_int ; } extern "C" { pub fn __signbitf ( x : f32 ) -> ctypes :: c_int ; } extern "C" { pub fn __signbitd ( x : f64 ) -> ctypes :: c_int ; } extern "C" { pub fn infinity ( ) -> f64 ; } extern "C" { pub fn nan ( arg1 : * const ctypes :: c_char ) -> f64 ; } extern "C" { pub fn copysign ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn logb ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn ilogb ( arg1 : f64 ) -> ctypes :: c_int ; } extern "C" { pub fn asinh ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn cbrt ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn nextafter ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn rint ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn scalbn ( arg1 : f64 , arg2 : ctypes :: c_int ) -> f64 ; } extern "C" { pub fn exp2 ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn scalbln ( arg1 : f64 , arg2 : ctypes :: c_long ) -> f64 ; } extern "C" { pub fn tgamma ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn nearbyint ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn lrint ( arg1 : f64 ) -> ctypes :: c_long ; } extern "C" { pub fn llrint ( arg1 : f64 ) -> ctypes :: c_longlong ; } extern "C" { pub fn round ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn lround ( arg1 : f64 ) -> ctypes :: c_long ; } extern "C" { pub fn llround ( arg1 : f64 ) -> ctypes :: c_longlong ; } extern "C" { pub fn trunc ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn remquo ( arg1 : f64 , arg2 : f64 , arg3 : * mut ctypes :: c_int ) -> f64 ; } extern "C" { pub fn fdim ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn fmax ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn fmin ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn fma ( arg1 : f64 , arg2 : f64 , arg3 : f64 ) -> f64 ; } extern "C" { pub fn log1p ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn expm1 ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn acosh ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn atanh ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn remainder ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn gamma ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn lgamma ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn erf ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn erfc ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn log2 ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn hypot ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn atanf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn cosf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn sinf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn tanf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn tanhf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn frexpf ( arg1 : f32 , arg2 : * mut ctypes :: c_int ) -> f32 ; } extern "C" { pub fn modff ( arg1 : f32 , arg2 : * mut f32 ) -> f32 ; } extern "C" { pub fn ceilf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn fabsf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn floorf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn acosf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn asinf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn atan2f ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn coshf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn sinhf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn expf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn ldexpf ( arg1 : f32 , arg2 : ctypes :: c_int ) -> f32 ; } extern "C" { pub fn logf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn log10f ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn powf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn sqrtf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn fmodf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn exp2f ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn scalblnf ( arg1 : f32 , arg2 : ctypes :: c_long ) -> f32 ; } extern "C" { pub fn tgammaf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn nearbyintf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn lrintf ( arg1 : f32 ) -> ctypes :: c_long ; } extern "C" { pub fn llrintf ( arg1 : f32 ) -> ctypes :: c_longlong ; } extern "C" { pub fn roundf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn lroundf ( arg1 : f32 ) -> ctypes :: c_long ; } extern "C" { pub fn llroundf ( arg1 : f32 ) -> ctypes :: c_longlong ; } extern "C" { pub fn truncf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn remquof ( arg1 : f32 , arg2 : f32 , arg3 : * mut ctypes :: c_int ) -> f32 ; } extern "C" { pub fn fdimf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn fmaxf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn fminf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn fmaf ( arg1 : f32 , arg2 : f32 , arg3 : f32 ) -> f32 ; } extern "C" { pub fn infinityf ( ) -> f32 ; } extern "C" { pub fn nanf ( arg1 : * const ctypes :: c_char ) -> f32 ; } extern "C" { pub fn copysignf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn logbf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn ilogbf ( arg1 : f32 ) -> ctypes :: c_int ; } extern "C" { pub fn asinhf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn cbrtf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn nextafterf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn rintf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn scalbnf ( arg1 : f32 , arg2 : ctypes :: c_int ) -> f32 ; } extern "C" { pub fn log1pf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn expm1f ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn acoshf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn atanhf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn remainderf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn gammaf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn lgammaf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn erff ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn erfcf ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn log2f ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn hypotf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn hypotl ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn sqrtl ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn drem ( arg1 : f64 , arg2 : f64 ) -> f64 ; } extern "C" { pub fn dremf ( arg1 : f32 , arg2 : f32 ) -> f32 ; } extern "C" { pub fn gamma_r ( arg1 : f64 , arg2 : * mut ctypes :: c_int ) -> f64 ; } extern "C" { pub fn lgamma_r ( arg1 : f64 , arg2 : * mut ctypes :: c_int ) -> f64 ; } extern "C" { pub fn gammaf_r ( arg1 : f32 , arg2 : * mut ctypes :: c_int ) -> f32 ; } extern "C" { pub fn lgammaf_r ( arg1 : f32 , arg2 : * mut ctypes :: c_int ) -> f32 ; } extern "C" { pub fn y0 ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn y1 ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn yn ( arg1 : ctypes :: c_int , arg2 : f64 ) -> f64 ; } extern "C" { pub fn j0 ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn j1 ( arg1 : f64 ) -> f64 ; } extern "C" { pub fn jn ( arg1 : ctypes :: c_int , arg2 : f64 ) -> f64 ; } extern "C" { pub fn y0f ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn y1f ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn ynf ( arg1 : ctypes :: c_int , arg2 : f32 ) -> f32 ; } extern "C" { pub fn j0f ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn j1f ( arg1 : f32 ) -> f32 ; } extern "C" { pub fn jnf ( arg1 : ctypes :: c_int , arg2 : f32 ) -> f32 ; } extern "C" { pub fn __signgam ( ) -> * mut ctypes :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct exception { pub type_ : ctypes :: c_int , pub name : * mut ctypes :: c_char , pub arg1 : f64 , pub arg2 : f64 , pub retval : f64 , pub err : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_exception ( ) { assert_eq ! ( :: core :: mem :: size_of :: < exception > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( exception ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < exception > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( exception ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < exception > ( ) ) ) . type_ as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( exception ) , "::" , stringify ! ( type_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < exception > ( ) ) ) . name as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( exception ) , "::" , stringify ! ( name ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < exception > ( ) ) ) . arg1 as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( exception ) , "::" , stringify ! ( arg1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < exception > ( ) ) ) . arg2 as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( exception ) , "::" , stringify ! ( arg2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < exception > ( ) ) ) . retval as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( exception ) , "::" , stringify ! ( retval ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < exception > ( ) ) ) . err as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( exception ) , "::" , stringify ! ( err ) ) ) ; } extern "C" { pub fn matherr ( e : * mut exception ) -> ctypes :: c_int ; } pub const __fdlibm_version___fdlibm_ieee : __fdlibm_version = -1 ; pub const __fdlibm_version___fdlibm_svid : __fdlibm_version = 0 ; pub const __fdlibm_version___fdlibm_xopen : __fdlibm_version = 1 ; pub const __fdlibm_version___fdlibm_posix : __fdlibm_version = 2 ; pub type __fdlibm_version = i32 ; extern "C" { pub static mut __fdlib_version : __fdlibm_version ; } pub const SDL_bool_SDL_FALSE : SDL_bool = 0 ; pub const SDL_bool_SDL_TRUE : SDL_bool = 1 ; pub type SDL_bool = u32 ; pub type Sint8 = i8 ; pub type Uint8 = u8 ; pub type Sint16 = i16 ; pub type Uint16 = u16 ; pub type Sint32 = i32 ; pub type Uint32 = u32 ; pub type Sint64 = i64 ; pub type Uint64 = u64 ; pub type SDL_compile_time_assert_uint8 = [ ctypes :: c_int ; 1usize ] ; pub type SDL_compile_time_assert_sint8 = [ ctypes :: c_int ; 1usize ] ; pub type SDL_compile_time_assert_uint16 = [ ctypes :: c_int ; 1usize ] ; pub type SDL_compile_time_assert_sint16 = [ ctypes :: c_int ; 1usize ] ; pub type SDL_compile_time_assert_uint32 = [ ctypes :: c_int ; 1usize ] ; pub type SDL_compile_time_assert_sint32 = [ ctypes :: c_int ; 1usize ] ; pub type SDL_compile_time_assert_uint64 = [ ctypes :: c_int ; 1usize ] ; pub type SDL_compile_time_assert_sint64 = [ ctypes :: c_int ; 1usize ] ; pub const SDL_DUMMY_ENUM_DUMMY_ENUM_VALUE : SDL_DUMMY_ENUM = 0 ; pub type SDL_DUMMY_ENUM = u32 ; pub type SDL_compile_time_assert_enum = [ ctypes :: c_int ; 1usize ] ; extern "C" { pub fn SDL_malloc ( size : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn SDL_calloc ( nmemb : usize , size : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn SDL_realloc ( mem : * mut ctypes :: c_void , size : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn SDL_free ( mem : * mut ctypes :: c_void ) ; } pub type SDL_malloc_func = :: core :: option :: Option < unsafe extern "C" fn ( size : usize ) -> * mut ctypes :: c_void > ; pub type SDL_calloc_func = :: core :: option :: Option < unsafe extern "C" fn ( nmemb : usize , size : usize ) -> * mut ctypes :: c_void > ; pub type SDL_realloc_func = :: core :: option :: Option < unsafe extern "C" fn ( mem : * mut ctypes :: c_void , size : usize ) -> * mut ctypes :: c_void > ; pub type SDL_free_func = :: core :: option :: Option < unsafe extern "C" fn ( mem : * mut ctypes :: c_void ) > ; extern "C" { 
 /// \brief Get the current set of SDL memory functions 
 pub fn SDL_GetMemoryFunctions ( malloc_func : * mut SDL_malloc_func , calloc_func : * mut SDL_calloc_func , realloc_func : * mut SDL_realloc_func , free_func : * mut SDL_free_func ) ; } extern "C" { 
 /// \brief Replace SDL's memory allocation functions with a custom set
///
/// \note If you are replacing SDL's memory functions, you should call
/// SDL_GetNumAllocations() and be very careful if it returns non-zero.
/// That means that your free function will be called with memory
/// allocated by the previous memory allocation functions. 
 pub fn SDL_SetMemoryFunctions ( malloc_func : SDL_malloc_func , calloc_func : SDL_calloc_func , realloc_func : SDL_realloc_func , free_func : SDL_free_func ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the number of outstanding (unfreed) allocations 
 pub fn SDL_GetNumAllocations ( ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_getenv ( name : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_setenv ( name : * const ctypes :: c_char , value : * const ctypes :: c_char , overwrite : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_qsort ( base : * mut ctypes :: c_void , nmemb : usize , size : usize , compare : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * const ctypes :: c_void , arg2 : * const ctypes :: c_void ) -> ctypes :: c_int > ) ; } extern "C" { pub fn SDL_abs ( x : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_isdigit ( x : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_isspace ( x : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_toupper ( x : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_tolower ( x : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_memset ( dst : * mut ctypes :: c_void , c : ctypes :: c_int , len : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn SDL_memcpy ( dst : * mut ctypes :: c_void , src : * const ctypes :: c_void , len : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn SDL_memmove ( dst : * mut ctypes :: c_void , src : * const ctypes :: c_void , len : usize ) -> * mut ctypes :: c_void ; } extern "C" { pub fn SDL_memcmp ( s1 : * const ctypes :: c_void , s2 : * const ctypes :: c_void , len : usize ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_wcslen ( wstr : * const wchar_t ) -> usize ; } extern "C" { pub fn SDL_wcslcpy ( dst : * mut wchar_t , src : * const wchar_t , maxlen : usize ) -> usize ; } extern "C" { pub fn SDL_wcslcat ( dst : * mut wchar_t , src : * const wchar_t , maxlen : usize ) -> usize ; } extern "C" { pub fn SDL_wcscmp ( str1 : * const wchar_t , str2 : * const wchar_t ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_strlen ( str : * const ctypes :: c_char ) -> usize ; } extern "C" { pub fn SDL_strlcpy ( dst : * mut ctypes :: c_char , src : * const ctypes :: c_char , maxlen : usize ) -> usize ; } extern "C" { pub fn SDL_utf8strlcpy ( dst : * mut ctypes :: c_char , src : * const ctypes :: c_char , dst_bytes : usize ) -> usize ; } extern "C" { pub fn SDL_strlcat ( dst : * mut ctypes :: c_char , src : * const ctypes :: c_char , maxlen : usize ) -> usize ; } extern "C" { pub fn SDL_strdup ( str : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_strrev ( str : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_strupr ( str : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_strlwr ( str : * mut ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_strchr ( str : * const ctypes :: c_char , c : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_strrchr ( str : * const ctypes :: c_char , c : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_strstr ( haystack : * const ctypes :: c_char , needle : * const ctypes :: c_char ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_utf8strlen ( str : * const ctypes :: c_char ) -> usize ; } extern "C" { pub fn SDL_itoa ( value : ctypes :: c_int , str : * mut ctypes :: c_char , radix : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_uitoa ( value : ctypes :: c_uint , str : * mut ctypes :: c_char , radix : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_ltoa ( value : ctypes :: c_long , str : * mut ctypes :: c_char , radix : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_ultoa ( value : ctypes :: c_ulong , str : * mut ctypes :: c_char , radix : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_lltoa ( value : Sint64 , str : * mut ctypes :: c_char , radix : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_ulltoa ( value : Uint64 , str : * mut ctypes :: c_char , radix : ctypes :: c_int ) -> * mut ctypes :: c_char ; } extern "C" { pub fn SDL_atoi ( str : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_atof ( str : * const ctypes :: c_char ) -> f64 ; } extern "C" { pub fn SDL_strtol ( str : * const ctypes :: c_char , endp : * mut * mut ctypes :: c_char , base : ctypes :: c_int ) -> ctypes :: c_long ; } extern "C" { pub fn SDL_strtoul ( str : * const ctypes :: c_char , endp : * mut * mut ctypes :: c_char , base : ctypes :: c_int ) -> ctypes :: c_ulong ; } extern "C" { pub fn SDL_strtoll ( str : * const ctypes :: c_char , endp : * mut * mut ctypes :: c_char , base : ctypes :: c_int ) -> Sint64 ; } extern "C" { pub fn SDL_strtoull ( str : * const ctypes :: c_char , endp : * mut * mut ctypes :: c_char , base : ctypes :: c_int ) -> Uint64 ; } extern "C" { pub fn SDL_strtod ( str : * const ctypes :: c_char , endp : * mut * mut ctypes :: c_char ) -> f64 ; } extern "C" { pub fn SDL_strcmp ( str1 : * const ctypes :: c_char , str2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_strncmp ( str1 : * const ctypes :: c_char , str2 : * const ctypes :: c_char , maxlen : usize ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_strcasecmp ( str1 : * const ctypes :: c_char , str2 : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_strncasecmp ( str1 : * const ctypes :: c_char , str2 : * const ctypes :: c_char , len : usize ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_sscanf ( text : * const ctypes :: c_char , fmt : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_vsscanf ( text : * const ctypes :: c_char , fmt : * const ctypes :: c_char , ap : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_snprintf ( text : * mut ctypes :: c_char , maxlen : usize , fmt : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_vsnprintf ( text : * mut ctypes :: c_char , maxlen : usize , fmt : * const ctypes :: c_char , ap : * mut __va_list_tag ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_acos ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_acosf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_asin ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_asinf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_atan ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_atanf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_atan2 ( x : f64 , y : f64 ) -> f64 ; } extern "C" { pub fn SDL_atan2f ( x : f32 , y : f32 ) -> f32 ; } extern "C" { pub fn SDL_ceil ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_ceilf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_copysign ( x : f64 , y : f64 ) -> f64 ; } extern "C" { pub fn SDL_copysignf ( x : f32 , y : f32 ) -> f32 ; } extern "C" { pub fn SDL_cos ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_cosf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_fabs ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_fabsf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_floor ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_floorf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_fmod ( x : f64 , y : f64 ) -> f64 ; } extern "C" { pub fn SDL_fmodf ( x : f32 , y : f32 ) -> f32 ; } extern "C" { pub fn SDL_log ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_logf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_log10 ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_log10f ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_pow ( x : f64 , y : f64 ) -> f64 ; } extern "C" { pub fn SDL_powf ( x : f32 , y : f32 ) -> f32 ; } extern "C" { pub fn SDL_scalbn ( x : f64 , n : ctypes :: c_int ) -> f64 ; } extern "C" { pub fn SDL_scalbnf ( x : f32 , n : ctypes :: c_int ) -> f32 ; } extern "C" { pub fn SDL_sin ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_sinf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_sqrt ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_sqrtf ( x : f32 ) -> f32 ; } extern "C" { pub fn SDL_tan ( x : f64 ) -> f64 ; } extern "C" { pub fn SDL_tanf ( x : f32 ) -> f32 ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _SDL_iconv_t { _unused : [ u8 ; 0 ] , } pub type SDL_iconv_t = * mut _SDL_iconv_t ; extern "C" { pub fn SDL_iconv_open ( tocode : * const ctypes :: c_char , fromcode : * const ctypes :: c_char ) -> SDL_iconv_t ; } extern "C" { pub fn SDL_iconv_close ( cd : SDL_iconv_t ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_iconv ( cd : SDL_iconv_t , inbuf : * mut * const ctypes :: c_char , inbytesleft : * mut usize , outbuf : * mut * mut ctypes :: c_char , outbytesleft : * mut usize ) -> usize ; } extern "C" { 
 /// This function converts a string between encodings in one pass, returning a
/// string that must be freed with SDL_free() or NULL on error. 
 pub fn SDL_iconv_string ( tocode : * const ctypes :: c_char , fromcode : * const ctypes :: c_char , inbuf : * const ctypes :: c_char , inbytesleft : usize ) -> * mut ctypes :: c_char ; } extern "C" { 
 /// The prototype for the application's main() function 
 pub fn SDL_main ( argc : ctypes :: c_int , argv : * mut * mut ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { 
 /// This is called by the real SDL main function to let the rest of the
/// library know that initialization was done properly.
///
/// Calling this yourself without knowing what you're doing can cause
/// crashes and hard to diagnose problems with your application. 
 pub fn SDL_SetMainReady ( ) ; } 
 /// < Retry the assert immediately. 
 pub const SDL_AssertState_SDL_ASSERTION_RETRY : SDL_AssertState = 0 ; 
 /// < Make the debugger trigger a breakpoint. 
 pub const SDL_AssertState_SDL_ASSERTION_BREAK : SDL_AssertState = 1 ; 
 /// < Terminate the program. 
 pub const SDL_AssertState_SDL_ASSERTION_ABORT : SDL_AssertState = 2 ; 
 /// < Ignore the assert. 
 pub const SDL_AssertState_SDL_ASSERTION_IGNORE : SDL_AssertState = 3 ; 
 /// < Ignore the assert from now on. 
 pub const SDL_AssertState_SDL_ASSERTION_ALWAYS_IGNORE : SDL_AssertState = 4 ; pub type SDL_AssertState = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_AssertData { pub always_ignore : ctypes :: c_int , pub trigger_count : ctypes :: c_uint , pub condition : * const ctypes :: c_char , pub filename : * const ctypes :: c_char , pub linenum : ctypes :: c_int , pub function : * const ctypes :: c_char , pub next : * const SDL_AssertData , } # [ test ] fn bindgen_test_layout_SDL_AssertData ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_AssertData > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( SDL_AssertData ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_AssertData > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_AssertData ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AssertData > ( ) ) ) . always_ignore as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AssertData ) , "::" , stringify ! ( always_ignore ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AssertData > ( ) ) ) . trigger_count as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AssertData ) , "::" , stringify ! ( trigger_count ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AssertData > ( ) ) ) . condition as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AssertData ) , "::" , stringify ! ( condition ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AssertData > ( ) ) ) . filename as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AssertData ) , "::" , stringify ! ( filename ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AssertData > ( ) ) ) . linenum as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AssertData ) , "::" , stringify ! ( linenum ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AssertData > ( ) ) ) . function as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AssertData ) , "::" , stringify ! ( function ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AssertData > ( ) ) ) . next as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AssertData ) , "::" , stringify ! ( next ) ) ) ; } extern "C" { pub fn SDL_ReportAssertion ( arg1 : * mut SDL_AssertData , arg2 : * const ctypes :: c_char , arg3 : * const ctypes :: c_char , arg4 : ctypes :: c_int ) -> SDL_AssertState ; } pub type SDL_AssertionHandler = :: core :: option :: Option < unsafe extern "C" fn ( data : * const SDL_AssertData , userdata : * mut ctypes :: c_void ) -> SDL_AssertState > ; extern "C" { 
 /// \brief Set an application-defined assertion handler.
///
/// This allows an app to show its own assertion UI and/or force the
/// response to an assertion failure. If the app doesn't provide this, SDL
/// will try to do the right thing, popping up a system-specific GUI dialog,
/// and probably minimizing any fullscreen windows.
///
/// This callback may fire from any thread, but it runs wrapped in a mutex, so
/// it will only fire from one thread at a time.
///
/// Setting the callback to NULL restores SDL's original internal handler.
///
/// This callback is NOT reset to SDL's internal handler upon SDL_Quit()!
///
/// Return SDL_AssertState value of how to handle the assertion failure.
///
/// \param handler Callback function, called when an assertion fails.
/// \param userdata A pointer passed to the callback as-is. 
 pub fn SDL_SetAssertionHandler ( handler : SDL_AssertionHandler , userdata : * mut ctypes :: c_void ) ; } extern "C" { 
 /// \brief Get the default assertion handler.
///
/// This returns the function pointer that is called by default when an
/// assertion is triggered. This is an internal function provided by SDL,
/// that is used for assertions when SDL_SetAssertionHandler() hasn't been
/// used to provide a different function.
///
/// \return The default SDL_AssertionHandler that is called when an assert triggers. 
 pub fn SDL_GetDefaultAssertionHandler ( ) -> SDL_AssertionHandler ; } extern "C" { 
 /// \brief Get the current assertion handler.
///
/// This returns the function pointer that is called when an assertion is
/// triggered. This is either the value last passed to
/// SDL_SetAssertionHandler(), or if no application-specified function is
/// set, is equivalent to calling SDL_GetDefaultAssertionHandler().
///
/// \param puserdata Pointer to a void*, which will store the "userdata"
/// pointer that was passed to SDL_SetAssertionHandler().
/// This value will always be NULL for the default handler.
/// If you don't care about this data, it is safe to pass
/// a NULL pointer to this function to ignore it.
/// \return The SDL_AssertionHandler that is called when an assert triggers. 
 pub fn SDL_GetAssertionHandler ( puserdata : * mut * mut ctypes :: c_void ) -> SDL_AssertionHandler ; } extern "C" { 
 /// \brief Get a list of all assertion failures.
///
/// Get all assertions triggered since last call to SDL_ResetAssertionReport(),
/// or the start of the program.
///
/// The proper way to examine this data looks something like this:
///
/// <code>
/// const SDL_AssertData *item = SDL_GetAssertionReport();
/// while (item) {
/// printf("'%s', %s (%s:%d), triggered %u times, always ignore: %s.\\n",
/// item->condition, item->function, item->filename,
/// item->linenum, item->trigger_count,
/// item->always_ignore ? "yes" : "no");
/// item = item->next;
/// }
/// </code>
///
/// \return List of all assertions.
/// \sa SDL_ResetAssertionReport 
 pub fn SDL_GetAssertionReport ( ) -> * const SDL_AssertData ; } extern "C" { 
 /// \brief Reset the list of all assertion failures.
///
/// Reset list of all assertions triggered.
///
/// \sa SDL_GetAssertionReport 
 pub fn SDL_ResetAssertionReport ( ) ; } pub type SDL_SpinLock = ctypes :: c_int ; extern "C" { 
 /// \brief Try to lock a spin lock by setting it to a non-zero value.
///
/// \param lock Points to the lock.
///
/// \return SDL_TRUE if the lock succeeded, SDL_FALSE if the lock is already held. 
 pub fn SDL_AtomicTryLock ( lock : * mut SDL_SpinLock ) -> SDL_bool ; } extern "C" { 
 /// \brief Lock a spin lock by setting it to a non-zero value.
///
/// \param lock Points to the lock. 
 pub fn SDL_AtomicLock ( lock : * mut SDL_SpinLock ) ; } extern "C" { 
 /// \brief Unlock a spin lock by setting it to 0. Always returns immediately
///
/// \param lock Points to the lock. 
 pub fn SDL_AtomicUnlock ( lock : * mut SDL_SpinLock ) ; } extern "C" { 
 /// Memory barriers are designed to prevent reads and writes from being
/// reordered by the compiler and being seen out of order on multi-core CPUs.
///
/// A typical pattern would be for thread A to write some data and a flag,
/// and for thread B to read the flag and get the data. In this case you
/// would insert a release barrier between writing the data and the flag,
/// guaranteeing that the data write completes no later than the flag is
/// written, and you would insert an acquire barrier between reading the
/// flag and reading the data, to ensure that all the reads associated
/// with the flag have completed.
///
/// In this pattern you should always see a release barrier paired with
/// an acquire barrier and you should gate the data reads/writes with a
/// single flag variable.
///
/// For more information on these semantics, take a look at the blog post:
/// http://preshing.com/20120913/acquire-and-release-semantics 
 pub fn SDL_MemoryBarrierReleaseFunction ( ) ; } extern "C" { pub fn SDL_MemoryBarrierAcquireFunction ( ) ; } 
 /// \brief A type representing an atomic integer value.  It is a struct
/// so people don't accidentally use numeric operations on it. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_atomic_t { pub value : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_SDL_atomic_t ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_atomic_t > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( SDL_atomic_t ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_atomic_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( SDL_atomic_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_atomic_t > ( ) ) ) . value as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_atomic_t ) , "::" , stringify ! ( value ) ) ) ; } extern "C" { 
 /// \brief Set an atomic variable to a new value if it is currently an old value.
///
/// \return SDL_TRUE if the atomic variable was set, SDL_FALSE otherwise.
///
/// \note If you don't know what this function is for, you shouldn't use it! 
 pub fn SDL_AtomicCAS ( a : * mut SDL_atomic_t , oldval : ctypes :: c_int , newval : ctypes :: c_int ) -> SDL_bool ; } extern "C" { 
 /// \brief Set an atomic variable to a value.
///
/// \return The previous value of the atomic variable. 
 pub fn SDL_AtomicSet ( a : * mut SDL_atomic_t , v : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the value of an atomic variable 
 pub fn SDL_AtomicGet ( a : * mut SDL_atomic_t ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Add to an atomic variable.
///
/// \return The previous value of the atomic variable.
///
/// \note This same style can be used for any number operation 
 pub fn SDL_AtomicAdd ( a : * mut SDL_atomic_t , v : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Set a pointer to a new value if it is currently an old value.
///
/// \return SDL_TRUE if the pointer was set, SDL_FALSE otherwise.
///
/// \note If you don't know what this function is for, you shouldn't use it! 
 pub fn SDL_AtomicCASPtr ( a : * mut * mut ctypes :: c_void , oldval : * mut ctypes :: c_void , newval : * mut ctypes :: c_void ) -> SDL_bool ; } extern "C" { 
 /// \brief Set a pointer to a value atomically.
///
/// \return The previous value of the pointer. 
 pub fn SDL_AtomicSetPtr ( a : * mut * mut ctypes :: c_void , v : * mut ctypes :: c_void ) -> * mut ctypes :: c_void ; } extern "C" { 
 /// \brief Get the value of a pointer atomically. 
 pub fn SDL_AtomicGetPtr ( a : * mut * mut ctypes :: c_void ) -> * mut ctypes :: c_void ; } extern "C" { pub fn SDL_SetError ( fmt : * const ctypes :: c_char , ... ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_GetError ( ) -> * const ctypes :: c_char ; } extern "C" { pub fn SDL_ClearError ( ) ; } pub const SDL_errorcode_SDL_ENOMEM : SDL_errorcode = 0 ; pub const SDL_errorcode_SDL_EFREAD : SDL_errorcode = 1 ; pub const SDL_errorcode_SDL_EFWRITE : SDL_errorcode = 2 ; pub const SDL_errorcode_SDL_EFSEEK : SDL_errorcode = 3 ; pub const SDL_errorcode_SDL_UNSUPPORTED : SDL_errorcode = 4 ; pub const SDL_errorcode_SDL_LASTERROR : SDL_errorcode = 5 ; pub type SDL_errorcode = u32 ; extern "C" { pub fn SDL_Error ( code : SDL_errorcode ) -> ctypes :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_mutex { _unused : [ u8 ; 0 ] , } extern "C" { 
 /// Create a mutex, initialized unlocked. 
 pub fn SDL_CreateMutex ( ) -> * mut SDL_mutex ; } extern "C" { pub fn SDL_LockMutex ( mutex : * mut SDL_mutex ) -> ctypes :: c_int ; } extern "C" { 
 /// Try to lock the mutex
///
/// \return 0, SDL_MUTEX_TIMEDOUT, or -1 on error 
 pub fn SDL_TryLockMutex ( mutex : * mut SDL_mutex ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_UnlockMutex ( mutex : * mut SDL_mutex ) -> ctypes :: c_int ; } extern "C" { 
 /// Destroy a mutex. 
 pub fn SDL_DestroyMutex ( mutex : * mut SDL_mutex ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_semaphore { _unused : [ u8 ; 0 ] , } pub type SDL_sem = SDL_semaphore ; extern "C" { 
 /// Create a semaphore, initialized with value, returns NULL on failure. 
 pub fn SDL_CreateSemaphore ( initial_value : Uint32 ) -> * mut SDL_sem ; } extern "C" { 
 /// Destroy a semaphore. 
 pub fn SDL_DestroySemaphore ( sem : * mut SDL_sem ) ; } extern "C" { 
 /// This function suspends the calling thread until the semaphore pointed
/// to by \c sem has a positive count. It then atomically decreases the
/// semaphore count. 
 pub fn SDL_SemWait ( sem : * mut SDL_sem ) -> ctypes :: c_int ; } extern "C" { 
 /// Non-blocking variant of SDL_SemWait().
///
/// \return 0 if the wait succeeds, ::SDL_MUTEX_TIMEDOUT if the wait would
/// block, and -1 on error. 
 pub fn SDL_SemTryWait ( sem : * mut SDL_sem ) -> ctypes :: c_int ; } extern "C" { 
 /// Variant of SDL_SemWait() with a timeout in milliseconds.
///
/// \return 0 if the wait succeeds, ::SDL_MUTEX_TIMEDOUT if the wait does not
/// succeed in the allotted time, and -1 on error.
///
/// \warning On some platforms this function is implemented by looping with a
/// delay of 1 ms, and so should be avoided if possible. 
 pub fn SDL_SemWaitTimeout ( sem : * mut SDL_sem , ms : Uint32 ) -> ctypes :: c_int ; } extern "C" { 
 /// Atomically increases the semaphore's count (not blocking).
///
/// \return 0, or -1 on error. 
 pub fn SDL_SemPost ( sem : * mut SDL_sem ) -> ctypes :: c_int ; } extern "C" { 
 /// Returns the current count of the semaphore. 
 pub fn SDL_SemValue ( sem : * mut SDL_sem ) -> Uint32 ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_cond { _unused : [ u8 ; 0 ] , } extern "C" { 
 /// Create a condition variable.
///
/// Typical use of condition variables:
///
/// Thread A:
/// SDL_LockMutex(lock);
/// while ( ! condition ) {
/// SDL_CondWait(cond, lock);
/// }
/// SDL_UnlockMutex(lock);
///
/// Thread B:
/// SDL_LockMutex(lock);
/// ...
/// condition = true;
/// ...
/// SDL_CondSignal(cond);
/// SDL_UnlockMutex(lock);
///
/// There is some discussion whether to signal the condition variable
/// with the mutex locked or not.  There is some potential performance
/// benefit to unlocking first on some platforms, but there are some
/// potential race conditions depending on how your code is structured.
///
/// In general it's safer to signal the condition variable while the
/// mutex is locked. 
 pub fn SDL_CreateCond ( ) -> * mut SDL_cond ; } extern "C" { 
 /// Destroy a condition variable. 
 pub fn SDL_DestroyCond ( cond : * mut SDL_cond ) ; } extern "C" { 
 /// Restart one of the threads that are waiting on the condition variable.
///
/// \return 0 or -1 on error. 
 pub fn SDL_CondSignal ( cond : * mut SDL_cond ) -> ctypes :: c_int ; } extern "C" { 
 /// Restart all threads that are waiting on the condition variable.
///
/// \return 0 or -1 on error. 
 pub fn SDL_CondBroadcast ( cond : * mut SDL_cond ) -> ctypes :: c_int ; } extern "C" { 
 /// Wait on the condition variable, unlocking the provided mutex.
///
/// \warning The mutex must be locked before entering this function!
///
/// The mutex is re-locked once the condition variable is signaled.
///
/// \return 0 when it is signaled, or -1 on error. 
 pub fn SDL_CondWait ( cond : * mut SDL_cond , mutex : * mut SDL_mutex ) -> ctypes :: c_int ; } extern "C" { 
 /// Waits for at most \c ms milliseconds, and returns 0 if the condition
/// variable is signaled, ::SDL_MUTEX_TIMEDOUT if the condition is not
/// signaled in the allotted time, and -1 on error.
///
/// \warning On some platforms this function is implemented by looping with a
/// delay of 1 ms, and so should be avoided if possible. 
 pub fn SDL_CondWaitTimeout ( cond : * mut SDL_cond , mutex : * mut SDL_mutex , ms : Uint32 ) -> ctypes :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_Thread { _unused : [ u8 ; 0 ] , } pub type SDL_threadID = ctypes :: c_ulong ; pub type SDL_TLSID = ctypes :: c_uint ; pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_LOW : SDL_ThreadPriority = 0 ; pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_NORMAL : SDL_ThreadPriority = 1 ; pub const SDL_ThreadPriority_SDL_THREAD_PRIORITY_HIGH : SDL_ThreadPriority = 2 ; 
 /// The SDL thread priority.
///
/// \note On many systems you require special privileges to set high priority. 
 pub type SDL_ThreadPriority = u32 ; 
 /// The function passed to SDL_CreateThread().
/// It is passed a void* user context parameter and returns an int. 
 pub type SDL_ThreadFunction = :: core :: option :: Option < unsafe extern "C" fn ( data : * mut ctypes :: c_void ) -> ctypes :: c_int > ; extern "C" { 
 /// Create a thread.
///
/// Thread naming is a little complicated: Most systems have very small
/// limits for the string length (Haiku has 32 bytes, Linux currently has 16,
/// Visual C++ 6.0 has nine!), and possibly other arbitrary rules. You'll
/// have to see what happens with your system's debugger. The name should be
/// UTF-8 (but using the naming limits of C identifiers is a better bet).
/// There are no requirements for thread naming conventions, so long as the
/// string is null-terminated UTF-8, but these guidelines are helpful in
/// choosing a name:
///
/// http://stackoverflow.com/questions/149932/naming-conventions-for-threads
///
/// If a system imposes requirements, SDL will try to munge the string for
/// it (truncate, etc), but the original string contents will be available
/// from SDL_GetThreadName(). 
 pub fn SDL_CreateThread ( fn_ : SDL_ThreadFunction , name : * const ctypes :: c_char , data : * mut ctypes :: c_void ) -> * mut SDL_Thread ; } extern "C" { 
 /// Get the thread name, as it was specified in SDL_CreateThread().
/// This function returns a pointer to a UTF-8 string that names the
/// specified thread, or NULL if it doesn't have a name. This is internal
/// memory, not to be free()'d by the caller, and remains valid until the
/// specified thread is cleaned up by SDL_WaitThread(). 
 pub fn SDL_GetThreadName ( thread : * mut SDL_Thread ) -> * const ctypes :: c_char ; } extern "C" { 
 /// Get the thread identifier for the current thread. 
 pub fn SDL_ThreadID ( ) -> SDL_threadID ; } extern "C" { 
 /// Get the thread identifier for the specified thread.
///
/// Equivalent to SDL_ThreadID() if the specified thread is NULL. 
 pub fn SDL_GetThreadID ( thread : * mut SDL_Thread ) -> SDL_threadID ; } extern "C" { 
 /// Set the priority for the current thread 
 pub fn SDL_SetThreadPriority ( priority : SDL_ThreadPriority ) -> ctypes :: c_int ; } extern "C" { 
 /// Wait for a thread to finish. Threads that haven't been detached will
/// remain (as a "zombie") until this function cleans them up. Not doing so
/// is a resource leak.
///
/// Once a thread has been cleaned up through this function, the SDL_Thread
/// that references it becomes invalid and should not be referenced again.
/// As such, only one thread may call SDL_WaitThread() on another.
///
/// The return code for the thread function is placed in the area
/// pointed to by \c status, if \c status is not NULL.
///
/// You may not wait on a thread that has been used in a call to
/// SDL_DetachThread(). Use either that function or this one, but not
/// both, or behavior is undefined.
///
/// It is safe to pass NULL to this function; it is a no-op. 
 pub fn SDL_WaitThread ( thread : * mut SDL_Thread , status : * mut ctypes :: c_int ) ; } extern "C" { 
 /// A thread may be "detached" to signify that it should not remain until
/// another thread has called SDL_WaitThread() on it. Detaching a thread
/// is useful for long-running threads that nothing needs to synchronize
/// with or further manage. When a detached thread is done, it simply
/// goes away.
///
/// There is no way to recover the return code of a detached thread. If you
/// need this, don't detach the thread and instead use SDL_WaitThread().
///
/// Once a thread is detached, you should usually assume the SDL_Thread isn't
/// safe to reference again, as it will become invalid immediately upon
/// the detached thread's exit, instead of remaining until someone has called
/// SDL_WaitThread() to finally clean it up. As such, don't detach the same
/// thread more than once.
///
/// If a thread has already exited when passed to SDL_DetachThread(), it will
/// stop waiting for a call to SDL_WaitThread() and clean up immediately.
/// It is not safe to detach a thread that might be used with SDL_WaitThread().
///
/// You may not call SDL_WaitThread() on a thread that has been detached.
/// Use either that function or this one, but not both, or behavior is
/// undefined.
///
/// It is safe to pass NULL to this function; it is a no-op. 
 pub fn SDL_DetachThread ( thread : * mut SDL_Thread ) ; } extern "C" { 
 /// \brief Create an identifier that is globally visible to all threads but refers to data that is thread-specific.
///
/// \return The newly created thread local storage identifier, or 0 on error
///
/// \code
/// static SDL_SpinLock tls_lock;
/// static SDL_TLSID thread_local_storage;
///
/// void SetMyThreadData(void *value)
/// {
/// if (!thread_local_storage) {
/// SDL_AtomicLock(&tls_lock);
/// if (!thread_local_storage) {
/// thread_local_storage = SDL_TLSCreate();
/// }
/// SDL_AtomicUnlock(&tls_lock);
/// }
/// SDL_TLSSet(thread_local_storage, value, 0);
/// }
///
/// void *GetMyThreadData(void)
/// {
/// return SDL_TLSGet(thread_local_storage);
/// }
/// \endcode
///
/// \sa SDL_TLSGet()
/// \sa SDL_TLSSet() 
 pub fn SDL_TLSCreate ( ) -> SDL_TLSID ; } extern "C" { 
 /// \brief Get the value associated with a thread local storage ID for the current thread.
///
/// \param id The thread local storage ID
///
/// \return The value associated with the ID for the current thread, or NULL if no value has been set.
///
/// \sa SDL_TLSCreate()
/// \sa SDL_TLSSet() 
 pub fn SDL_TLSGet ( id : SDL_TLSID ) -> * mut ctypes :: c_void ; } extern "C" { 
 /// \brief Set the value associated with a thread local storage ID for the current thread.
///
/// \param id The thread local storage ID
/// \param value The value to associate with the ID for the current thread
/// \param destructor A function called when the thread exits, to free the value.
///
/// \return 0 on success, -1 on error
///
/// \sa SDL_TLSCreate()
/// \sa SDL_TLSGet() 
 pub fn SDL_TLSSet ( id : SDL_TLSID , value : * const ctypes :: c_void , destructor : :: core :: option :: Option < unsafe extern "C" fn ( arg1 : * mut ctypes :: c_void ) > ) -> ctypes :: c_int ; } 
 /// This is the read/write operation structure -- very basic. 
 # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct SDL_RWops { 
 /// Return the size of the file in this rwops, or -1 if unknown 
 pub size : :: core :: option :: Option < unsafe extern "C" fn ( context : * mut SDL_RWops ) -> Sint64 > , 
 /// Seek to \c offset relative to \c whence, one of stdio's whence values:
    /// RW_SEEK_SET, RW_SEEK_CUR, RW_SEEK_END
    ///
    /// \return the final offset in the data stream, or -1 on error. 
 pub seek : :: core :: option :: Option < unsafe extern "C" fn ( context : * mut SDL_RWops , offset : Sint64 , whence : ctypes :: c_int ) -> Sint64 > , 
 /// Read up to \c maxnum objects each of size \c size from the data
    /// stream to the area pointed at by \c ptr.
    ///
    /// \return the number of objects read, or 0 at error or end of file. 
 pub read : :: core :: option :: Option < unsafe extern "C" fn ( context : * mut SDL_RWops , ptr : * mut ctypes :: c_void , size : usize , maxnum : usize ) -> usize > , 
 /// Write exactly \c num objects each of size \c size from the area
    /// pointed at by \c ptr to data stream.
    ///
    /// \return the number of objects written, or 0 at error or end of file. 
 pub write : :: core :: option :: Option < unsafe extern "C" fn ( context : * mut SDL_RWops , ptr : * const ctypes :: c_void , size : usize , num : usize ) -> usize > , 
 /// Close and free an allocated SDL_RWops structure.
    ///
    /// \return 0 if successful or -1 on write error when flushing data. 
 pub close : :: core :: option :: Option < unsafe extern "C" fn ( context : * mut SDL_RWops ) -> ctypes :: c_int > , pub type_ : Uint32 , pub hidden : SDL_RWops__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union SDL_RWops__bindgen_ty_1 { pub stdio : SDL_RWops__bindgen_ty_1__bindgen_ty_1 , pub mem : SDL_RWops__bindgen_ty_1__bindgen_ty_2 , pub unknown : SDL_RWops__bindgen_ty_1__bindgen_ty_3 , _bindgen_union_align : [ u64 ; 3usize ] , } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_1 { pub autoclose : SDL_bool , pub fp : * mut FILE , } # [ test ] fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_1 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_RWops__bindgen_ty_1__bindgen_ty_1 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_RWops__bindgen_ty_1__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . autoclose as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( autoclose ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1__bindgen_ty_1 > ( ) ) ) . fp as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( fp ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_2 { pub base : * mut Uint8 , pub here : * mut Uint8 , pub stop : * mut Uint8 , } # [ test ] fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_2 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_RWops__bindgen_ty_1__bindgen_ty_2 > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_2 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_RWops__bindgen_ty_1__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1__bindgen_ty_2 > ( ) ) ) . base as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! ( base ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1__bindgen_ty_2 > ( ) ) ) . here as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! ( here ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1__bindgen_ty_2 > ( ) ) ) . stop as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_2 ) , "::" , stringify ! ( stop ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_RWops__bindgen_ty_1__bindgen_ty_3 { pub data1 : * mut ctypes :: c_void , pub data2 : * mut ctypes :: c_void , } # [ test ] fn bindgen_test_layout_SDL_RWops__bindgen_ty_1__bindgen_ty_3 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_RWops__bindgen_ty_1__bindgen_ty_3 > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_3 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_RWops__bindgen_ty_1__bindgen_ty_3 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_3 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1__bindgen_ty_3 > ( ) ) ) . data1 as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! ( data1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1__bindgen_ty_3 > ( ) ) ) . data2 as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1__bindgen_ty_3 ) , "::" , stringify ! ( data2 ) ) ) ; } # [ test ] fn bindgen_test_layout_SDL_RWops__bindgen_ty_1 ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_RWops__bindgen_ty_1 > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( SDL_RWops__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_RWops__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_RWops__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1 > ( ) ) ) . stdio as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1 ) , "::" , stringify ! ( stdio ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1 > ( ) ) ) . mem as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1 ) , "::" , stringify ! ( mem ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops__bindgen_ty_1 > ( ) ) ) . unknown as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops__bindgen_ty_1 ) , "::" , stringify ! ( unknown ) ) ) ; } # [ test ] fn bindgen_test_layout_SDL_RWops ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_RWops > ( ) , 72usize , concat ! ( "Size of: " , stringify ! ( SDL_RWops ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_RWops > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_RWops ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops > ( ) ) ) . size as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops ) , "::" , stringify ! ( size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops > ( ) ) ) . seek as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops ) , "::" , stringify ! ( seek ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops > ( ) ) ) . read as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops ) , "::" , stringify ! ( read ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops > ( ) ) ) . write as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops ) , "::" , stringify ! ( write ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops > ( ) ) ) . close as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops ) , "::" , stringify ! ( close ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops > ( ) ) ) . type_ as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops ) , "::" , stringify ! ( type_ ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_RWops > ( ) ) ) . hidden as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( SDL_RWops ) , "::" , stringify ! ( hidden ) ) ) ; } extern "C" { pub fn SDL_RWFromFile ( file : * const ctypes :: c_char , mode : * const ctypes :: c_char ) -> * mut SDL_RWops ; } extern "C" { pub fn SDL_RWFromFP ( fp : * mut FILE , autoclose : SDL_bool ) -> * mut SDL_RWops ; } extern "C" { pub fn SDL_RWFromMem ( mem : * mut ctypes :: c_void , size : ctypes :: c_int ) -> * mut SDL_RWops ; } extern "C" { pub fn SDL_RWFromConstMem ( mem : * const ctypes :: c_void , size : ctypes :: c_int ) -> * mut SDL_RWops ; } extern "C" { pub fn SDL_AllocRW ( ) -> * mut SDL_RWops ; } extern "C" { pub fn SDL_FreeRW ( area : * mut SDL_RWops ) ; } extern "C" { 
 /// Load all the data from an SDL data stream.
///
/// The data is allocated with a zero byte at the end (null terminated)
///
/// If \c datasize is not NULL, it is filled with the size of the data read.
///
/// If \c freesrc is non-zero, the stream will be closed after being read.
///
/// The data should be freed with SDL_free().
///
/// \return the data, or NULL if there was an error. 
 pub fn SDL_LoadFile_RW ( src : * mut SDL_RWops , datasize : * mut usize , freesrc : ctypes :: c_int ) -> * mut ctypes :: c_void ; } extern "C" { pub fn SDL_ReadU8 ( src : * mut SDL_RWops ) -> Uint8 ; } extern "C" { pub fn SDL_ReadLE16 ( src : * mut SDL_RWops ) -> Uint16 ; } extern "C" { pub fn SDL_ReadBE16 ( src : * mut SDL_RWops ) -> Uint16 ; } extern "C" { pub fn SDL_ReadLE32 ( src : * mut SDL_RWops ) -> Uint32 ; } extern "C" { pub fn SDL_ReadBE32 ( src : * mut SDL_RWops ) -> Uint32 ; } extern "C" { pub fn SDL_ReadLE64 ( src : * mut SDL_RWops ) -> Uint64 ; } extern "C" { pub fn SDL_ReadBE64 ( src : * mut SDL_RWops ) -> Uint64 ; } extern "C" { pub fn SDL_WriteU8 ( dst : * mut SDL_RWops , value : Uint8 ) -> usize ; } extern "C" { pub fn SDL_WriteLE16 ( dst : * mut SDL_RWops , value : Uint16 ) -> usize ; } extern "C" { pub fn SDL_WriteBE16 ( dst : * mut SDL_RWops , value : Uint16 ) -> usize ; } extern "C" { pub fn SDL_WriteLE32 ( dst : * mut SDL_RWops , value : Uint32 ) -> usize ; } extern "C" { pub fn SDL_WriteBE32 ( dst : * mut SDL_RWops , value : Uint32 ) -> usize ; } extern "C" { pub fn SDL_WriteLE64 ( dst : * mut SDL_RWops , value : Uint64 ) -> usize ; } extern "C" { pub fn SDL_WriteBE64 ( dst : * mut SDL_RWops , value : Uint64 ) -> usize ; } 
 /// \brief Audio format flags.
///
/// These are what the 16 bits in SDL_AudioFormat currently mean...
/// (Unspecified bits are always zero).
///
/// \verbatim
/// ++-----------------------sample is signed if set
/// ||
/// ||       ++-----------sample is bigendian if set
/// ||       ||
/// ||       ||          ++---sample is float if set
/// ||       ||          ||
/// ||       ||          || +---sample bit size---+
/// ||       ||          || |                     |
/// 15 14 13 12 11 10 09 08 07 06 05 04 03 02 01 00
/// \endverbatim
///
/// There are macros in SDL 2.0 and later to query these bits. 
 pub type SDL_AudioFormat = Uint16 ; 
 /// This function is called when the audio device needs more data.
///
/// \param userdata An application-specific parameter saved in
/// the SDL_AudioSpec structure
/// \param stream A pointer to the audio data buffer.
/// \param len    The length of that buffer in bytes.
///
/// Once the callback returns, the buffer will no longer be valid.
/// Stereo samples are stored in a LRLRLR ordering.
///
/// You can choose to avoid callbacks and use SDL_QueueAudio() instead, if
/// you like. Just open your audio device with a NULL callback. 
 pub type SDL_AudioCallback = :: core :: option :: Option < unsafe extern "C" fn ( userdata : * mut ctypes :: c_void , stream : * mut Uint8 , len : ctypes :: c_int ) > ; 
 /// The calculated values in this structure are calculated by SDL_OpenAudio().
///
/// For multi-channel audio, the default SDL channel mapping is:
/// 2:  FL FR                       (stereo)
/// 3:  FL FR LFE                   (2.1 surround)
/// 4:  FL FR BL BR                 (quad)
/// 5:  FL FR FC BL BR              (quad + center)
/// 6:  FL FR FC LFE SL SR          (5.1 surround - last two can also be BL BR)
/// 7:  FL FR FC LFE BC SL SR       (6.1 surround)
/// 8:  FL FR FC LFE BL BR SL SR    (7.1 surround) 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_AudioSpec { 
 /// < DSP frequency -- samples per second 
 pub freq : ctypes :: c_int , 
 /// < Audio data format 
 pub format : SDL_AudioFormat , 
 /// < Number of channels: 1 mono, 2 stereo 
 pub channels : Uint8 , 
 /// < Audio buffer silence value (calculated) 
 pub silence : Uint8 , 
 /// < Audio buffer size in sample FRAMES (total samples divided by channel count) 
 pub samples : Uint16 , 
 /// < Necessary for some compile environments 
 pub padding : Uint16 , 
 /// < Audio buffer size in bytes (calculated) 
 pub size : Uint32 , 
 /// < Callback that feeds the audio device (NULL to use SDL_QueueAudio()). 
 pub callback : SDL_AudioCallback , 
 /// < Userdata passed to callback (ignored for NULL callbacks). 
 pub userdata : * mut ctypes :: c_void , } # [ test ] fn bindgen_test_layout_SDL_AudioSpec ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_AudioSpec > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( SDL_AudioSpec ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_AudioSpec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_AudioSpec ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . freq as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( freq ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . format as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( format ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . channels as * const _ as usize } , 6usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( channels ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . silence as * const _ as usize } , 7usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( silence ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . samples as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( samples ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . padding as * const _ as usize } , 10usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( padding ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . size as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( size ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . callback as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( callback ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioSpec > ( ) ) ) . userdata as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioSpec ) , "::" , stringify ! ( userdata ) ) ) ; } pub type SDL_AudioFilter = :: core :: option :: Option < unsafe extern "C" fn ( cvt : * mut SDL_AudioCVT , format : SDL_AudioFormat ) > ; # [ repr ( C , packed ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_AudioCVT { 
 /// < Set to 1 if conversion possible 
 pub needed : ctypes :: c_int , 
 /// < Source audio format 
 pub src_format : SDL_AudioFormat , 
 /// < Target audio format 
 pub dst_format : SDL_AudioFormat , 
 /// < Rate conversion increment 
 pub rate_incr : f64 , 
 /// < Buffer to hold entire audio data 
 pub buf : * mut Uint8 , 
 /// < Length of original audio buffer 
 pub len : ctypes :: c_int , 
 /// < Length of converted audio buffer 
 pub len_cvt : ctypes :: c_int , 
 /// < buffer must be len*len_mult big 
 pub len_mult : ctypes :: c_int , 
 /// < Given len, final size is len*len_ratio 
 pub len_ratio : f64 , 
 /// < NULL-terminated list of filter functions 
 pub filters : [ SDL_AudioFilter ; 10usize ] , 
 /// < Current audio conversion function 
 pub filter_index : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_SDL_AudioCVT ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_AudioCVT > ( ) , 128usize , concat ! ( "Size of: " , stringify ! ( SDL_AudioCVT ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_AudioCVT > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( SDL_AudioCVT ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . needed as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( needed ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . src_format as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( src_format ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . dst_format as * const _ as usize } , 6usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( dst_format ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . rate_incr as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( rate_incr ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . buf as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . len as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( len ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . len_cvt as * const _ as usize } , 28usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( len_cvt ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . len_mult as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( len_mult ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . len_ratio as * const _ as usize } , 36usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( len_ratio ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . filters as * const _ as usize } , 44usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( filters ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_AudioCVT > ( ) ) ) . filter_index as * const _ as usize } , 124usize , concat ! ( "Offset of field: " , stringify ! ( SDL_AudioCVT ) , "::" , stringify ! ( filter_index ) ) ) ; } extern "C" { pub fn SDL_GetNumAudioDrivers ( ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_GetAudioDriver ( index : ctypes :: c_int ) -> * const ctypes :: c_char ; } extern "C" { pub fn SDL_AudioInit ( driver_name : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_AudioQuit ( ) ; } extern "C" { 
 /// This function returns the name of the current audio driver, or NULL
/// if no driver has been initialized. 
 pub fn SDL_GetCurrentAudioDriver ( ) -> * const ctypes :: c_char ; } extern "C" { 
 /// This function opens the audio device with the desired parameters, and
/// returns 0 if successful, placing the actual hardware parameters in the
/// structure pointed to by \c obtained.  If \c obtained is NULL, the audio
/// data passed to the callback function will be guaranteed to be in the
/// requested format, and will be automatically converted to the hardware
/// audio format if necessary.  This function returns -1 if it failed
/// to open the audio device, or couldn't set up the audio thread.
///
/// When filling in the desired audio spec structure,
/// - \c desired->freq should be the desired audio frequency in samples-per-
/// second.
/// - \c desired->format should be the desired audio format.
/// - \c desired->samples is the desired size of the audio buffer, in
/// samples.  This number should be a power of two, and may be adjusted by
/// the audio driver to a value more suitable for the hardware.  Good values
/// seem to range between 512 and 8096 inclusive, depending on the
/// application and CPU speed.  Smaller values yield faster response time,
/// but can lead to underflow if the application is doing heavy processing
/// and cannot fill the audio buffer in time.  A stereo sample consists of
/// both right and left channels in LR ordering.
/// Note that the number of samples is directly related to time by the
/// following formula:  \code ms = (samples*1000)/freq \endcode
/// - \c desired->size is the size in bytes of the audio buffer, and is
/// calculated by SDL_OpenAudio().
/// - \c desired->silence is the value used to set the buffer to silence,
/// and is calculated by SDL_OpenAudio().
/// - \c desired->callback should be set to a function that will be called
/// when the audio device is ready for more data.  It is passed a pointer
/// to the audio buffer, and the length in bytes of the audio buffer.
/// This function usually runs in a separate thread, and so you should
/// protect data structures that it accesses by calling SDL_LockAudio()
/// and SDL_UnlockAudio() in your code. Alternately, you may pass a NULL
/// pointer here, and call SDL_QueueAudio() with some frequency, to queue
/// more audio samples to be played (or for capture devices, call
/// SDL_DequeueAudio() with some frequency, to obtain audio samples).
/// - \c desired->userdata is passed as the first parameter to your callback
/// function. If you passed a NULL callback, this value is ignored.
///
/// The audio device starts out playing silence when it's opened, and should
/// be enabled for playing by calling \c SDL_PauseAudio(0) when you are ready
/// for your audio callback function to be called.  Since the audio driver
/// may modify the requested size of the audio buffer, you should allocate
/// any local mixing buffers after you open the audio device. 
 pub fn SDL_OpenAudio ( desired : * mut SDL_AudioSpec , obtained : * mut SDL_AudioSpec ) -> ctypes :: c_int ; } 
 /// SDL Audio Device IDs.
///
/// A successful call to SDL_OpenAudio() is always device id 1, and legacy
/// SDL audio APIs assume you want this device ID. SDL_OpenAudioDevice() calls
/// always returns devices >= 2 on success. The legacy calls are good both
/// for backwards compatibility and when you don't care about multiple,
/// specific, or capture devices. 
 pub type SDL_AudioDeviceID = Uint32 ; extern "C" { 
 /// Get the number of available devices exposed by the current driver.
/// Only valid after a successfully initializing the audio subsystem.
/// Returns -1 if an explicit list of devices can't be determined; this is
/// not an error. For example, if SDL is set up to talk to a remote audio
/// server, it can't list every one available on the Internet, but it will
/// still allow a specific host to be specified to SDL_OpenAudioDevice().
///
/// In many common cases, when this function returns a value <= 0, it can still
/// successfully open the default device (NULL for first argument of
/// SDL_OpenAudioDevice()). 
 pub fn SDL_GetNumAudioDevices ( iscapture : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// Get the human-readable name of a specific audio device.
/// Must be a value between 0 and (number of audio devices-1).
/// Only valid after a successfully initializing the audio subsystem.
/// The values returned by this function reflect the latest call to
/// SDL_GetNumAudioDevices(); recall that function to redetect available
/// hardware.
///
/// The string returned by this function is UTF-8 encoded, read-only, and
/// managed internally. You are not to free it. If you need to keep the
/// string for any length of time, you should make your own copy of it, as it
/// will be invalid next time any of several other SDL functions is called. 
 pub fn SDL_GetAudioDeviceName ( index : ctypes :: c_int , iscapture : ctypes :: c_int ) -> * const ctypes :: c_char ; } extern "C" { 
 /// Open a specific audio device. Passing in a device name of NULL requests
/// the most reasonable default (and is equivalent to calling SDL_OpenAudio()).
///
/// The device name is a UTF-8 string reported by SDL_GetAudioDeviceName(), but
/// some drivers allow arbitrary and driver-specific strings, such as a
/// hostname/IP address for a remote audio server, or a filename in the
/// diskaudio driver.
///
/// \return 0 on error, a valid device ID that is >= 2 on success.
///
/// SDL_OpenAudio(), unlike this function, always acts on device ID 1. 
 pub fn SDL_OpenAudioDevice ( device : * const ctypes :: c_char , iscapture : ctypes :: c_int , desired : * const SDL_AudioSpec , obtained : * mut SDL_AudioSpec , allowed_changes : ctypes :: c_int ) -> SDL_AudioDeviceID ; } pub const SDL_AudioStatus_SDL_AUDIO_STOPPED : SDL_AudioStatus = 0 ; pub const SDL_AudioStatus_SDL_AUDIO_PLAYING : SDL_AudioStatus = 1 ; pub const SDL_AudioStatus_SDL_AUDIO_PAUSED : SDL_AudioStatus = 2 ; pub type SDL_AudioStatus = u32 ; extern "C" { pub fn SDL_GetAudioStatus ( ) -> SDL_AudioStatus ; } extern "C" { pub fn SDL_GetAudioDeviceStatus ( dev : SDL_AudioDeviceID ) -> SDL_AudioStatus ; } extern "C" { pub fn SDL_PauseAudio ( pause_on : ctypes :: c_int ) ; } extern "C" { pub fn SDL_PauseAudioDevice ( dev : SDL_AudioDeviceID , pause_on : ctypes :: c_int ) ; } extern "C" { 
 /// This function loads a WAVE from the data source, automatically freeing
/// that source if \c freesrc is non-zero.  For example, to load a WAVE file,
/// you could do:
/// \code
/// SDL_LoadWAV_RW(SDL_RWFromFile("sample.wav", "rb"), 1, ...);
/// \endcode
///
/// If this function succeeds, it returns the given SDL_AudioSpec,
/// filled with the audio data format of the wave data, and sets
/// \c *audio_buf to a malloc()'d buffer containing the audio data,
/// and sets \c *audio_len to the length of that audio buffer, in bytes.
/// You need to free the audio buffer with SDL_FreeWAV() when you are
/// done with it.
///
/// This function returns NULL and sets the SDL error message if the
/// wave file cannot be opened, uses an unknown data format, or is
/// corrupt.  Currently raw and MS-ADPCM WAVE files are supported. 
 pub fn SDL_LoadWAV_RW ( src : * mut SDL_RWops , freesrc : ctypes :: c_int , spec : * mut SDL_AudioSpec , audio_buf : * mut * mut Uint8 , audio_len : * mut Uint32 ) -> * mut SDL_AudioSpec ; } extern "C" { 
 /// This function frees data previously allocated with SDL_LoadWAV_RW() 
 pub fn SDL_FreeWAV ( audio_buf : * mut Uint8 ) ; } extern "C" { 
 /// This function takes a source format and rate and a destination format
/// and rate, and initializes the \c cvt structure with information needed
/// by SDL_ConvertAudio() to convert a buffer of audio data from one format
/// to the other. An unsupported format causes an error and -1 will be returned.
///
/// \return 0 if no conversion is needed, 1 if the audio filter is set up,
/// or -1 on error. 
 pub fn SDL_BuildAudioCVT ( cvt : * mut SDL_AudioCVT , src_format : SDL_AudioFormat , src_channels : Uint8 , src_rate : ctypes :: c_int , dst_format : SDL_AudioFormat , dst_channels : Uint8 , dst_rate : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// Once you have initialized the \c cvt structure using SDL_BuildAudioCVT(),
/// created an audio buffer \c cvt->buf, and filled it with \c cvt->len bytes of
/// audio data in the source format, this function will convert it in-place
/// to the desired format.
///
/// The data conversion may expand the size of the audio data, so the buffer
/// \c cvt->buf should be allocated after the \c cvt structure is initialized by
/// SDL_BuildAudioCVT(), and should be \c cvt->len*cvt->len_mult bytes long.
///
/// \return 0 on success or -1 if \c cvt->buf is NULL. 
 pub fn SDL_ConvertAudio ( cvt : * mut SDL_AudioCVT ) -> ctypes :: c_int ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _SDL_AudioStream { _unused : [ u8 ; 0 ] , } pub type SDL_AudioStream = _SDL_AudioStream ; extern "C" { 
 /// Create a new audio stream
///
/// \param src_format The format of the source audio
/// \param src_channels The number of channels of the source audio
/// \param src_rate The sampling rate of the source audio
/// \param dst_format The format of the desired audio output
/// \param dst_channels The number of channels of the desired audio output
/// \param dst_rate The sampling rate of the desired audio output
/// \return 0 on success, or -1 on error.
///
/// \sa SDL_AudioStreamPut
/// \sa SDL_AudioStreamGet
/// \sa SDL_AudioStreamAvailable
/// \sa SDL_AudioStreamFlush
/// \sa SDL_AudioStreamClear
/// \sa SDL_FreeAudioStream 
 pub fn SDL_NewAudioStream ( src_format : SDL_AudioFormat , src_channels : Uint8 , src_rate : ctypes :: c_int , dst_format : SDL_AudioFormat , dst_channels : Uint8 , dst_rate : ctypes :: c_int ) -> * mut SDL_AudioStream ; } extern "C" { 
 /// Add data to be converted/resampled to the stream
///
/// \param stream The stream the audio data is being added to
/// \param buf A pointer to the audio data to add
/// \param len The number of bytes to write to the stream
/// \return 0 on success, or -1 on error.
///
/// \sa SDL_NewAudioStream
/// \sa SDL_AudioStreamGet
/// \sa SDL_AudioStreamAvailable
/// \sa SDL_AudioStreamFlush
/// \sa SDL_AudioStreamClear
/// \sa SDL_FreeAudioStream 
 pub fn SDL_AudioStreamPut ( stream : * mut SDL_AudioStream , buf : * const ctypes :: c_void , len : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// Get converted/resampled data from the stream
///
/// \param stream The stream the audio is being requested from
/// \param buf A buffer to fill with audio data
/// \param len The maximum number of bytes to fill
/// \return The number of bytes read from the stream, or -1 on error
///
/// \sa SDL_NewAudioStream
/// \sa SDL_AudioStreamPut
/// \sa SDL_AudioStreamAvailable
/// \sa SDL_AudioStreamFlush
/// \sa SDL_AudioStreamClear
/// \sa SDL_FreeAudioStream 
 pub fn SDL_AudioStreamGet ( stream : * mut SDL_AudioStream , buf : * mut ctypes :: c_void , len : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// Get the number of converted/resampled bytes available. The stream may be
/// buffering data behind the scenes until it has enough to resample
/// correctly, so this number might be lower than what you expect, or even
/// be zero. Add more data or flush the stream if you need the data now.
///
/// \sa SDL_NewAudioStream
/// \sa SDL_AudioStreamPut
/// \sa SDL_AudioStreamGet
/// \sa SDL_AudioStreamFlush
/// \sa SDL_AudioStreamClear
/// \sa SDL_FreeAudioStream 
 pub fn SDL_AudioStreamAvailable ( stream : * mut SDL_AudioStream ) -> ctypes :: c_int ; } extern "C" { 
 /// Tell the stream that you're done sending data, and anything being buffered
/// should be converted/resampled and made available immediately.
///
/// It is legal to add more data to a stream after flushing, but there will
/// be audio gaps in the output. Generally this is intended to signal the
/// end of input, so the complete output becomes available.
///
/// \sa SDL_NewAudioStream
/// \sa SDL_AudioStreamPut
/// \sa SDL_AudioStreamGet
/// \sa SDL_AudioStreamAvailable
/// \sa SDL_AudioStreamClear
/// \sa SDL_FreeAudioStream 
 pub fn SDL_AudioStreamFlush ( stream : * mut SDL_AudioStream ) -> ctypes :: c_int ; } extern "C" { 
 /// Clear any pending data in the stream without converting it
///
/// \sa SDL_NewAudioStream
/// \sa SDL_AudioStreamPut
/// \sa SDL_AudioStreamGet
/// \sa SDL_AudioStreamAvailable
/// \sa SDL_AudioStreamFlush
/// \sa SDL_FreeAudioStream 
 pub fn SDL_AudioStreamClear ( stream : * mut SDL_AudioStream ) ; } extern "C" { 
 /// Free an audio stream
///
/// \sa SDL_NewAudioStream
/// \sa SDL_AudioStreamPut
/// \sa SDL_AudioStreamGet
/// \sa SDL_AudioStreamAvailable
/// \sa SDL_AudioStreamFlush
/// \sa SDL_AudioStreamClear 
 pub fn SDL_FreeAudioStream ( stream : * mut SDL_AudioStream ) ; } extern "C" { 
 /// This takes two audio buffers of the playing audio format and mixes
/// them, performing addition, volume adjustment, and overflow clipping.
/// The volume ranges from 0 - 128, and should be set to ::SDL_MIX_MAXVOLUME
/// for full audio volume.  Note this does not change hardware volume.
/// This is provided for convenience -- you can mix your own audio data. 
 pub fn SDL_MixAudio ( dst : * mut Uint8 , src : * const Uint8 , len : Uint32 , volume : ctypes :: c_int ) ; } extern "C" { 
 /// This works like SDL_MixAudio(), but you specify the audio format instead of
/// using the format of audio device 1. Thus it can be used when no audio
/// device is open at all. 
 pub fn SDL_MixAudioFormat ( dst : * mut Uint8 , src : * const Uint8 , format : SDL_AudioFormat , len : Uint32 , volume : ctypes :: c_int ) ; } extern "C" { 
 /// Queue more audio on non-callback devices.
///
/// (If you are looking to retrieve queued audio from a non-callback capture
/// device, you want SDL_DequeueAudio() instead. This will return -1 to
/// signify an error if you use it with capture devices.)
///
/// SDL offers two ways to feed audio to the device: you can either supply a
/// callback that SDL triggers with some frequency to obtain more audio
/// (pull method), or you can supply no callback, and then SDL will expect
/// you to supply data at regular intervals (push method) with this function.
///
/// There are no limits on the amount of data you can queue, short of
/// exhaustion of address space. Queued data will drain to the device as
/// necessary without further intervention from you. If the device needs
/// audio but there is not enough queued, it will play silence to make up
/// the difference. This means you will have skips in your audio playback
/// if you aren't routinely queueing sufficient data.
///
/// This function copies the supplied data, so you are safe to free it when
/// the function returns. This function is thread-safe, but queueing to the
/// same device from two threads at once does not promise which buffer will
/// be queued first.
///
/// You may not queue audio on a device that is using an application-supplied
/// callback; doing so returns an error. You have to use the audio callback
/// or queue audio with this function, but not both.
///
/// You should not call SDL_LockAudio() on the device before queueing; SDL
/// handles locking internally for this function.
///
/// \param dev The device ID to which we will queue audio.
/// \param data The data to queue to the device for later playback.
/// \param len The number of bytes (not samples!) to which (data) points.
/// \return 0 on success, or -1 on error.
///
/// \sa SDL_GetQueuedAudioSize
/// \sa SDL_ClearQueuedAudio 
 pub fn SDL_QueueAudio ( dev : SDL_AudioDeviceID , data : * const ctypes :: c_void , len : Uint32 ) -> ctypes :: c_int ; } extern "C" { 
 /// Dequeue more audio on non-callback devices.
///
/// (If you are looking to queue audio for output on a non-callback playback
/// device, you want SDL_QueueAudio() instead. This will always return 0
/// if you use it with playback devices.)
///
/// SDL offers two ways to retrieve audio from a capture device: you can
/// either supply a callback that SDL triggers with some frequency as the
/// device records more audio data, (push method), or you can supply no
/// callback, and then SDL will expect you to retrieve data at regular
/// intervals (pull method) with this function.
///
/// There are no limits on the amount of data you can queue, short of
/// exhaustion of address space. Data from the device will keep queuing as
/// necessary without further intervention from you. This means you will
/// eventually run out of memory if you aren't routinely dequeueing data.
///
/// Capture devices will not queue data when paused; if you are expecting
/// to not need captured audio for some length of time, use
/// SDL_PauseAudioDevice() to stop the capture device from queueing more
/// data. This can be useful during, say, level loading times. When
/// unpaused, capture devices will start queueing data from that point,
/// having flushed any capturable data available while paused.
///
/// This function is thread-safe, but dequeueing from the same device from
/// two threads at once does not promise which thread will dequeued data
/// first.
///
/// You may not dequeue audio from a device that is using an
/// application-supplied callback; doing so returns an error. You have to use
/// the audio callback, or dequeue audio with this function, but not both.
///
/// You should not call SDL_LockAudio() on the device before queueing; SDL
/// handles locking internally for this function.
///
/// \param dev The device ID from which we will dequeue audio.
/// \param data A pointer into where audio data should be copied.
/// \param len The number of bytes (not samples!) to which (data) points.
/// \return number of bytes dequeued, which could be less than requested.
///
/// \sa SDL_GetQueuedAudioSize
/// \sa SDL_ClearQueuedAudio 
 pub fn SDL_DequeueAudio ( dev : SDL_AudioDeviceID , data : * mut ctypes :: c_void , len : Uint32 ) -> Uint32 ; } extern "C" { 
 /// Get the number of bytes of still-queued audio.
///
/// For playback device:
///
/// This is the number of bytes that have been queued for playback with
/// SDL_QueueAudio(), but have not yet been sent to the hardware. This
/// number may shrink at any time, so this only informs of pending data.
///
/// Once we've sent it to the hardware, this function can not decide the
/// exact byte boundary of what has been played. It's possible that we just
/// gave the hardware several kilobytes right before you called this
/// function, but it hasn't played any of it yet, or maybe half of it, etc.
///
/// For capture devices:
///
/// This is the number of bytes that have been captured by the device and
/// are waiting for you to dequeue. This number may grow at any time, so
/// this only informs of the lower-bound of available data.
///
/// You may not queue audio on a device that is using an application-supplied
/// callback; calling this function on such a device always returns 0.
/// You have to queue audio with SDL_QueueAudio()/SDL_DequeueAudio(), or use
/// the audio callback, but not both.
///
/// You should not call SDL_LockAudio() on the device before querying; SDL
/// handles locking internally for this function.
///
/// \param dev The device ID of which we will query queued audio size.
/// \return Number of bytes (not samples!) of queued audio.
///
/// \sa SDL_QueueAudio
/// \sa SDL_ClearQueuedAudio 
 pub fn SDL_GetQueuedAudioSize ( dev : SDL_AudioDeviceID ) -> Uint32 ; } extern "C" { 
 /// Drop any queued audio data. For playback devices, this is any queued data
/// still waiting to be submitted to the hardware. For capture devices, this
/// is any data that was queued by the device that hasn't yet been dequeued by
/// the application.
///
/// Immediately after this call, SDL_GetQueuedAudioSize() will return 0. For
/// playback devices, the hardware will start playing silence if more audio
/// isn't queued. Unpaused capture devices will start filling the queue again
/// as soon as they have more data available (which, depending on the state
/// of the hardware and the thread, could be before this function call
/// returns!).
///
/// This will not prevent playback of queued audio that's already been sent
/// to the hardware, as we can not undo that, so expect there to be some
/// fraction of a second of audio that might still be heard. This can be
/// useful if you want to, say, drop any pending music during a level change
/// in your game.
///
/// You may not queue audio on a device that is using an application-supplied
/// callback; calling this function on such a device is always a no-op.
/// You have to queue audio with SDL_QueueAudio()/SDL_DequeueAudio(), or use
/// the audio callback, but not both.
///
/// You should not call SDL_LockAudio() on the device before clearing the
/// queue; SDL handles locking internally for this function.
///
/// This function always succeeds and thus returns void.
///
/// \param dev The device ID of which to clear the audio queue.
///
/// \sa SDL_QueueAudio
/// \sa SDL_GetQueuedAudioSize 
 pub fn SDL_ClearQueuedAudio ( dev : SDL_AudioDeviceID ) ; } extern "C" { pub fn SDL_LockAudio ( ) ; } extern "C" { pub fn SDL_LockAudioDevice ( dev : SDL_AudioDeviceID ) ; } extern "C" { pub fn SDL_UnlockAudio ( ) ; } extern "C" { pub fn SDL_UnlockAudioDevice ( dev : SDL_AudioDeviceID ) ; } extern "C" { 
 /// This function shuts down audio processing and closes the audio device. 
 pub fn SDL_CloseAudio ( ) ; } extern "C" { pub fn SDL_CloseAudioDevice ( dev : SDL_AudioDeviceID ) ; } extern "C" { 
 /// \brief Put UTF-8 text into the clipboard
///
/// \sa SDL_GetClipboardText() 
 pub fn SDL_SetClipboardText ( text : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get UTF-8 text from the clipboard, which must be freed with SDL_free()
///
/// \sa SDL_SetClipboardText() 
 pub fn SDL_GetClipboardText ( ) -> * mut ctypes :: c_char ; } extern "C" { 
 /// \brief Returns a flag indicating whether the clipboard exists and contains a text string that is non-empty
///
/// \sa SDL_GetClipboardText() 
 pub fn SDL_HasClipboardText ( ) -> SDL_bool ; } pub type __m64 = [ ctypes :: c_longlong ; 1usize ] ; pub type __v1di = [ ctypes :: c_longlong ; 1usize ] ; pub type __v2si = [ ctypes :: c_int ; 2usize ] ; pub type __v4hi = [ ctypes :: c_short ; 4usize ] ; pub type __v8qi = [ ctypes :: c_char ; 8usize ] ; pub type __v4si = [ ctypes :: c_int ; 4usize ] ; pub type __v4sf = [ f32 ; 4usize ] ; pub type __m128 = [ f32 ; 4usize ] ; pub type __v4su = [ ctypes :: c_uint ; 4usize ] ; extern "C" { pub fn _mm_sfence ( ) ; } extern "C" { pub fn _mm_getcsr ( ) -> ctypes :: c_uint ; } extern "C" { pub fn _mm_setcsr ( __i : ctypes :: c_uint ) ; } pub type __m128d = [ f64 ; 2usize ] ; pub type __m128i = [ ctypes :: c_longlong ; 2usize ] ; pub type __v2df = [ f64 ; 2usize ] ; pub type __v2di = [ ctypes :: c_longlong ; 2usize ] ; pub type __v8hi = [ ctypes :: c_short ; 8usize ] ; pub type __v16qi = [ ctypes :: c_char ; 16usize ] ; pub type __v2du = [ ctypes :: c_ulonglong ; 2usize ] ; pub type __v8hu = [ ctypes :: c_ushort ; 8usize ] ; pub type __v16qu = [ ctypes :: c_uchar ; 16usize ] ; pub type __v16qs = [ ctypes :: c_schar ; 16usize ] ; extern "C" { pub fn _mm_clflush ( __p : * const ctypes :: c_void ) ; } extern "C" { pub fn _mm_lfence ( ) ; } extern "C" { pub fn _mm_mfence ( ) ; } extern "C" { pub fn _mm_pause ( ) ; } extern "C" { 
 /// This function returns the number of CPU cores available. 
 pub fn SDL_GetCPUCount ( ) -> ctypes :: c_int ; } extern "C" { 
 /// This function returns the L1 cache line size of the CPU
///
/// This is useful for determining multi-threaded structure padding
/// or SIMD prefetch sizes. 
 pub fn SDL_GetCPUCacheLineSize ( ) -> ctypes :: c_int ; } extern "C" { 
 /// This function returns true if the CPU has the RDTSC instruction. 
 pub fn SDL_HasRDTSC ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has AltiVec features. 
 pub fn SDL_HasAltiVec ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has MMX features. 
 pub fn SDL_HasMMX ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has 3DNow! features. 
 pub fn SDL_Has3DNow ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has SSE features. 
 pub fn SDL_HasSSE ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has SSE2 features. 
 pub fn SDL_HasSSE2 ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has SSE3 features. 
 pub fn SDL_HasSSE3 ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has SSE4.1 features. 
 pub fn SDL_HasSSE41 ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has SSE4.2 features. 
 pub fn SDL_HasSSE42 ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has AVX features. 
 pub fn SDL_HasAVX ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has AVX2 features. 
 pub fn SDL_HasAVX2 ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns true if the CPU has NEON (ARM SIMD) features. 
 pub fn SDL_HasNEON ( ) -> SDL_bool ; } extern "C" { 
 /// This function returns the amount of RAM configured in the system, in MB. 
 pub fn SDL_GetSystemRAM ( ) -> ctypes :: c_int ; } pub const SDL_PIXELTYPE_UNKNOWN : _bindgen_ty_1 = 0 ; pub const SDL_PIXELTYPE_INDEX1 : _bindgen_ty_1 = 1 ; pub const SDL_PIXELTYPE_INDEX4 : _bindgen_ty_1 = 2 ; pub const SDL_PIXELTYPE_INDEX8 : _bindgen_ty_1 = 3 ; pub const SDL_PIXELTYPE_PACKED8 : _bindgen_ty_1 = 4 ; pub const SDL_PIXELTYPE_PACKED16 : _bindgen_ty_1 = 5 ; pub const SDL_PIXELTYPE_PACKED32 : _bindgen_ty_1 = 6 ; pub const SDL_PIXELTYPE_ARRAYU8 : _bindgen_ty_1 = 7 ; pub const SDL_PIXELTYPE_ARRAYU16 : _bindgen_ty_1 = 8 ; pub const SDL_PIXELTYPE_ARRAYU32 : _bindgen_ty_1 = 9 ; pub const SDL_PIXELTYPE_ARRAYF16 : _bindgen_ty_1 = 10 ; pub const SDL_PIXELTYPE_ARRAYF32 : _bindgen_ty_1 = 11 ; 
 /// Pixel type. 
 pub type _bindgen_ty_1 = u32 ; pub const SDL_BITMAPORDER_NONE : _bindgen_ty_2 = 0 ; pub const SDL_BITMAPORDER_4321 : _bindgen_ty_2 = 1 ; pub const SDL_BITMAPORDER_1234 : _bindgen_ty_2 = 2 ; 
 /// Bitmap pixel order, high bit -> low bit. 
 pub type _bindgen_ty_2 = u32 ; pub const SDL_PACKEDORDER_NONE : _bindgen_ty_3 = 0 ; pub const SDL_PACKEDORDER_XRGB : _bindgen_ty_3 = 1 ; pub const SDL_PACKEDORDER_RGBX : _bindgen_ty_3 = 2 ; pub const SDL_PACKEDORDER_ARGB : _bindgen_ty_3 = 3 ; pub const SDL_PACKEDORDER_RGBA : _bindgen_ty_3 = 4 ; pub const SDL_PACKEDORDER_XBGR : _bindgen_ty_3 = 5 ; pub const SDL_PACKEDORDER_BGRX : _bindgen_ty_3 = 6 ; pub const SDL_PACKEDORDER_ABGR : _bindgen_ty_3 = 7 ; pub const SDL_PACKEDORDER_BGRA : _bindgen_ty_3 = 8 ; 
 /// Packed component order, high bit -> low bit. 
 pub type _bindgen_ty_3 = u32 ; pub const SDL_ARRAYORDER_NONE : _bindgen_ty_4 = 0 ; pub const SDL_ARRAYORDER_RGB : _bindgen_ty_4 = 1 ; pub const SDL_ARRAYORDER_RGBA : _bindgen_ty_4 = 2 ; pub const SDL_ARRAYORDER_ARGB : _bindgen_ty_4 = 3 ; pub const SDL_ARRAYORDER_BGR : _bindgen_ty_4 = 4 ; pub const SDL_ARRAYORDER_BGRA : _bindgen_ty_4 = 5 ; pub const SDL_ARRAYORDER_ABGR : _bindgen_ty_4 = 6 ; 
 /// Array component order, low byte -> high byte. 
 pub type _bindgen_ty_4 = u32 ; pub const SDL_PACKEDLAYOUT_NONE : _bindgen_ty_5 = 0 ; pub const SDL_PACKEDLAYOUT_332 : _bindgen_ty_5 = 1 ; pub const SDL_PACKEDLAYOUT_4444 : _bindgen_ty_5 = 2 ; pub const SDL_PACKEDLAYOUT_1555 : _bindgen_ty_5 = 3 ; pub const SDL_PACKEDLAYOUT_5551 : _bindgen_ty_5 = 4 ; pub const SDL_PACKEDLAYOUT_565 : _bindgen_ty_5 = 5 ; pub const SDL_PACKEDLAYOUT_8888 : _bindgen_ty_5 = 6 ; pub const SDL_PACKEDLAYOUT_2101010 : _bindgen_ty_5 = 7 ; pub const SDL_PACKEDLAYOUT_1010102 : _bindgen_ty_5 = 8 ; 
 /// Packed component layout. 
 pub type _bindgen_ty_5 = u32 ; pub const SDL_PIXELFORMAT_UNKNOWN : _bindgen_ty_6 = 0 ; pub const SDL_PIXELFORMAT_INDEX1LSB : _bindgen_ty_6 = 286261504 ; pub const SDL_PIXELFORMAT_INDEX1MSB : _bindgen_ty_6 = 287310080 ; pub const SDL_PIXELFORMAT_INDEX4LSB : _bindgen_ty_6 = 303039488 ; pub const SDL_PIXELFORMAT_INDEX4MSB : _bindgen_ty_6 = 304088064 ; pub const SDL_PIXELFORMAT_INDEX8 : _bindgen_ty_6 = 318769153 ; pub const SDL_PIXELFORMAT_RGB332 : _bindgen_ty_6 = 336660481 ; pub const SDL_PIXELFORMAT_RGB444 : _bindgen_ty_6 = 353504258 ; pub const SDL_PIXELFORMAT_RGB555 : _bindgen_ty_6 = 353570562 ; pub const SDL_PIXELFORMAT_BGR555 : _bindgen_ty_6 = 357764866 ; pub const SDL_PIXELFORMAT_ARGB4444 : _bindgen_ty_6 = 355602434 ; pub const SDL_PIXELFORMAT_RGBA4444 : _bindgen_ty_6 = 356651010 ; pub const SDL_PIXELFORMAT_ABGR4444 : _bindgen_ty_6 = 359796738 ; pub const SDL_PIXELFORMAT_BGRA4444 : _bindgen_ty_6 = 360845314 ; pub const SDL_PIXELFORMAT_ARGB1555 : _bindgen_ty_6 = 355667970 ; pub const SDL_PIXELFORMAT_RGBA5551 : _bindgen_ty_6 = 356782082 ; pub const SDL_PIXELFORMAT_ABGR1555 : _bindgen_ty_6 = 359862274 ; pub const SDL_PIXELFORMAT_BGRA5551 : _bindgen_ty_6 = 360976386 ; pub const SDL_PIXELFORMAT_RGB565 : _bindgen_ty_6 = 353701890 ; pub const SDL_PIXELFORMAT_BGR565 : _bindgen_ty_6 = 357896194 ; pub const SDL_PIXELFORMAT_RGB24 : _bindgen_ty_6 = 386930691 ; pub const SDL_PIXELFORMAT_BGR24 : _bindgen_ty_6 = 390076419 ; pub const SDL_PIXELFORMAT_RGB888 : _bindgen_ty_6 = 370546692 ; pub const SDL_PIXELFORMAT_RGBX8888 : _bindgen_ty_6 = 371595268 ; pub const SDL_PIXELFORMAT_BGR888 : _bindgen_ty_6 = 374740996 ; pub const SDL_PIXELFORMAT_BGRX8888 : _bindgen_ty_6 = 375789572 ; pub const SDL_PIXELFORMAT_ARGB8888 : _bindgen_ty_6 = 372645892 ; pub const SDL_PIXELFORMAT_RGBA8888 : _bindgen_ty_6 = 373694468 ; pub const SDL_PIXELFORMAT_ABGR8888 : _bindgen_ty_6 = 376840196 ; pub const SDL_PIXELFORMAT_BGRA8888 : _bindgen_ty_6 = 377888772 ; pub const SDL_PIXELFORMAT_ARGB2101010 : _bindgen_ty_6 = 372711428 ; pub const SDL_PIXELFORMAT_RGBA32 : _bindgen_ty_6 = 376840196 ; pub const SDL_PIXELFORMAT_ARGB32 : _bindgen_ty_6 = 377888772 ; pub const SDL_PIXELFORMAT_BGRA32 : _bindgen_ty_6 = 372645892 ; pub const SDL_PIXELFORMAT_ABGR32 : _bindgen_ty_6 = 373694468 ; 
 /// < Planar mode: Y + V + U  (3 planes) 
 pub const SDL_PIXELFORMAT_YV12 : _bindgen_ty_6 = 842094169 ; 
 /// < Planar mode: Y + U + V  (3 planes) 
 pub const SDL_PIXELFORMAT_IYUV : _bindgen_ty_6 = 1448433993 ; 
 /// < Packed mode: Y0+U0+Y1+V0 (1 plane) 
 pub const SDL_PIXELFORMAT_YUY2 : _bindgen_ty_6 = 844715353 ; 
 /// < Packed mode: U0+Y0+V0+Y1 (1 plane) 
 pub const SDL_PIXELFORMAT_UYVY : _bindgen_ty_6 = 1498831189 ; 
 /// < Packed mode: Y0+V0+Y1+U0 (1 plane) 
 pub const SDL_PIXELFORMAT_YVYU : _bindgen_ty_6 = 1431918169 ; 
 /// < Planar mode: Y + U/V interleaved  (2 planes) 
 pub const SDL_PIXELFORMAT_NV12 : _bindgen_ty_6 = 842094158 ; 
 /// < Planar mode: Y + V/U interleaved  (2 planes) 
 pub const SDL_PIXELFORMAT_NV21 : _bindgen_ty_6 = 825382478 ; 
 /// < Android video texture format 
 pub const SDL_PIXELFORMAT_EXTERNAL_OES : _bindgen_ty_6 = 542328143 ; pub type _bindgen_ty_6 = u32 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_Color { pub r : Uint8 , pub g : Uint8 , pub b : Uint8 , pub a : Uint8 , } # [ test ] fn bindgen_test_layout_SDL_Color ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_Color > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( SDL_Color ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_Color > ( ) , 1usize , concat ! ( "Alignment of " , stringify ! ( SDL_Color ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Color > ( ) ) ) . r as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Color ) , "::" , stringify ! ( r ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Color > ( ) ) ) . g as * const _ as usize } , 1usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Color ) , "::" , stringify ! ( g ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Color > ( ) ) ) . b as * const _ as usize } , 2usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Color ) , "::" , stringify ! ( b ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Color > ( ) ) ) . a as * const _ as usize } , 3usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Color ) , "::" , stringify ! ( a ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_Palette { pub ncolors : ctypes :: c_int , pub colors : * mut SDL_Color , pub version : Uint32 , pub refcount : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_SDL_Palette ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_Palette > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( SDL_Palette ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_Palette > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_Palette ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Palette > ( ) ) ) . ncolors as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Palette ) , "::" , stringify ! ( ncolors ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Palette > ( ) ) ) . colors as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Palette ) , "::" , stringify ! ( colors ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Palette > ( ) ) ) . version as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Palette ) , "::" , stringify ! ( version ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Palette > ( ) ) ) . refcount as * const _ as usize } , 20usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Palette ) , "::" , stringify ! ( refcount ) ) ) ; } 
 /// \note Everything in the pixel format structure is read-only. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_PixelFormat { pub format : Uint32 , pub palette : * mut SDL_Palette , pub BitsPerPixel : Uint8 , pub BytesPerPixel : Uint8 , pub padding : [ Uint8 ; 2usize ] , pub Rmask : Uint32 , pub Gmask : Uint32 , pub Bmask : Uint32 , pub Amask : Uint32 , pub Rloss : Uint8 , pub Gloss : Uint8 , pub Bloss : Uint8 , pub Aloss : Uint8 , pub Rshift : Uint8 , pub Gshift : Uint8 , pub Bshift : Uint8 , pub Ashift : Uint8 , pub refcount : ctypes :: c_int , pub next : * mut SDL_PixelFormat , } # [ test ] fn bindgen_test_layout_SDL_PixelFormat ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_PixelFormat > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( SDL_PixelFormat ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_PixelFormat > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_PixelFormat ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . format as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( format ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . palette as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( palette ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . BitsPerPixel as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( BitsPerPixel ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . BytesPerPixel as * const _ as usize } , 17usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( BytesPerPixel ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . padding as * const _ as usize } , 18usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( padding ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Rmask as * const _ as usize } , 20usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Rmask ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Gmask as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Gmask ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Bmask as * const _ as usize } , 28usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Bmask ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Amask as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Amask ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Rloss as * const _ as usize } , 36usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Rloss ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Gloss as * const _ as usize } , 37usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Gloss ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Bloss as * const _ as usize } , 38usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Bloss ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Aloss as * const _ as usize } , 39usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Aloss ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Rshift as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Rshift ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Gshift as * const _ as usize } , 41usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Gshift ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Bshift as * const _ as usize } , 42usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Bshift ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . Ashift as * const _ as usize } , 43usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( Ashift ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . refcount as * const _ as usize } , 44usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( refcount ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_PixelFormat > ( ) ) ) . next as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( SDL_PixelFormat ) , "::" , stringify ! ( next ) ) ) ; } extern "C" { 
 /// \brief Get the human readable name of a pixel format 
 pub fn SDL_GetPixelFormatName ( format : Uint32 ) -> * const ctypes :: c_char ; } extern "C" { 
 /// \brief Convert one of the enumerated pixel formats to a bpp and RGBA masks.
///
/// \return SDL_TRUE, or SDL_FALSE if the conversion wasn't possible.
///
/// \sa SDL_MasksToPixelFormatEnum() 
 pub fn SDL_PixelFormatEnumToMasks ( format : Uint32 , bpp : * mut ctypes :: c_int , Rmask : * mut Uint32 , Gmask : * mut Uint32 , Bmask : * mut Uint32 , Amask : * mut Uint32 ) -> SDL_bool ; } extern "C" { 
 /// \brief Convert a bpp and RGBA masks to an enumerated pixel format.
///
/// \return The pixel format, or ::SDL_PIXELFORMAT_UNKNOWN if the conversion
/// wasn't possible.
///
/// \sa SDL_PixelFormatEnumToMasks() 
 pub fn SDL_MasksToPixelFormatEnum ( bpp : ctypes :: c_int , Rmask : Uint32 , Gmask : Uint32 , Bmask : Uint32 , Amask : Uint32 ) -> Uint32 ; } extern "C" { 
 /// \brief Create an SDL_PixelFormat structure from a pixel format enum. 
 pub fn SDL_AllocFormat ( pixel_format : Uint32 ) -> * mut SDL_PixelFormat ; } extern "C" { 
 /// \brief Free an SDL_PixelFormat structure. 
 pub fn SDL_FreeFormat ( format : * mut SDL_PixelFormat ) ; } extern "C" { 
 /// \brief Create a palette structure with the specified number of color
/// entries.
///
/// \return A new palette, or NULL if there wasn't enough memory.
///
/// \note The palette entries are initialized to white.
///
/// \sa SDL_FreePalette() 
 pub fn SDL_AllocPalette ( ncolors : ctypes :: c_int ) -> * mut SDL_Palette ; } extern "C" { 
 /// \brief Set the palette for a pixel format structure. 
 pub fn SDL_SetPixelFormatPalette ( format : * mut SDL_PixelFormat , palette : * mut SDL_Palette ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Set a range of colors in a palette.
///
/// \param palette    The palette to modify.
/// \param colors     An array of colors to copy into the palette.
/// \param firstcolor The index of the first palette entry to modify.
/// \param ncolors    The number of entries to modify.
///
/// \return 0 on success, or -1 if not all of the colors could be set. 
 pub fn SDL_SetPaletteColors ( palette : * mut SDL_Palette , colors : * const SDL_Color , firstcolor : ctypes :: c_int , ncolors : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Free a palette created with SDL_AllocPalette().
///
/// \sa SDL_AllocPalette() 
 pub fn SDL_FreePalette ( palette : * mut SDL_Palette ) ; } extern "C" { 
 /// \brief Maps an RGB triple to an opaque pixel value for a given pixel format.
///
/// \sa SDL_MapRGBA 
 pub fn SDL_MapRGB ( format : * const SDL_PixelFormat , r : Uint8 , g : Uint8 , b : Uint8 ) -> Uint32 ; } extern "C" { 
 /// \brief Maps an RGBA quadruple to a pixel value for a given pixel format.
///
/// \sa SDL_MapRGB 
 pub fn SDL_MapRGBA ( format : * const SDL_PixelFormat , r : Uint8 , g : Uint8 , b : Uint8 , a : Uint8 ) -> Uint32 ; } extern "C" { 
 /// \brief Get the RGB components from a pixel of the specified format.
///
/// \sa SDL_GetRGBA 
 pub fn SDL_GetRGB ( pixel : Uint32 , format : * const SDL_PixelFormat , r : * mut Uint8 , g : * mut Uint8 , b : * mut Uint8 ) ; } extern "C" { 
 /// \brief Get the RGBA components from a pixel of the specified format.
///
/// \sa SDL_GetRGB 
 pub fn SDL_GetRGBA ( pixel : Uint32 , format : * const SDL_PixelFormat , r : * mut Uint8 , g : * mut Uint8 , b : * mut Uint8 , a : * mut Uint8 ) ; } extern "C" { 
 /// \brief Calculate a 256 entry gamma ramp for a gamma value. 
 pub fn SDL_CalculateGammaRamp ( gamma : f32 , ramp : * mut Uint16 ) ; } 
 /// \brief  The structure that defines a point
///
/// \sa SDL_EnclosePoints
/// \sa SDL_PointInRect 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_Point { pub x : ctypes :: c_int , pub y : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_SDL_Point ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_Point > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( SDL_Point ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_Point > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( SDL_Point ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Point > ( ) ) ) . x as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Point ) , "::" , stringify ! ( x ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Point > ( ) ) ) . y as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Point ) , "::" , stringify ! ( y ) ) ) ; } 
 /// \brief A rectangle, with the origin at the upper left.
///
/// \sa SDL_RectEmpty
/// \sa SDL_RectEquals
/// \sa SDL_HasIntersection
/// \sa SDL_IntersectRect
/// \sa SDL_UnionRect
/// \sa SDL_EnclosePoints 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_Rect { pub x : ctypes :: c_int , pub y : ctypes :: c_int , pub w : ctypes :: c_int , pub h : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_SDL_Rect ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_Rect > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( SDL_Rect ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_Rect > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( SDL_Rect ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Rect > ( ) ) ) . x as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Rect ) , "::" , stringify ! ( x ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Rect > ( ) ) ) . y as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Rect ) , "::" , stringify ! ( y ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Rect > ( ) ) ) . w as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Rect ) , "::" , stringify ! ( w ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Rect > ( ) ) ) . h as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Rect ) , "::" , stringify ! ( h ) ) ) ; } extern "C" { 
 /// \brief Determine whether two rectangles intersect.
///
/// \return SDL_TRUE if there is an intersection, SDL_FALSE otherwise. 
 pub fn SDL_HasIntersection ( A : * const SDL_Rect , B : * const SDL_Rect ) -> SDL_bool ; } extern "C" { 
 /// \brief Calculate the intersection of two rectangles.
///
/// \return SDL_TRUE if there is an intersection, SDL_FALSE otherwise. 
 pub fn SDL_IntersectRect ( A : * const SDL_Rect , B : * const SDL_Rect , result : * mut SDL_Rect ) -> SDL_bool ; } extern "C" { 
 /// \brief Calculate the union of two rectangles. 
 pub fn SDL_UnionRect ( A : * const SDL_Rect , B : * const SDL_Rect , result : * mut SDL_Rect ) ; } extern "C" { 
 /// \brief Calculate a minimal rectangle enclosing a set of points
///
/// \return SDL_TRUE if any points were within the clipping rect 
 pub fn SDL_EnclosePoints ( points : * const SDL_Point , count : ctypes :: c_int , clip : * const SDL_Rect , result : * mut SDL_Rect ) -> SDL_bool ; } extern "C" { 
 /// \brief Calculate the intersection of a rectangle and line segment.
///
/// \return SDL_TRUE if there is an intersection, SDL_FALSE otherwise. 
 pub fn SDL_IntersectRectAndLine ( rect : * const SDL_Rect , X1 : * mut ctypes :: c_int , Y1 : * mut ctypes :: c_int , X2 : * mut ctypes :: c_int , Y2 : * mut ctypes :: c_int ) -> SDL_bool ; } 
 /// < no blending
/// dstRGBA = srcRGBA 
 pub const SDL_BlendMode_SDL_BLENDMODE_NONE : SDL_BlendMode = 0 ; 
 /// < alpha blending
/// dstRGB = (srcRGB * srcA) + (dstRGB * (1-srcA))
/// dstA = srcA + (dstA * (1-srcA)) 
 pub const SDL_BlendMode_SDL_BLENDMODE_BLEND : SDL_BlendMode = 1 ; 
 /// < additive blending
/// dstRGB = (srcRGB * srcA) + dstRGB
/// dstA = dstA 
 pub const SDL_BlendMode_SDL_BLENDMODE_ADD : SDL_BlendMode = 2 ; 
 /// < color modulate
/// dstRGB = srcRGB * dstRGB
/// dstA = dstA 
 pub const SDL_BlendMode_SDL_BLENDMODE_MOD : SDL_BlendMode = 4 ; pub const SDL_BlendMode_SDL_BLENDMODE_INVALID : SDL_BlendMode = 2147483647 ; 
 /// \brief The blend mode used in SDL_RenderCopy() and drawing operations. 
 pub type SDL_BlendMode = u32 ; 
 /// < dst + src: supported by all renderers 
 pub const SDL_BlendOperation_SDL_BLENDOPERATION_ADD : SDL_BlendOperation = 1 ; 
 /// < dst - src : supported by D3D9, D3D11, OpenGL, OpenGLES 
 pub const SDL_BlendOperation_SDL_BLENDOPERATION_SUBTRACT : SDL_BlendOperation = 2 ; 
 /// < src - dst : supported by D3D9, D3D11, OpenGL, OpenGLES 
 pub const SDL_BlendOperation_SDL_BLENDOPERATION_REV_SUBTRACT : SDL_BlendOperation = 3 ; 
 /// < min(dst, src) : supported by D3D11 
 pub const SDL_BlendOperation_SDL_BLENDOPERATION_MINIMUM : SDL_BlendOperation = 4 ; 
 /// < max(dst, src) : supported by D3D11 
 pub const SDL_BlendOperation_SDL_BLENDOPERATION_MAXIMUM : SDL_BlendOperation = 5 ; 
 /// \brief The blend operation used when combining source and destination pixel components 
 pub type SDL_BlendOperation = u32 ; 
 /// < 0, 0, 0, 0 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_ZERO : SDL_BlendFactor = 1 ; 
 /// < 1, 1, 1, 1 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE : SDL_BlendFactor = 2 ; 
 /// < srcR, srcG, srcB, srcA 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_SRC_COLOR : SDL_BlendFactor = 3 ; 
 /// < 1-srcR, 1-srcG, 1-srcB, 1-srcA 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_SRC_COLOR : SDL_BlendFactor = 4 ; 
 /// < srcA, srcA, srcA, srcA 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_SRC_ALPHA : SDL_BlendFactor = 5 ; 
 /// < 1-srcA, 1-srcA, 1-srcA, 1-srcA 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_SRC_ALPHA : SDL_BlendFactor = 6 ; 
 /// < dstR, dstG, dstB, dstA 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_DST_COLOR : SDL_BlendFactor = 7 ; 
 /// < 1-dstR, 1-dstG, 1-dstB, 1-dstA 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_DST_COLOR : SDL_BlendFactor = 8 ; 
 /// < dstA, dstA, dstA, dstA 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_DST_ALPHA : SDL_BlendFactor = 9 ; 
 /// < 1-dstA, 1-dstA, 1-dstA, 1-dstA 
 pub const SDL_BlendFactor_SDL_BLENDFACTOR_ONE_MINUS_DST_ALPHA : SDL_BlendFactor = 10 ; 
 /// \brief The normalized factor used to multiply pixel components 
 pub type SDL_BlendFactor = u32 ; extern "C" { 
 /// \brief Create a custom blend mode, which may or may not be supported by a given renderer
///
/// \param srcColorFactor
/// \param dstColorFactor
/// \param colorOperation
/// \param srcAlphaFactor
/// \param dstAlphaFactor
/// \param alphaOperation
///
/// The result of the blend mode operation will be:
/// dstRGB = dstRGB * dstColorFactor colorOperation srcRGB * srcColorFactor
/// and
/// dstA = dstA * dstAlphaFactor alphaOperation srcA * srcAlphaFactor 
 pub fn SDL_ComposeCustomBlendMode ( srcColorFactor : SDL_BlendFactor , dstColorFactor : SDL_BlendFactor , colorOperation : SDL_BlendOperation , srcAlphaFactor : SDL_BlendFactor , dstAlphaFactor : SDL_BlendFactor , alphaOperation : SDL_BlendOperation ) -> SDL_BlendMode ; } 
 /// \brief A collection of pixels used in software blitting.
///
/// \note  This structure should be treated as read-only, except for \c pixels,
/// which, if not NULL, contains the raw pixel data for the surface. 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_Surface { 
 /// < Read-only 
 pub flags : Uint32 , 
 /// < Read-only 
 pub format : * mut SDL_PixelFormat , 
 /// < Read-only 
 pub w : ctypes :: c_int , 
 /// < Read-only 
 pub h : ctypes :: c_int , 
 /// < Read-only 
 pub pitch : ctypes :: c_int , 
 /// < Read-write 
 pub pixels : * mut ctypes :: c_void , 
 /// < Read-write 
 pub userdata : * mut ctypes :: c_void , 
 /// < Read-only 
 pub locked : ctypes :: c_int , 
 /// < Read-only 
 pub lock_data : * mut ctypes :: c_void , 
 /// < Read-only 
 pub clip_rect : SDL_Rect , 
 /// < Private 
 pub map : * mut SDL_BlitMap , 
 /// < Read-mostly 
 pub refcount : ctypes :: c_int , } # [ test ] fn bindgen_test_layout_SDL_Surface ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_Surface > ( ) , 96usize , concat ! ( "Size of: " , stringify ! ( SDL_Surface ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_Surface > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_Surface ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . flags as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( flags ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . format as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( format ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . w as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( w ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . h as * const _ as usize } , 20usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( h ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . pitch as * const _ as usize } , 24usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( pitch ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . pixels as * const _ as usize } , 32usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( pixels ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . userdata as * const _ as usize } , 40usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( userdata ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . locked as * const _ as usize } , 48usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( locked ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . lock_data as * const _ as usize } , 56usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( lock_data ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . clip_rect as * const _ as usize } , 64usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( clip_rect ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . map as * const _ as usize } , 80usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( map ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_Surface > ( ) ) ) . refcount as * const _ as usize } , 88usize , concat ! ( "Offset of field: " , stringify ! ( SDL_Surface ) , "::" , stringify ! ( refcount ) ) ) ; } 
 /// \brief The type of function used for surface blitting functions. 
 pub type SDL_blit = :: core :: option :: Option < unsafe extern "C" fn ( src : * mut SDL_Surface , srcrect : * mut SDL_Rect , dst : * mut SDL_Surface , dstrect : * mut SDL_Rect ) -> ctypes :: c_int > ; 
 /// < Full range JPEG 
 pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_JPEG : SDL_YUV_CONVERSION_MODE = 0 ; 
 /// < BT.601 (the default) 
 pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_BT601 : SDL_YUV_CONVERSION_MODE = 1 ; 
 /// < BT.709 
 pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_BT709 : SDL_YUV_CONVERSION_MODE = 2 ; 
 /// < BT.601 for SD content, BT.709 for HD content 
 pub const SDL_YUV_CONVERSION_MODE_SDL_YUV_CONVERSION_AUTOMATIC : SDL_YUV_CONVERSION_MODE = 3 ; 
 /// \brief The formula used for converting between YUV and RGB 
 pub type SDL_YUV_CONVERSION_MODE = u32 ; extern "C" { 
 /// Allocate and free an RGB surface.
///
/// If the depth is 4 or 8 bits, an empty palette is allocated for the surface.
/// If the depth is greater than 8 bits, the pixel format is set using the
/// flags '[RGB]mask'.
///
/// If the function runs out of memory, it will return NULL.
///
/// \param flags The \c flags are obsolete and should be set to 0.
/// \param width The width in pixels of the surface to create.
/// \param height The height in pixels of the surface to create.
/// \param depth The depth in bits of the surface to create.
/// \param Rmask The red mask of the surface to create.
/// \param Gmask The green mask of the surface to create.
/// \param Bmask The blue mask of the surface to create.
/// \param Amask The alpha mask of the surface to create. 
 pub fn SDL_CreateRGBSurface ( flags : Uint32 , width : ctypes :: c_int , height : ctypes :: c_int , depth : ctypes :: c_int , Rmask : Uint32 , Gmask : Uint32 , Bmask : Uint32 , Amask : Uint32 ) -> * mut SDL_Surface ; } extern "C" { pub fn SDL_CreateRGBSurfaceWithFormat ( flags : Uint32 , width : ctypes :: c_int , height : ctypes :: c_int , depth : ctypes :: c_int , format : Uint32 ) -> * mut SDL_Surface ; } extern "C" { pub fn SDL_CreateRGBSurfaceFrom ( pixels : * mut ctypes :: c_void , width : ctypes :: c_int , height : ctypes :: c_int , depth : ctypes :: c_int , pitch : ctypes :: c_int , Rmask : Uint32 , Gmask : Uint32 , Bmask : Uint32 , Amask : Uint32 ) -> * mut SDL_Surface ; } extern "C" { pub fn SDL_CreateRGBSurfaceWithFormatFrom ( pixels : * mut ctypes :: c_void , width : ctypes :: c_int , height : ctypes :: c_int , depth : ctypes :: c_int , pitch : ctypes :: c_int , format : Uint32 ) -> * mut SDL_Surface ; } extern "C" { pub fn SDL_FreeSurface ( surface : * mut SDL_Surface ) ; } extern "C" { 
 /// \brief Set the palette used by a surface.
///
/// \return 0, or -1 if the surface format doesn't use a palette.
///
/// \note A single palette can be shared with many surfaces. 
 pub fn SDL_SetSurfacePalette ( surface : * mut SDL_Surface , palette : * mut SDL_Palette ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Sets up a surface for directly accessing the pixels.
///
/// Between calls to SDL_LockSurface() / SDL_UnlockSurface(), you can write
/// to and read from \c surface->pixels, using the pixel format stored in
/// \c surface->format.  Once you are done accessing the surface, you should
/// use SDL_UnlockSurface() to release it.
///
/// Not all surfaces require locking.  If SDL_MUSTLOCK(surface) evaluates
/// to 0, then you can read and write to the surface at any time, and the
/// pixel format of the surface will not change.
///
/// No operating system or library calls should be made between lock/unlock
/// pairs, as critical system locks may be held during this time.
///
/// SDL_LockSurface() returns 0, or -1 if the surface couldn't be locked.
///
/// \sa SDL_UnlockSurface() 
 pub fn SDL_LockSurface ( surface : * mut SDL_Surface ) -> ctypes :: c_int ; } extern "C" { 
 /// \sa SDL_LockSurface() 
 pub fn SDL_UnlockSurface ( surface : * mut SDL_Surface ) ; } extern "C" { 
 /// Load a surface from a seekable SDL data stream (memory or file).
///
/// If \c freesrc is non-zero, the stream will be closed after being read.
///
/// The new surface should be freed with SDL_FreeSurface().
///
/// \return the new surface, or NULL if there was an error. 
 pub fn SDL_LoadBMP_RW ( src : * mut SDL_RWops , freesrc : ctypes :: c_int ) -> * mut SDL_Surface ; } extern "C" { 
 /// Save a surface to a seekable SDL data stream (memory or file).
///
/// Surfaces with a 24-bit, 32-bit and paletted 8-bit format get saved in the
/// BMP directly. Other RGB formats with 8-bit or higher get converted to a
/// 24-bit surface or, if they have an alpha mask or a colorkey, to a 32-bit
/// surface before they are saved. YUV and paletted 1-bit and 4-bit formats are
/// not supported.
///
/// If \c freedst is non-zero, the stream will be closed after being written.
///
/// \return 0 if successful or -1 if there was an error. 
 pub fn SDL_SaveBMP_RW ( surface : * mut SDL_Surface , dst : * mut SDL_RWops , freedst : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Sets the RLE acceleration hint for a surface.
///
/// \return 0 on success, or -1 if the surface is not valid
///
/// \note If RLE is enabled, colorkey and alpha blending blits are much faster,
/// but the surface must be locked before directly accessing the pixels. 
 pub fn SDL_SetSurfaceRLE ( surface : * mut SDL_Surface , flag : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Sets the color key (transparent pixel) in a blittable surface.
///
/// \param surface The surface to update
/// \param flag Non-zero to enable colorkey and 0 to disable colorkey
/// \param key The transparent pixel in the native surface format
///
/// \return 0 on success, or -1 if the surface is not valid
///
/// You can pass SDL_RLEACCEL to enable RLE accelerated blits. 
 pub fn SDL_SetColorKey ( surface : * mut SDL_Surface , flag : ctypes :: c_int , key : Uint32 ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Gets the color key (transparent pixel) in a blittable surface.
///
/// \param surface The surface to update
/// \param key A pointer filled in with the transparent pixel in the native
/// surface format
///
/// \return 0 on success, or -1 if the surface is not valid or colorkey is not
/// enabled. 
 pub fn SDL_GetColorKey ( surface : * mut SDL_Surface , key : * mut Uint32 ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Set an additional color value used in blit operations.
///
/// \param surface The surface to update.
/// \param r The red color value multiplied into blit operations.
/// \param g The green color value multiplied into blit operations.
/// \param b The blue color value multiplied into blit operations.
///
/// \return 0 on success, or -1 if the surface is not valid.
///
/// \sa SDL_GetSurfaceColorMod() 
 pub fn SDL_SetSurfaceColorMod ( surface : * mut SDL_Surface , r : Uint8 , g : Uint8 , b : Uint8 ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the additional color value used in blit operations.
///
/// \param surface The surface to query.
/// \param r A pointer filled in with the current red color value.
/// \param g A pointer filled in with the current green color value.
/// \param b A pointer filled in with the current blue color value.
///
/// \return 0 on success, or -1 if the surface is not valid.
///
/// \sa SDL_SetSurfaceColorMod() 
 pub fn SDL_GetSurfaceColorMod ( surface : * mut SDL_Surface , r : * mut Uint8 , g : * mut Uint8 , b : * mut Uint8 ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Set an additional alpha value used in blit operations.
///
/// \param surface The surface to update.
/// \param alpha The alpha value multiplied into blit operations.
///
/// \return 0 on success, or -1 if the surface is not valid.
///
/// \sa SDL_GetSurfaceAlphaMod() 
 pub fn SDL_SetSurfaceAlphaMod ( surface : * mut SDL_Surface , alpha : Uint8 ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the additional alpha value used in blit operations.
///
/// \param surface The surface to query.
/// \param alpha A pointer filled in with the current alpha value.
///
/// \return 0 on success, or -1 if the surface is not valid.
///
/// \sa SDL_SetSurfaceAlphaMod() 
 pub fn SDL_GetSurfaceAlphaMod ( surface : * mut SDL_Surface , alpha : * mut Uint8 ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Set the blend mode used for blit operations.
///
/// \param surface The surface to update.
/// \param blendMode ::SDL_BlendMode to use for blit blending.
///
/// \return 0 on success, or -1 if the parameters are not valid.
///
/// \sa SDL_GetSurfaceBlendMode() 
 pub fn SDL_SetSurfaceBlendMode ( surface : * mut SDL_Surface , blendMode : SDL_BlendMode ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the blend mode used for blit operations.
///
/// \param surface   The surface to query.
/// \param blendMode A pointer filled in with the current blend mode.
///
/// \return 0 on success, or -1 if the surface is not valid.
///
/// \sa SDL_SetSurfaceBlendMode() 
 pub fn SDL_GetSurfaceBlendMode ( surface : * mut SDL_Surface , blendMode : * mut SDL_BlendMode ) -> ctypes :: c_int ; } extern "C" { 
 /// Sets the clipping rectangle for the destination surface in a blit.
///
/// If the clip rectangle is NULL, clipping will be disabled.
///
/// If the clip rectangle doesn't intersect the surface, the function will
/// return SDL_FALSE and blits will be completely clipped.  Otherwise the
/// function returns SDL_TRUE and blits to the surface will be clipped to
/// the intersection of the surface area and the clipping rectangle.
///
/// Note that blits are automatically clipped to the edges of the source
/// and destination surfaces. 
 pub fn SDL_SetClipRect ( surface : * mut SDL_Surface , rect : * const SDL_Rect ) -> SDL_bool ; } extern "C" { 
 /// Gets the clipping rectangle for the destination surface in a blit.
///
/// \c rect must be a pointer to a valid rectangle which will be filled
/// with the correct values. 
 pub fn SDL_GetClipRect ( surface : * mut SDL_Surface , rect : * mut SDL_Rect ) ; } extern "C" { pub fn SDL_DuplicateSurface ( surface : * mut SDL_Surface ) -> * mut SDL_Surface ; } extern "C" { 
 /// Creates a new surface of the specified format, and then copies and maps
/// the given surface to it so the blit of the converted surface will be as
/// fast as possible.  If this function fails, it returns NULL.
///
/// The \c flags parameter is passed to SDL_CreateRGBSurface() and has those
/// semantics.  You can also pass ::SDL_RLEACCEL in the flags parameter and
/// SDL will try to RLE accelerate colorkey and alpha blits in the resulting
/// surface. 
 pub fn SDL_ConvertSurface ( src : * mut SDL_Surface , fmt : * const SDL_PixelFormat , flags : Uint32 ) -> * mut SDL_Surface ; } extern "C" { pub fn SDL_ConvertSurfaceFormat ( src : * mut SDL_Surface , pixel_format : Uint32 , flags : Uint32 ) -> * mut SDL_Surface ; } extern "C" { 
 /// \brief Copy a block of pixels of one format to another format
///
/// \return 0 on success, or -1 if there was an error 
 pub fn SDL_ConvertPixels ( width : ctypes :: c_int , height : ctypes :: c_int , src_format : Uint32 , src : * const ctypes :: c_void , src_pitch : ctypes :: c_int , dst_format : Uint32 , dst : * mut ctypes :: c_void , dst_pitch : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// Performs a fast fill of the given rectangle with \c color.
///
/// If \c rect is NULL, the whole surface will be filled with \c color.
///
/// The color should be a pixel of the format used by the surface, and
/// can be generated by the SDL_MapRGB() function.
///
/// \return 0 on success, or -1 on error. 
 pub fn SDL_FillRect ( dst : * mut SDL_Surface , rect : * const SDL_Rect , color : Uint32 ) -> ctypes :: c_int ; } extern "C" { pub fn SDL_FillRects ( dst : * mut SDL_Surface , rects : * const SDL_Rect , count : ctypes :: c_int , color : Uint32 ) -> ctypes :: c_int ; } extern "C" { 
 /// This is the public blit function, SDL_BlitSurface(), and it performs
/// rectangle validation and clipping before passing it to SDL_LowerBlit() 
 pub fn SDL_UpperBlit ( src : * mut SDL_Surface , srcrect : * const SDL_Rect , dst : * mut SDL_Surface , dstrect : * mut SDL_Rect ) -> ctypes :: c_int ; } extern "C" { 
 /// This is a semi-private blit function and it performs low-level surface
/// blitting only. 
 pub fn SDL_LowerBlit ( src : * mut SDL_Surface , srcrect : * mut SDL_Rect , dst : * mut SDL_Surface , dstrect : * mut SDL_Rect ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Perform a fast, low quality, stretch blit between two surfaces of the
/// same pixel format.
///
/// \note This function uses a static buffer, and is not thread-safe. 
 pub fn SDL_SoftStretch ( src : * mut SDL_Surface , srcrect : * const SDL_Rect , dst : * mut SDL_Surface , dstrect : * const SDL_Rect ) -> ctypes :: c_int ; } extern "C" { 
 /// This is the public scaled blit function, SDL_BlitScaled(), and it performs
/// rectangle validation and clipping before passing it to SDL_LowerBlitScaled() 
 pub fn SDL_UpperBlitScaled ( src : * mut SDL_Surface , srcrect : * const SDL_Rect , dst : * mut SDL_Surface , dstrect : * mut SDL_Rect ) -> ctypes :: c_int ; } extern "C" { 
 /// This is a semi-private blit function and it performs low-level surface
/// scaled blitting only. 
 pub fn SDL_LowerBlitScaled ( src : * mut SDL_Surface , srcrect : * mut SDL_Rect , dst : * mut SDL_Surface , dstrect : * mut SDL_Rect ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Set the YUV conversion mode 
 pub fn SDL_SetYUVConversionMode ( mode : SDL_YUV_CONVERSION_MODE ) ; } extern "C" { 
 /// \brief Get the YUV conversion mode 
 pub fn SDL_GetYUVConversionMode ( ) -> SDL_YUV_CONVERSION_MODE ; } extern "C" { 
 /// \brief Get the YUV conversion mode, returning the correct mode for the resolution when the current conversion mode is SDL_YUV_CONVERSION_AUTOMATIC 
 pub fn SDL_GetYUVConversionModeForResolution ( width : ctypes :: c_int , height : ctypes :: c_int ) -> SDL_YUV_CONVERSION_MODE ; } 
 /// \brief  The structure that defines a display mode
///
/// \sa SDL_GetNumDisplayModes()
/// \sa SDL_GetDisplayMode()
/// \sa SDL_GetDesktopDisplayMode()
/// \sa SDL_GetCurrentDisplayMode()
/// \sa SDL_GetClosestDisplayMode()
/// \sa SDL_SetWindowDisplayMode()
/// \sa SDL_GetWindowDisplayMode() 
 # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_DisplayMode { 
 /// < pixel format 
 pub format : Uint32 , 
 /// < width, in screen coordinates 
 pub w : ctypes :: c_int , 
 /// < height, in screen coordinates 
 pub h : ctypes :: c_int , 
 /// < refresh rate (or zero for unspecified) 
 pub refresh_rate : ctypes :: c_int , 
 /// < driver-specific data, initialize to 0 
 pub driverdata : * mut ctypes :: c_void , } # [ test ] fn bindgen_test_layout_SDL_DisplayMode ( ) { assert_eq ! ( :: core :: mem :: size_of :: < SDL_DisplayMode > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( SDL_DisplayMode ) ) ) ; assert_eq ! ( :: core :: mem :: align_of :: < SDL_DisplayMode > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( SDL_DisplayMode ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_DisplayMode > ( ) ) ) . format as * const _ as usize } , 0usize , concat ! ( "Offset of field: " , stringify ! ( SDL_DisplayMode ) , "::" , stringify ! ( format ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_DisplayMode > ( ) ) ) . w as * const _ as usize } , 4usize , concat ! ( "Offset of field: " , stringify ! ( SDL_DisplayMode ) , "::" , stringify ! ( w ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_DisplayMode > ( ) ) ) . h as * const _ as usize } , 8usize , concat ! ( "Offset of field: " , stringify ! ( SDL_DisplayMode ) , "::" , stringify ! ( h ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_DisplayMode > ( ) ) ) . refresh_rate as * const _ as usize } , 12usize , concat ! ( "Offset of field: " , stringify ! ( SDL_DisplayMode ) , "::" , stringify ! ( refresh_rate ) ) ) ; assert_eq ! ( unsafe { & ( * ( :: core :: ptr :: null :: < SDL_DisplayMode > ( ) ) ) . driverdata as * const _ as usize } , 16usize , concat ! ( "Offset of field: " , stringify ! ( SDL_DisplayMode ) , "::" , stringify ! ( driverdata ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SDL_Window { _unused : [ u8 ; 0 ] , } 
 /// < fullscreen window 
 pub const SDL_WindowFlags_SDL_WINDOW_FULLSCREEN : SDL_WindowFlags = 1 ; 
 /// < window usable with OpenGL context 
 pub const SDL_WindowFlags_SDL_WINDOW_OPENGL : SDL_WindowFlags = 2 ; 
 /// < window is visible 
 pub const SDL_WindowFlags_SDL_WINDOW_SHOWN : SDL_WindowFlags = 4 ; 
 /// < window is not visible 
 pub const SDL_WindowFlags_SDL_WINDOW_HIDDEN : SDL_WindowFlags = 8 ; 
 /// < no window decoration 
 pub const SDL_WindowFlags_SDL_WINDOW_BORDERLESS : SDL_WindowFlags = 16 ; 
 /// < window can be resized 
 pub const SDL_WindowFlags_SDL_WINDOW_RESIZABLE : SDL_WindowFlags = 32 ; 
 /// < window is minimized 
 pub const SDL_WindowFlags_SDL_WINDOW_MINIMIZED : SDL_WindowFlags = 64 ; 
 /// < window is maximized 
 pub const SDL_WindowFlags_SDL_WINDOW_MAXIMIZED : SDL_WindowFlags = 128 ; 
 /// < window has grabbed input focus 
 pub const SDL_WindowFlags_SDL_WINDOW_INPUT_GRABBED : SDL_WindowFlags = 256 ; 
 /// < window has input focus 
 pub const SDL_WindowFlags_SDL_WINDOW_INPUT_FOCUS : SDL_WindowFlags = 512 ; 
 /// < window has mouse focus 
 pub const SDL_WindowFlags_SDL_WINDOW_MOUSE_FOCUS : SDL_WindowFlags = 1024 ; pub const SDL_WindowFlags_SDL_WINDOW_FULLSCREEN_DESKTOP : SDL_WindowFlags = 4097 ; 
 /// < window not created by SDL 
 pub const SDL_WindowFlags_SDL_WINDOW_FOREIGN : SDL_WindowFlags = 2048 ; 
 /// < window should be created in high-DPI mode if supported.
/// On macOS NSHighResolutionCapable must be set true in the
/// application's Info.plist for this to have any effect. 
 pub const SDL_WindowFlags_SDL_WINDOW_ALLOW_HIGHDPI : SDL_WindowFlags = 8192 ; 
 /// < window has mouse captured (unrelated to INPUT_GRABBED) 
 pub const SDL_WindowFlags_SDL_WINDOW_MOUSE_CAPTURE : SDL_WindowFlags = 16384 ; 
 /// < window should always be above others 
 pub const SDL_WindowFlags_SDL_WINDOW_ALWAYS_ON_TOP : SDL_WindowFlags = 32768 ; 
 /// < window should not be added to the taskbar 
 pub const SDL_WindowFlags_SDL_WINDOW_SKIP_TASKBAR : SDL_WindowFlags = 65536 ; 
 /// < window should be treated as a utility window 
 pub const SDL_WindowFlags_SDL_WINDOW_UTILITY : SDL_WindowFlags = 131072 ; 
 /// < window should be treated as a tooltip 
 pub const SDL_WindowFlags_SDL_WINDOW_TOOLTIP : SDL_WindowFlags = 262144 ; 
 /// < window should be treated as a popup menu 
 pub const SDL_WindowFlags_SDL_WINDOW_POPUP_MENU : SDL_WindowFlags = 524288 ; 
 /// < window usable for Vulkan surface 
 pub const SDL_WindowFlags_SDL_WINDOW_VULKAN : SDL_WindowFlags = 268435456 ; 
 /// \brief The flags on a window
///
/// \sa SDL_GetWindowFlags() 
 pub type SDL_WindowFlags = u32 ; 
 /// < Never used 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_NONE : SDL_WindowEventID = 0 ; 
 /// < Window has been shown 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_SHOWN : SDL_WindowEventID = 1 ; 
 /// < Window has been hidden 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_HIDDEN : SDL_WindowEventID = 2 ; 
 /// < Window has been exposed and should be
/// redrawn 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_EXPOSED : SDL_WindowEventID = 3 ; 
 /// < Window has been moved to data1, data2 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_MOVED : SDL_WindowEventID = 4 ; 
 /// < Window has been resized to data1xdata2 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_RESIZED : SDL_WindowEventID = 5 ; 
 /// < The window size has changed, either as
/// a result of an API call or through the
/// system or user changing the window size. 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_SIZE_CHANGED : SDL_WindowEventID = 6 ; 
 /// < Window has been minimized 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_MINIMIZED : SDL_WindowEventID = 7 ; 
 /// < Window has been maximized 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_MAXIMIZED : SDL_WindowEventID = 8 ; 
 /// < Window has been restored to normal size
/// and position 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_RESTORED : SDL_WindowEventID = 9 ; 
 /// < Window has gained mouse focus 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_ENTER : SDL_WindowEventID = 10 ; 
 /// < Window has lost mouse focus 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_LEAVE : SDL_WindowEventID = 11 ; 
 /// < Window has gained keyboard focus 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_FOCUS_GAINED : SDL_WindowEventID = 12 ; 
 /// < Window has lost keyboard focus 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_FOCUS_LOST : SDL_WindowEventID = 13 ; 
 /// < The window manager requests that the window be closed 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_CLOSE : SDL_WindowEventID = 14 ; 
 /// < Window is being offered a focus (should SetWindowInputFocus() on itself or a subwindow, or ignore) 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_TAKE_FOCUS : SDL_WindowEventID = 15 ; 
 /// < Window had a hit test that wasn't SDL_HITTEST_NORMAL. 
 pub const SDL_WindowEventID_SDL_WINDOWEVENT_HIT_TEST : SDL_WindowEventID = 16 ; 
 /// \brief Event subtype for window events 
 pub type SDL_WindowEventID = u32 ; 
 /// \brief An opaque handle to an OpenGL context. 
 pub type SDL_GLContext = * mut ctypes :: c_void ; pub const SDL_GLattr_SDL_GL_RED_SIZE : SDL_GLattr = 0 ; pub const SDL_GLattr_SDL_GL_GREEN_SIZE : SDL_GLattr = 1 ; pub const SDL_GLattr_SDL_GL_BLUE_SIZE : SDL_GLattr = 2 ; pub const SDL_GLattr_SDL_GL_ALPHA_SIZE : SDL_GLattr = 3 ; pub const SDL_GLattr_SDL_GL_BUFFER_SIZE : SDL_GLattr = 4 ; pub const SDL_GLattr_SDL_GL_DOUBLEBUFFER : SDL_GLattr = 5 ; pub const SDL_GLattr_SDL_GL_DEPTH_SIZE : SDL_GLattr = 6 ; pub const SDL_GLattr_SDL_GL_STENCIL_SIZE : SDL_GLattr = 7 ; pub const SDL_GLattr_SDL_GL_ACCUM_RED_SIZE : SDL_GLattr = 8 ; pub const SDL_GLattr_SDL_GL_ACCUM_GREEN_SIZE : SDL_GLattr = 9 ; pub const SDL_GLattr_SDL_GL_ACCUM_BLUE_SIZE : SDL_GLattr = 10 ; pub const SDL_GLattr_SDL_GL_ACCUM_ALPHA_SIZE : SDL_GLattr = 11 ; pub const SDL_GLattr_SDL_GL_STEREO : SDL_GLattr = 12 ; pub const SDL_GLattr_SDL_GL_MULTISAMPLEBUFFERS : SDL_GLattr = 13 ; pub const SDL_GLattr_SDL_GL_MULTISAMPLESAMPLES : SDL_GLattr = 14 ; pub const SDL_GLattr_SDL_GL_ACCELERATED_VISUAL : SDL_GLattr = 15 ; pub const SDL_GLattr_SDL_GL_RETAINED_BACKING : SDL_GLattr = 16 ; pub const SDL_GLattr_SDL_GL_CONTEXT_MAJOR_VERSION : SDL_GLattr = 17 ; pub const SDL_GLattr_SDL_GL_CONTEXT_MINOR_VERSION : SDL_GLattr = 18 ; pub const SDL_GLattr_SDL_GL_CONTEXT_EGL : SDL_GLattr = 19 ; pub const SDL_GLattr_SDL_GL_CONTEXT_FLAGS : SDL_GLattr = 20 ; pub const SDL_GLattr_SDL_GL_CONTEXT_PROFILE_MASK : SDL_GLattr = 21 ; pub const SDL_GLattr_SDL_GL_SHARE_WITH_CURRENT_CONTEXT : SDL_GLattr = 22 ; pub const SDL_GLattr_SDL_GL_FRAMEBUFFER_SRGB_CAPABLE : SDL_GLattr = 23 ; pub const SDL_GLattr_SDL_GL_CONTEXT_RELEASE_BEHAVIOR : SDL_GLattr = 24 ; pub const SDL_GLattr_SDL_GL_CONTEXT_RESET_NOTIFICATION : SDL_GLattr = 25 ; pub const SDL_GLattr_SDL_GL_CONTEXT_NO_ERROR : SDL_GLattr = 26 ; 
 /// \brief OpenGL configuration attributes 
 pub type SDL_GLattr = u32 ; pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_CORE : SDL_GLprofile = 1 ; pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_COMPATIBILITY : SDL_GLprofile = 2 ; 
 /// < GLX_CONTEXT_ES2_PROFILE_BIT_EXT 
 pub const SDL_GLprofile_SDL_GL_CONTEXT_PROFILE_ES : SDL_GLprofile = 4 ; pub type SDL_GLprofile = u32 ; pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_DEBUG_FLAG : SDL_GLcontextFlag = 1 ; pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_FORWARD_COMPATIBLE_FLAG : SDL_GLcontextFlag = 2 ; pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_ROBUST_ACCESS_FLAG : SDL_GLcontextFlag = 4 ; pub const SDL_GLcontextFlag_SDL_GL_CONTEXT_RESET_ISOLATION_FLAG : SDL_GLcontextFlag = 8 ; pub type SDL_GLcontextFlag = u32 ; pub const SDL_GLcontextReleaseFlag_SDL_GL_CONTEXT_RELEASE_BEHAVIOR_NONE : SDL_GLcontextReleaseFlag = 0 ; pub const SDL_GLcontextReleaseFlag_SDL_GL_CONTEXT_RELEASE_BEHAVIOR_FLUSH : SDL_GLcontextReleaseFlag = 1 ; pub type SDL_GLcontextReleaseFlag = u32 ; pub const SDL_GLContextResetNotification_SDL_GL_CONTEXT_RESET_NO_NOTIFICATION : SDL_GLContextResetNotification = 0 ; pub const SDL_GLContextResetNotification_SDL_GL_CONTEXT_RESET_LOSE_CONTEXT : SDL_GLContextResetNotification = 1 ; pub type SDL_GLContextResetNotification = u32 ; extern "C" { 
 /// \brief Get the number of video drivers compiled into SDL
///
/// \sa SDL_GetVideoDriver() 
 pub fn SDL_GetNumVideoDrivers ( ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the name of a built in video driver.
///
/// \note The video drivers are presented in the order in which they are
/// normally checked during initialization.
///
/// \sa SDL_GetNumVideoDrivers() 
 pub fn SDL_GetVideoDriver ( index : ctypes :: c_int ) -> * const ctypes :: c_char ; } extern "C" { 
 /// \brief Initialize the video subsystem, optionally specifying a video driver.
///
/// \param driver_name Initialize a specific driver by name, or NULL for the
/// default video driver.
///
/// \return 0 on success, -1 on error
///
/// This function initializes the video subsystem; setting up a connection
/// to the window manager, etc, and determines the available display modes
/// and pixel formats, but does not initialize a window or graphics mode.
///
/// \sa SDL_VideoQuit() 
 pub fn SDL_VideoInit ( driver_name : * const ctypes :: c_char ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Shuts down the video subsystem.
///
/// This function closes all windows, and restores the original video mode.
///
/// \sa SDL_VideoInit() 
 pub fn SDL_VideoQuit ( ) ; } extern "C" { 
 /// \brief Returns the name of the currently initialized video driver.
///
/// \return The name of the current video driver or NULL if no driver
/// has been initialized
///
/// \sa SDL_GetNumVideoDrivers()
/// \sa SDL_GetVideoDriver() 
 pub fn SDL_GetCurrentVideoDriver ( ) -> * const ctypes :: c_char ; } extern "C" { 
 /// \brief Returns the number of available video displays.
///
/// \sa SDL_GetDisplayBounds() 
 pub fn SDL_GetNumVideoDisplays ( ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the name of a display in UTF-8 encoding
///
/// \return The name of a display, or NULL for an invalid display index.
///
/// \sa SDL_GetNumVideoDisplays() 
 pub fn SDL_GetDisplayName ( displayIndex : ctypes :: c_int ) -> * const ctypes :: c_char ; } extern "C" { 
 /// \brief Get the desktop area represented by a display, with the primary
/// display located at 0,0
///
/// \return 0 on success, or -1 if the index is out of range.
///
/// \sa SDL_GetNumVideoDisplays() 
 pub fn SDL_GetDisplayBounds ( displayIndex : ctypes :: c_int , rect : * mut SDL_Rect ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the dots/pixels-per-inch for a display
///
/// \note Diagonal, horizontal and vertical DPI can all be optionally
/// returned if the parameter is non-NULL.
///
/// \return 0 on success, or -1 if no DPI information is available or the index is out of range.
///
/// \sa SDL_GetNumVideoDisplays() 
 pub fn SDL_GetDisplayDPI ( displayIndex : ctypes :: c_int , ddpi : * mut f32 , hdpi : * mut f32 , vdpi : * mut f32 ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the usable desktop area represented by a display, with the
/// primary display located at 0,0
///
/// This is the same area as SDL_GetDisplayBounds() reports, but with portions
/// reserved by the system removed. For example, on Mac OS X, this subtracts
/// the area occupied by the menu bar and dock.
///
/// Setting a window to be fullscreen generally bypasses these unusable areas,
/// so these are good guidelines for the maximum space available to a
/// non-fullscreen window.
///
/// \return 0 on success, or -1 if the index is out of range.
///
/// \sa SDL_GetDisplayBounds()
/// \sa SDL_GetNumVideoDisplays() 
 pub fn SDL_GetDisplayUsableBounds ( displayIndex : ctypes :: c_int , rect : * mut SDL_Rect ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Returns the number of available display modes.
///
/// \sa SDL_GetDisplayMode() 
 pub fn SDL_GetNumDisplayModes ( displayIndex : ctypes :: c_int ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Fill in information about a specific display mode.
///
/// \note The display modes are sorted in this priority:
/// \li bits per pixel -> more colors to fewer colors
/// \li width -> largest to smallest
/// \li height -> largest to smallest
/// \li refresh rate -> highest to lowest
///
/// \sa SDL_GetNumDisplayModes() 
 pub fn SDL_GetDisplayMode ( displayIndex : ctypes :: c_int , modeIndex : ctypes :: c_int , mode : * mut SDL_DisplayMode ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Fill in information about the desktop display mode. 
 pub fn SDL_GetDesktopDisplayMode ( displayIndex : ctypes :: c_int , mode : * mut SDL_DisplayMode ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Fill in information about the current display mode. 
 pub fn SDL_GetCurrentDisplayMode ( displayIndex : ctypes :: c_int , mode : * mut SDL_DisplayMode ) -> ctypes :: c_int ; } extern "C" { 
 /// \brief Get the closest match to the requested display mode.
///
/// \param displayIndex The index of display from which mode should be queried.
/// \param mode The desired display mode
/// \param closest A pointer to a display mode to be filled in with the closest
/// match of the available display modes.
///
/// \return The passed in value \c closest, or NULL if no matching video mode
/// was available.
///
/// The available display modes are scanned, and \c closest is filled in with the
/// closest mode matching the requested mode and returned.  The mode format and
/// refresh_rate default to the desktop mode if they are 0.  The modes are
/// scanned with size being first priority, format being second priority, and
/// finally checking the refresh_rate.  If all the available modes are too
/// small, then NULL is returned.
///
/// \sa SDL_GetNumDisplayModes()
/// \sa SDL_GetDisplayMode() 
 pub fn SDL_GetClosestDisplayMode ( displayIndex : ctypes :: c_int , mode : * const SDL_DisplayMode , closest : * mut SDL_DisplayMode ) -> * mut SDL_DisplayMode ; } extern "C" { 
 /// \brief Get the display index associated with a window.
///
/// \return the display index of the display containing the center of the
